using System.Runtime.InteropServices;

namespace P3R.ModLib.Native;

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FTickFunction
{
    [FieldOffset(0x0008)] public ETickingGroup TickGroup;
    [FieldOffset(0x0009)] public ETickingGroup EndTickGroup;
    [FieldOffset(0x000A)] public byte bTickEvenWhenPaused;
    [FieldOffset(0x000A)] public byte bCanEverTick;
    [FieldOffset(0x000A)] public byte bStartWithTickEnabled;
    [FieldOffset(0x000A)] public byte bAllowTickOnDedicatedServer;
    [FieldOffset(0x000C)] public float TickInterval;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FActorTickFunction
{
    [FieldOffset(0x0000)] public FTickFunction baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x34)] 
public unsafe struct FRepMovement
{
    [FieldOffset(0x0000)] public FVector LinearVelocity;
    [FieldOffset(0x000C)] public FVector AngularVelocity;
    [FieldOffset(0x0018)] public FVector Location;
    [FieldOffset(0x0024)] public FRotator Rotation;
    [FieldOffset(0x0030)] public byte bSimulatedPhysicSleep;
    [FieldOffset(0x0030)] public byte bRepPhysics;
    [FieldOffset(0x0031)] public EVectorQuantization LocationQuantizationLevel;
    [FieldOffset(0x0032)] public EVectorQuantization VelocityQuantizationLevel;
    [FieldOffset(0x0033)] public ERotatorQuantization RotationQuantizationLevel;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FVector_NetQuantize100
{
    [FieldOffset(0x0000)] public FVector baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct FRepAttachment
{
    [FieldOffset(0x0000)] public AActor* AttachParent;
    [FieldOffset(0x0008)] public FVector_NetQuantize100 LocationOffset;
    [FieldOffset(0x0014)] public FVector_NetQuantize100 RelativeScale3D;
    [FieldOffset(0x0020)] public FRotator RotationOffset;
    [FieldOffset(0x002C)] public FName AttachSocket;
    [FieldOffset(0x0038)] public USceneComponent* AttachComponent;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FVector_NetQuantize
{
    [FieldOffset(0x0000)] public FVector baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FVector_NetQuantizeNormal
{
    [FieldOffset(0x0000)] public FVector baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct FHitResult
{
    [FieldOffset(0x0000)] public int FaceIndex;
    [FieldOffset(0x0004)] public float Time;
    [FieldOffset(0x0008)] public float Distance;
    [FieldOffset(0x000C)] public FVector_NetQuantize Location;
    [FieldOffset(0x0018)] public FVector_NetQuantize ImpactPoint;
    [FieldOffset(0x0024)] public FVector_NetQuantizeNormal Normal;
    [FieldOffset(0x0030)] public FVector_NetQuantizeNormal ImpactNormal;
    [FieldOffset(0x003C)] public FVector_NetQuantize TraceStart;
    [FieldOffset(0x0048)] public FVector_NetQuantize TraceEnd;
    [FieldOffset(0x0054)] public float PenetrationDepth;
    [FieldOffset(0x0058)] public int Item;
    [FieldOffset(0x005C)] public byte ElementIndex;
    [FieldOffset(0x005D)] public byte bBlockingHit;
    [FieldOffset(0x005D)] public byte bStartPenetrating;
    [FieldOffset(0x0060)] public TWeakObjectPtr<UPhysicalMaterial> PhysMaterial;
    [FieldOffset(0x0068)] public TWeakObjectPtr<AActor> Actor;
    [FieldOffset(0x0070)] public TWeakObjectPtr<UPrimitiveComponent> Component;
    [FieldOffset(0x0078)] public FName BoneName;
    [FieldOffset(0x0080)] public FName MyBoneName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x220)] 
public unsafe struct AActor
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public FActorTickFunction PrimaryActorTick;
    [FieldOffset(0x0058)] public byte bNetTemporary;
    [FieldOffset(0x0058)] public byte bNetStartup;
    [FieldOffset(0x0058)] public byte bOnlyRelevantToOwner;
    [FieldOffset(0x0058)] public byte bAlwaysRelevant;
    [FieldOffset(0x0058)] public byte bReplicateMovement;
    [FieldOffset(0x0058)] public byte bHidden;
    [FieldOffset(0x0058)] public byte bTearOff;
    [FieldOffset(0x0058)] public byte bForceNetAddressable;
    [FieldOffset(0x0059)] public byte bExchangedRoles;
    [FieldOffset(0x0059)] public byte bNetLoadOnClient;
    [FieldOffset(0x0059)] public byte bNetUseOwnerRelevancy;
    [FieldOffset(0x0059)] public byte bRelevantForNetworkReplays;
    [FieldOffset(0x0059)] public byte bRelevantForLevelBounds;
    [FieldOffset(0x0059)] public byte bReplayRewindable;
    [FieldOffset(0x0059)] public byte bAllowTickBeforeBeginPlay;
    [FieldOffset(0x0059)] public byte bAutoDestroyWhenFinished;
    [FieldOffset(0x005A)] public byte bCanBeDamaged;
    [FieldOffset(0x005A)] public byte bBlockInput;
    [FieldOffset(0x005A)] public byte bCollideWhenPlacing;
    [FieldOffset(0x005A)] public byte bFindCameraComponentWhenViewTarget;
    [FieldOffset(0x005A)] public byte bGenerateOverlapEventsDuringLevelStreaming;
    [FieldOffset(0x005A)] public byte bIgnoresOriginShifting;
    [FieldOffset(0x005A)] public byte bEnableAutoLODGeneration;
    [FieldOffset(0x005A)] public byte bIsEditorOnlyActor;
    [FieldOffset(0x005B)] public byte bActorSeamlessTraveled;
    [FieldOffset(0x005B)] public byte bReplicates;
    [FieldOffset(0x005B)] public byte bCanBeInCluster;
    [FieldOffset(0x005B)] public byte bAllowReceiveTickEventOnDedicatedServer;
    [FieldOffset(0x005C)] public byte bActorEnableCollision;
    [FieldOffset(0x005C)] public byte bActorIsBeingDestroyed;
    [FieldOffset(0x005D)] public EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming;
    [FieldOffset(0x005E)] public EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming;
    [FieldOffset(0x005F)] public ENetRole RemoteRole;
    [FieldOffset(0x0060)] public FRepMovement ReplicatedMovement;
    [FieldOffset(0x0094)] public float InitialLifeSpan;
    [FieldOffset(0x0098)] public float CustomTimeDilation;
    [FieldOffset(0x00A0)] public FRepAttachment AttachmentReplication;
    [FieldOffset(0x00E0)] public AActor* Owner;
    [FieldOffset(0x00E8)] public FName NetDriverName;
    [FieldOffset(0x00F0)] public ENetRole Role;
    [FieldOffset(0x00F1)] public ENetDormancy NetDormancy;
    [FieldOffset(0x00F2)] public ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod;
    [FieldOffset(0x00F3)] public EAutoReceiveInput AutoReceiveInput;
    [FieldOffset(0x00F4)] public int InputPriority;
    [FieldOffset(0x00F8)] public UInputComponent* InputComponent;
    [FieldOffset(0x0100)] public float NetCullDistanceSquared;
    [FieldOffset(0x0104)] public int NetTag;
    [FieldOffset(0x0108)] public float NetUpdateFrequency;
    [FieldOffset(0x010C)] public float MinNetUpdateFrequency;
    [FieldOffset(0x0110)] public float NetPriority;
    [FieldOffset(0x0118)] public APawn* Instigator;
    [FieldOffset(0x0120)] public TArray<IntPtr> Children;
    [FieldOffset(0x0130)] public USceneComponent* RootComponent;
    [FieldOffset(0x0138)] public TArray<IntPtr> ControllingMatineeActors;
    [FieldOffset(0x0150)] public TArray<FName> Layers;
    [FieldOffset(0x0160)] public TWeakObjectPtr<UChildActorComponent> ParentComponent;
    [FieldOffset(0x0170)] public TArray<FName> Tags;
    [FieldOffset(0x01F0)] public TArray<IntPtr> InstanceComponents;
    [FieldOffset(0x0200)] public TArray<IntPtr> BlueprintCreatedComponents;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FActorComponentTickFunction
{
    [FieldOffset(0x0000)] public FTickFunction baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FSimpleMemberReference
{
    [FieldOffset(0x0000)] public UObject* MemberParent;
    [FieldOffset(0x0008)] public FName MemberName;
    [FieldOffset(0x0010)] public FGuid MemberGuid;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB0)] 
public unsafe struct UActorComponent
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public FActorComponentTickFunction PrimaryComponentTick;
    [FieldOffset(0x0060)] public TArray<FName> ComponentTags;
    [FieldOffset(0x0070)] public TArray<IntPtr> AssetUserData;
    [FieldOffset(0x0084)] public int UCSSerializationIndex;
    [FieldOffset(0x0088)] public byte bNetAddressable;
    [FieldOffset(0x0088)] public byte bReplicates;
    [FieldOffset(0x0089)] public byte bAutoActivate;
    [FieldOffset(0x008A)] public byte bIsActive;
    [FieldOffset(0x008A)] public byte bEditableWhenInherited;
    [FieldOffset(0x008A)] public byte bCanEverAffectNavigation;
    [FieldOffset(0x008A)] public byte bIsEditorOnly;
    [FieldOffset(0x008C)] public EComponentCreationMethod CreationMethod;
    [FieldOffset(0x0090)] public TArray<FSimpleMemberReference> UCSModifiedProperties;
}

[StructLayout(LayoutKind.Explicit, Size = 0x200)] 
public unsafe struct USceneComponent
{
    [FieldOffset(0x0000)] public UActorComponent baseObj;
    [FieldOffset(0x00B8)] public TWeakObjectPtr<APhysicsVolume> PhysicsVolume;
    [FieldOffset(0x00C0)] public USceneComponent* AttachParent;
    [FieldOffset(0x00C8)] public FName AttachSocketName;
    [FieldOffset(0x00D0)] public TArray<IntPtr> AttachChildren;
    [FieldOffset(0x00E0)] public TArray<IntPtr> ClientAttachedChildren;
    [FieldOffset(0x011C)] public FVector RelativeLocation;
    [FieldOffset(0x0128)] public FRotator RelativeRotation;
    [FieldOffset(0x0134)] public FVector RelativeScale3D;
    [FieldOffset(0x0140)] public FVector ComponentVelocity;
    [FieldOffset(0x014C)] public byte bComponentToWorldUpdated;
    [FieldOffset(0x014C)] public byte bAbsoluteLocation;
    [FieldOffset(0x014C)] public byte bAbsoluteRotation;
    [FieldOffset(0x014C)] public byte bAbsoluteScale;
    [FieldOffset(0x014C)] public byte bVisible;
    [FieldOffset(0x014C)] public byte bShouldBeAttached;
    [FieldOffset(0x014C)] public byte bShouldSnapLocationWhenAttached;
    [FieldOffset(0x014D)] public byte bShouldSnapRotationWhenAttached;
    [FieldOffset(0x014D)] public byte bShouldUpdatePhysicsVolume;
    [FieldOffset(0x014D)] public byte bHiddenInGame;
    [FieldOffset(0x014D)] public byte bBoundsChangeTriggersStreamingDataRebuild;
    [FieldOffset(0x014D)] public byte bUseAttachParentBound;
    [FieldOffset(0x014F)] public EComponentMobility Mobility;
    [FieldOffset(0x0150)] public EDetailMode DetailMode;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1)] 
public unsafe struct FLightingChannels
{
    [FieldOffset(0x0000)] public byte bChannel0;
    [FieldOffset(0x0000)] public byte bChannel1;
    [FieldOffset(0x0000)] public byte bChannel2;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FCustomPrimitiveData
{
    [FieldOffset(0x0000)] public TArray<float> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FCollisionResponseContainer
{
    [FieldOffset(0x0000)] public ECollisionResponse WorldStatic;
    [FieldOffset(0x0001)] public ECollisionResponse WorldDynamic;
    [FieldOffset(0x0002)] public ECollisionResponse Pawn;
    [FieldOffset(0x0003)] public ECollisionResponse Visibility;
    [FieldOffset(0x0004)] public ECollisionResponse Camera;
    [FieldOffset(0x0005)] public ECollisionResponse PhysicsBody;
    [FieldOffset(0x0006)] public ECollisionResponse Vehicle;
    [FieldOffset(0x0007)] public ECollisionResponse Destructible;
    [FieldOffset(0x0008)] public ECollisionResponse EngineTraceChannel1;
    [FieldOffset(0x0009)] public ECollisionResponse EngineTraceChannel2;
    [FieldOffset(0x000A)] public ECollisionResponse EngineTraceChannel3;
    [FieldOffset(0x000B)] public ECollisionResponse EngineTraceChannel4;
    [FieldOffset(0x000C)] public ECollisionResponse EngineTraceChannel5;
    [FieldOffset(0x000D)] public ECollisionResponse EngineTraceChannel6;
    [FieldOffset(0x000E)] public ECollisionResponse GameTraceChannel1;
    [FieldOffset(0x000F)] public ECollisionResponse GameTraceChannel2;
    [FieldOffset(0x0010)] public ECollisionResponse GameTraceChannel3;
    [FieldOffset(0x0011)] public ECollisionResponse GameTraceChannel4;
    [FieldOffset(0x0012)] public ECollisionResponse GameTraceChannel5;
    [FieldOffset(0x0013)] public ECollisionResponse GameTraceChannel6;
    [FieldOffset(0x0014)] public ECollisionResponse GameTraceChannel7;
    [FieldOffset(0x0015)] public ECollisionResponse GameTraceChannel8;
    [FieldOffset(0x0016)] public ECollisionResponse GameTraceChannel9;
    [FieldOffset(0x0017)] public ECollisionResponse GameTraceChannel10;
    [FieldOffset(0x0018)] public ECollisionResponse GameTraceChannel11;
    [FieldOffset(0x0019)] public ECollisionResponse GameTraceChannel12;
    [FieldOffset(0x001A)] public ECollisionResponse GameTraceChannel13;
    [FieldOffset(0x001B)] public ECollisionResponse GameTraceChannel14;
    [FieldOffset(0x001C)] public ECollisionResponse GameTraceChannel15;
    [FieldOffset(0x001D)] public ECollisionResponse GameTraceChannel16;
    [FieldOffset(0x001E)] public ECollisionResponse GameTraceChannel17;
    [FieldOffset(0x001F)] public ECollisionResponse GameTraceChannel18;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FResponseChannel
{
    [FieldOffset(0x0000)] public FName Channel;
    [FieldOffset(0x0008)] public ECollisionResponse Response;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FCollisionResponse
{
    [FieldOffset(0x0000)] public FCollisionResponseContainer ResponseToChannels;
    [FieldOffset(0x0020)] public TArray<FResponseChannel> ResponseArray;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FWalkableSlopeOverride
{
    [FieldOffset(0x0000)] public EWalkableSlopeBehavior WalkableSlopeBehavior;
    [FieldOffset(0x0004)] public float WalkableSlopeAngle;
}

[StructLayout(LayoutKind.Explicit, Size = 0x158)] 
public unsafe struct FBodyInstance
{
    [FieldOffset(0x0000)] public FBodyInstanceCore baseObj;
    [FieldOffset(0x001E)] public ECollisionChannel ObjectType;
    [FieldOffset(0x0020)] public ECollisionEnabled CollisionEnabled;
    [FieldOffset(0x0059)] public ESleepFamily SleepFamily;
    [FieldOffset(0x005A)] public EDOFMode DOFMode;
    [FieldOffset(0x005B)] public byte bUseCCD;
    [FieldOffset(0x005B)] public byte bIgnoreAnalyticCollisions;
    [FieldOffset(0x005B)] public byte bNotifyRigidBodyCollision;
    [FieldOffset(0x005B)] public byte bLockTranslation;
    [FieldOffset(0x005B)] public byte bLockRotation;
    [FieldOffset(0x005B)] public byte bLockXTranslation;
    [FieldOffset(0x005B)] public byte bLockYTranslation;
    [FieldOffset(0x005C)] public byte bLockZTranslation;
    [FieldOffset(0x005C)] public byte bLockXRotation;
    [FieldOffset(0x005C)] public byte bLockYRotation;
    [FieldOffset(0x005C)] public byte bLockZRotation;
    [FieldOffset(0x005C)] public byte bOverrideMaxAngularVelocity;
    [FieldOffset(0x005C)] public byte bOverrideMaxDepenetrationVelocity;
    [FieldOffset(0x005D)] public byte bOverrideWalkableSlopeOnInstance;
    [FieldOffset(0x005D)] public byte bInterpolateWhenSubStepping;
    [FieldOffset(0x006C)] public FName CollisionProfileName;
    [FieldOffset(0x0074)] public byte PositionSolverIterationCount;
    [FieldOffset(0x0075)] public byte VelocitySolverIterationCount;
    [FieldOffset(0x0078)] public FCollisionResponse CollisionResponses;
    [FieldOffset(0x00A8)] public float MaxDepenetrationVelocity;
    [FieldOffset(0x00AC)] public float MassInKgOverride;
    [FieldOffset(0x00B8)] public float LinearDamping;
    [FieldOffset(0x00BC)] public float AngularDamping;
    [FieldOffset(0x00C0)] public FVector CustomDOFPlaneNormal;
    [FieldOffset(0x00CC)] public FVector COMNudge;
    [FieldOffset(0x00D8)] public float MassScale;
    [FieldOffset(0x00DC)] public FVector InertiaTensorScale;
    [FieldOffset(0x00F8)] public FWalkableSlopeOverride WalkableSlopeOverride;
    [FieldOffset(0x0108)] public UPhysicalMaterial* PhysMaterialOverride;
    [FieldOffset(0x0110)] public float MaxAngularVelocity;
    [FieldOffset(0x0114)] public float CustomSleepThresholdMultiplier;
    [FieldOffset(0x0118)] public float StabilizationThresholdMultiplier;
    [FieldOffset(0x011C)] public float PhysicsBlendWeight;
}

[StructLayout(LayoutKind.Explicit, Size = 0x450)] 
public unsafe struct UPrimitiveComponent
{
    [FieldOffset(0x0000)] public USceneComponent baseObj;
    [FieldOffset(0x0200)] public float MinDrawDistance;
    [FieldOffset(0x0204)] public float LDMaxDrawDistance;
    [FieldOffset(0x0208)] public float CachedMaxDrawDistance;
    [FieldOffset(0x020C)] public ESceneDepthPriorityGroup DepthPriorityGroup;
    [FieldOffset(0x020D)] public ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup;
    [FieldOffset(0x020E)] public EIndirectLightingCacheQuality IndirectLightingCacheQuality;
    [FieldOffset(0x020F)] public ELightmapType LightmapType;
    [FieldOffset(0x0210)] public byte bUseMaxLODAsImposter;
    [FieldOffset(0x0210)] public byte bBatchImpostersAsInstances;
    [FieldOffset(0x0210)] public byte bNeverDistanceCull;
    [FieldOffset(0x0210)] public byte bAlwaysCreatePhysicsState;
    [FieldOffset(0x0211)] public byte bGenerateOverlapEvents;
    [FieldOffset(0x0211)] public byte bMultiBodyOverlap;
    [FieldOffset(0x0211)] public byte bTraceComplexOnMove;
    [FieldOffset(0x0211)] public byte bReturnMaterialOnMove;
    [FieldOffset(0x0211)] public byte bUseViewOwnerDepthPriorityGroup;
    [FieldOffset(0x0211)] public byte bAllowCullDistanceVolume;
    [FieldOffset(0x0211)] public byte bHasMotionBlurVelocityMeshes;
    [FieldOffset(0x0211)] public byte bVisibleInReflectionCaptures;
    [FieldOffset(0x0212)] public byte bVisibleInRealTimeSkyCaptures;
    [FieldOffset(0x0212)] public byte bVisibleInRayTracing;
    [FieldOffset(0x0212)] public byte bRenderInMainPass;
    [FieldOffset(0x0212)] public byte bRenderInDepthPass;
    [FieldOffset(0x0212)] public byte bReceivesDecals;
    [FieldOffset(0x0212)] public byte bOwnerNoSee;
    [FieldOffset(0x0212)] public byte bOnlyOwnerSee;
    [FieldOffset(0x0212)] public byte bTreatAsBackgroundForOcclusion;
    [FieldOffset(0x0213)] public byte bUseAsOccluder;
    [FieldOffset(0x0213)] public byte bSelectable;
    [FieldOffset(0x0213)] public byte bForceMipStreaming;
    [FieldOffset(0x0213)] public byte bHasPerInstanceHitProxies;
    [FieldOffset(0x0213)] public byte CastShadow;
    [FieldOffset(0x0213)] public byte bAffectDynamicIndirectLighting;
    [FieldOffset(0x0213)] public byte bAffectDistanceFieldLighting;
    [FieldOffset(0x0213)] public byte bCastDynamicShadow;
    [FieldOffset(0x0214)] public byte bCastStaticShadow;
    [FieldOffset(0x0214)] public byte bCastVolumetricTranslucentShadow;
    [FieldOffset(0x0214)] public byte bCastContactShadow;
    [FieldOffset(0x0214)] public byte bSelfShadowOnly;
    [FieldOffset(0x0214)] public byte bCastFarShadow;
    [FieldOffset(0x0214)] public byte bCastInsetShadow;
    [FieldOffset(0x0214)] public byte bCastCinematicShadow;
    [FieldOffset(0x0214)] public byte bCastHiddenShadow;
    [FieldOffset(0x0215)] public byte bCastShadowAsTwoSided;
    [FieldOffset(0x0215)] public byte bLightAsIfStatic;
    [FieldOffset(0x0215)] public byte bLightAttachmentsAsGroup;
    [FieldOffset(0x0215)] public byte bExcludeFromLightAttachmentGroup;
    [FieldOffset(0x0215)] public byte bReceiveMobileCSMShadows;
    [FieldOffset(0x0215)] public byte bSingleSampleShadowFromStationaryLights;
    [FieldOffset(0x0215)] public byte bIgnoreRadialImpulse;
    [FieldOffset(0x0215)] public byte bIgnoreRadialForce;
    [FieldOffset(0x0216)] public byte bApplyImpulseOnDamage;
    [FieldOffset(0x0216)] public byte bReplicatePhysicsToAutonomousProxy;
    [FieldOffset(0x0216)] public byte bFillCollisionUnderneathForNavmesh;
    [FieldOffset(0x0216)] public byte AlwaysLoadOnClient;
    [FieldOffset(0x0216)] public byte AlwaysLoadOnServer;
    [FieldOffset(0x0216)] public byte bUseEditorCompositing;
    [FieldOffset(0x0216)] public byte bRenderCustomDepth;
    [FieldOffset(0x0216)] public byte bVisibleInSceneCaptureOnly;
    [FieldOffset(0x0217)] public byte bHiddenInSceneCapture;
    [FieldOffset(0x0218)] public EHasCustomNavigableGeometry bHasCustomNavigableGeometry;
    [FieldOffset(0x021A)] public ECanBeCharacterBase CanCharacterStepUpOn;
    [FieldOffset(0x021B)] public FLightingChannels LightingChannels;
    [FieldOffset(0x021C)] public EShadowChannel CustomShadowChannel;
    [FieldOffset(0x021D)] public ERendererStencilMask CustomDepthStencilWriteMask;
    [FieldOffset(0x0220)] public int CustomDepthStencilValue;
    [FieldOffset(0x0228)] public FCustomPrimitiveData CustomPrimitiveData;
    [FieldOffset(0x0238)] public FCustomPrimitiveData CustomPrimitiveDataInternal;
    [FieldOffset(0x0250)] public int TranslucencySortPriority;
    [FieldOffset(0x0254)] public float TranslucencySortDistanceOffset;
    [FieldOffset(0x0258)] public int VisibilityId;
    [FieldOffset(0x0260)] public TArray<IntPtr> RuntimeVirtualTextures;
    [FieldOffset(0x0270)] public sbyte VirtualTextureLodBias;
    [FieldOffset(0x0271)] public sbyte VirtualTextureCullMips;
    [FieldOffset(0x0272)] public sbyte VirtualTextureMinCoverage;
    [FieldOffset(0x0273)] public ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType;
    [FieldOffset(0x0278)] public float LpvBiasMultiplier;
    [FieldOffset(0x0284)] public float BoundsScale;
    [FieldOffset(0x0298)] public TArray<IntPtr> MoveIgnoreActors;
    [FieldOffset(0x02A8)] public TArray<IntPtr> MoveIgnoreComponents;
    [FieldOffset(0x02C8)] public FBodyInstance BodyInstance;
    [FieldOffset(0x0448)] public UPrimitiveComponent* LODParentPrimitive;
}

[StructLayout(LayoutKind.Explicit, Size = 0x450)] 
public unsafe struct UFXSystemComponent
{
    [FieldOffset(0x0000)] public UPrimitiveComponent baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBlueprintFunctionLibrary
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct FKeyHandleMap
{
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct FIndexedCurve
{
    [FieldOffset(0x0008)] public FKeyHandleMap KeyHandlesToIndices;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct FRealCurve
{
    [FieldOffset(0x0000)] public FIndexedCurve baseObj;
    [FieldOffset(0x0068)] public float DefaultValue;
    [FieldOffset(0x006C)] public ERichCurveExtrapolation PreInfinityExtrap;
    [FieldOffset(0x006D)] public ERichCurveExtrapolation PostInfinityExtrap;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C)] 
public unsafe struct FRichCurveKey
{
    [FieldOffset(0x0000)] public ERichCurveInterpMode InterpMode;
    [FieldOffset(0x0001)] public ERichCurveTangentMode TangentMode;
    [FieldOffset(0x0002)] public ERichCurveTangentWeightMode TangentWeightMode;
    [FieldOffset(0x0004)] public float Time;
    [FieldOffset(0x0008)] public float Value;
    [FieldOffset(0x000C)] public float ArriveTangent;
    [FieldOffset(0x0010)] public float ArriveTangentWeight;
    [FieldOffset(0x0014)] public float LeaveTangent;
    [FieldOffset(0x0018)] public float LeaveTangentWeight;
}

[StructLayout(LayoutKind.Explicit, Size = 0x80)] 
public unsafe struct FRichCurve
{
    [FieldOffset(0x0000)] public FRealCurve baseObj;
    [FieldOffset(0x0070)] public TArray<FRichCurveKey> Keys;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UFXSystemAsset
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public uint MaxPoolSize;
    [FieldOffset(0x002C)] public uint PoolPrimeSize;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UAnimNotify
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UAnimNotifyState
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FWeightedBlendable
{
    [FieldOffset(0x0000)] public float Weight;
    [FieldOffset(0x0008)] public UObject* Object;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FWeightedBlendables
{
    [FieldOffset(0x0000)] public TArray<FWeightedBlendable> Array;
}

[StructLayout(LayoutKind.Explicit, Size = 0x560)] 
public unsafe struct FPostProcessSettings
{
    [FieldOffset(0x0000)] public byte bOverride_TemperatureType;
    [FieldOffset(0x0000)] public byte bOverride_WhiteTemp;
    [FieldOffset(0x0000)] public byte bOverride_WhiteTint;
    [FieldOffset(0x0000)] public byte bOverride_ColorSaturation;
    [FieldOffset(0x0000)] public byte bOverride_ColorContrast;
    [FieldOffset(0x0000)] public byte bOverride_ColorGamma;
    [FieldOffset(0x0000)] public byte bOverride_ColorGain;
    [FieldOffset(0x0000)] public byte bOverride_ColorOffset;
    [FieldOffset(0x0001)] public byte bOverride_ColorSaturationShadows;
    [FieldOffset(0x0001)] public byte bOverride_ColorContrastShadows;
    [FieldOffset(0x0001)] public byte bOverride_ColorGammaShadows;
    [FieldOffset(0x0001)] public byte bOverride_ColorGainShadows;
    [FieldOffset(0x0001)] public byte bOverride_ColorOffsetShadows;
    [FieldOffset(0x0001)] public byte bOverride_ColorSaturationMidtones;
    [FieldOffset(0x0001)] public byte bOverride_ColorContrastMidtones;
    [FieldOffset(0x0001)] public byte bOverride_ColorGammaMidtones;
    [FieldOffset(0x0002)] public byte bOverride_ColorGainMidtones;
    [FieldOffset(0x0002)] public byte bOverride_ColorOffsetMidtones;
    [FieldOffset(0x0002)] public byte bOverride_ColorSaturationHighlights;
    [FieldOffset(0x0002)] public byte bOverride_ColorContrastHighlights;
    [FieldOffset(0x0002)] public byte bOverride_ColorGammaHighlights;
    [FieldOffset(0x0002)] public byte bOverride_ColorGainHighlights;
    [FieldOffset(0x0002)] public byte bOverride_ColorOffsetHighlights;
    [FieldOffset(0x0002)] public byte bOverride_ColorCorrectionShadowsMax;
    [FieldOffset(0x0003)] public byte bOverride_ColorCorrectionHighlightsMin;
    [FieldOffset(0x0003)] public byte bOverride_BlueCorrection;
    [FieldOffset(0x0003)] public byte bOverride_ExpandGamut;
    [FieldOffset(0x0003)] public byte bOverride_ToneCurveAmount;
    [FieldOffset(0x0003)] public byte bOverride_FilmWhitePoint;
    [FieldOffset(0x0003)] public byte bOverride_FilmSaturation;
    [FieldOffset(0x0003)] public byte bOverride_FilmChannelMixerRed;
    [FieldOffset(0x0003)] public byte bOverride_FilmChannelMixerGreen;
    [FieldOffset(0x0004)] public byte bOverride_FilmChannelMixerBlue;
    [FieldOffset(0x0004)] public byte bOverride_FilmContrast;
    [FieldOffset(0x0004)] public byte bOverride_FilmDynamicRange;
    [FieldOffset(0x0004)] public byte bOverride_FilmHealAmount;
    [FieldOffset(0x0004)] public byte bOverride_FilmToeAmount;
    [FieldOffset(0x0004)] public byte bOverride_FilmShadowTint;
    [FieldOffset(0x0004)] public byte bOverride_FilmShadowTintBlend;
    [FieldOffset(0x0004)] public byte bOverride_FilmShadowTintAmount;
    [FieldOffset(0x0005)] public byte bOverride_FilmSlope;
    [FieldOffset(0x0005)] public byte bOverride_FilmToe;
    [FieldOffset(0x0005)] public byte bOverride_FilmShoulder;
    [FieldOffset(0x0005)] public byte bOverride_FilmBlackClip;
    [FieldOffset(0x0005)] public byte bOverride_FilmWhiteClip;
    [FieldOffset(0x0005)] public byte bOverride_SceneColorTint;
    [FieldOffset(0x0005)] public byte bOverride_SceneFringeIntensity;
    [FieldOffset(0x0005)] public byte bOverride_ChromaticAberrationStartOffset;
    [FieldOffset(0x0006)] public byte bOverride_AmbientCubemapTint;
    [FieldOffset(0x0006)] public byte bOverride_AmbientCubemapIntensity;
    [FieldOffset(0x0006)] public byte bOverride_BloomMethod;
    [FieldOffset(0x0006)] public byte bOverride_BloomIntensity;
    [FieldOffset(0x0006)] public byte bOverride_BloomThreshold;
    [FieldOffset(0x0006)] public byte bOverride_Bloom1Tint;
    [FieldOffset(0x0006)] public byte bOverride_Bloom1Size;
    [FieldOffset(0x0006)] public byte bOverride_Bloom2Size;
    [FieldOffset(0x0007)] public byte bOverride_Bloom2Tint;
    [FieldOffset(0x0007)] public byte bOverride_Bloom3Tint;
    [FieldOffset(0x0007)] public byte bOverride_Bloom3Size;
    [FieldOffset(0x0007)] public byte bOverride_Bloom4Tint;
    [FieldOffset(0x0007)] public byte bOverride_Bloom4Size;
    [FieldOffset(0x0007)] public byte bOverride_Bloom5Tint;
    [FieldOffset(0x0007)] public byte bOverride_Bloom5Size;
    [FieldOffset(0x0007)] public byte bOverride_Bloom6Tint;
    [FieldOffset(0x0008)] public byte bOverride_Bloom6Size;
    [FieldOffset(0x0008)] public byte bOverride_BloomSizeScale;
    [FieldOffset(0x0008)] public byte bOverride_BloomConvolutionTexture;
    [FieldOffset(0x0008)] public byte bOverride_BloomConvolutionSize;
    [FieldOffset(0x0008)] public byte bOverride_BloomConvolutionCenterUV;
    [FieldOffset(0x0008)] public byte bOverride_BloomConvolutionPreFilter;
    [FieldOffset(0x0008)] public byte bOverride_BloomConvolutionPreFilterMin;
    [FieldOffset(0x0008)] public byte bOverride_BloomConvolutionPreFilterMax;
    [FieldOffset(0x0009)] public byte bOverride_BloomConvolutionPreFilterMult;
    [FieldOffset(0x0009)] public byte bOverride_BloomConvolutionBufferScale;
    [FieldOffset(0x0009)] public byte bOverride_BloomDirtMaskIntensity;
    [FieldOffset(0x0009)] public byte bOverride_BloomDirtMaskTint;
    [FieldOffset(0x0009)] public byte bOverride_BloomDirtMask;
    [FieldOffset(0x0009)] public byte bOverride_CameraShutterSpeed;
    [FieldOffset(0x0009)] public byte bOverride_CameraISO;
    [FieldOffset(0x0009)] public byte bOverride_AutoExposureMethod;
    [FieldOffset(0x000A)] public byte bOverride_AutoExposureLowPercent;
    [FieldOffset(0x000A)] public byte bOverride_AutoExposureHighPercent;
    [FieldOffset(0x000A)] public byte bOverride_AutoExposureMinBrightness;
    [FieldOffset(0x000A)] public byte bOverride_AutoExposureMaxBrightness;
    [FieldOffset(0x000A)] public byte bOverride_AutoExposureCalibrationConstant;
    [FieldOffset(0x000A)] public byte bOverride_AutoExposureSpeedUp;
    [FieldOffset(0x000A)] public byte bOverride_AutoExposureSpeedDown;
    [FieldOffset(0x000A)] public byte bOverride_AutoExposureBias;
    [FieldOffset(0x000B)] public byte bOverride_AutoExposureBiasCurve;
    [FieldOffset(0x000B)] public byte bOverride_AutoExposureMeterMask;
    [FieldOffset(0x000B)] public byte bOverride_AutoExposureApplyPhysicalCameraExposure;
    [FieldOffset(0x000B)] public byte bOverride_HistogramLogMin;
    [FieldOffset(0x000B)] public byte bOverride_HistogramLogMax;
    [FieldOffset(0x000B)] public byte bOverride_LensFlareIntensity;
    [FieldOffset(0x000B)] public byte bOverride_LensFlareTint;
    [FieldOffset(0x000B)] public byte bOverride_LensFlareTints;
    [FieldOffset(0x000C)] public byte bOverride_LensFlareBokehSize;
    [FieldOffset(0x000C)] public byte bOverride_LensFlareBokehShape;
    [FieldOffset(0x000C)] public byte bOverride_LensFlareThreshold;
    [FieldOffset(0x000C)] public byte bOverride_VignetteIntensity;
    [FieldOffset(0x000C)] public byte bOverride_GrainIntensity;
    [FieldOffset(0x000C)] public byte bOverride_GrainJitter;
    [FieldOffset(0x000C)] public byte bOverride_AmbientOcclusionIntensity;
    [FieldOffset(0x000C)] public byte bOverride_AmbientOcclusionStaticFraction;
    [FieldOffset(0x000D)] public byte bOverride_AmbientOcclusionRadius;
    [FieldOffset(0x000D)] public byte bOverride_AmbientOcclusionFadeDistance;
    [FieldOffset(0x000D)] public byte bOverride_AmbientOcclusionFadeRadius;
    [FieldOffset(0x000D)] public byte bOverride_AmbientOcclusionDistance;
    [FieldOffset(0x000D)] public byte bOverride_AmbientOcclusionRadiusInWS;
    [FieldOffset(0x000D)] public byte bOverride_AmbientOcclusionPower;
    [FieldOffset(0x000D)] public byte bOverride_AmbientOcclusionBias;
    [FieldOffset(0x000D)] public byte bOverride_AmbientOcclusionQuality;
    [FieldOffset(0x000E)] public byte bOverride_AmbientOcclusionMipBlend;
    [FieldOffset(0x000E)] public byte bOverride_AmbientOcclusionMipScale;
    [FieldOffset(0x000E)] public byte bOverride_AmbientOcclusionMipThreshold;
    [FieldOffset(0x000E)] public byte bOverride_AmbientOcclusionTemporalBlendWeight;
    [FieldOffset(0x0010)] public byte bOverride_RayTracingAO;
    [FieldOffset(0x0010)] public byte bOverride_RayTracingAOSamplesPerPixel;
    [FieldOffset(0x0010)] public byte bOverride_RayTracingAOIntensity;
    [FieldOffset(0x0010)] public byte bOverride_RayTracingAORadius;
    [FieldOffset(0x0014)] public byte bOverride_LPVIntensity;
    [FieldOffset(0x0014)] public byte bOverride_LPVDirectionalOcclusionIntensity;
    [FieldOffset(0x0014)] public byte bOverride_LPVDirectionalOcclusionRadius;
    [FieldOffset(0x0014)] public byte bOverride_LPVDiffuseOcclusionExponent;
    [FieldOffset(0x0014)] public byte bOverride_LPVSpecularOcclusionExponent;
    [FieldOffset(0x0014)] public byte bOverride_LPVDiffuseOcclusionIntensity;
    [FieldOffset(0x0014)] public byte bOverride_LPVSpecularOcclusionIntensity;
    [FieldOffset(0x0014)] public byte bOverride_LPVSize;
    [FieldOffset(0x0015)] public byte bOverride_LPVSecondaryOcclusionIntensity;
    [FieldOffset(0x0015)] public byte bOverride_LPVSecondaryBounceIntensity;
    [FieldOffset(0x0015)] public byte bOverride_LPVGeometryVolumeBias;
    [FieldOffset(0x0015)] public byte bOverride_LPVVplInjectionBias;
    [FieldOffset(0x0015)] public byte bOverride_LPVEmissiveInjectionIntensity;
    [FieldOffset(0x0015)] public byte bOverride_LPVFadeRange;
    [FieldOffset(0x0015)] public byte bOverride_LPVDirectionalOcclusionFadeRange;
    [FieldOffset(0x0015)] public byte bOverride_IndirectLightingColor;
    [FieldOffset(0x0016)] public byte bOverride_IndirectLightingIntensity;
    [FieldOffset(0x0016)] public byte bOverride_ColorGradingIntensity;
    [FieldOffset(0x0016)] public byte bOverride_ColorGradingLUT;
    [FieldOffset(0x0016)] public byte bOverride_DepthOfFieldFocalDistance;
    [FieldOffset(0x0016)] public byte bOverride_DepthOfFieldFstop;
    [FieldOffset(0x0016)] public byte bOverride_DepthOfFieldMinFstop;
    [FieldOffset(0x0016)] public byte bOverride_DepthOfFieldBladeCount;
    [FieldOffset(0x0016)] public byte bOverride_DepthOfFieldSensorWidth;
    [FieldOffset(0x0017)] public byte bOverride_DepthOfFieldDepthBlurRadius;
    [FieldOffset(0x0017)] public byte bOverride_DepthOfFieldDepthBlurAmount;
    [FieldOffset(0x0017)] public byte bOverride_DepthOfFieldFocalRegion;
    [FieldOffset(0x0017)] public byte bOverride_DepthOfFieldNearTransitionRegion;
    [FieldOffset(0x0017)] public byte bOverride_DepthOfFieldFarTransitionRegion;
    [FieldOffset(0x0017)] public byte bOverride_DepthOfFieldScale;
    [FieldOffset(0x0017)] public byte bOverride_DepthOfFieldNearBlurSize;
    [FieldOffset(0x0017)] public byte bOverride_DepthOfFieldFarBlurSize;
    [FieldOffset(0x0018)] public byte bOverride_MobileHQGaussian;
    [FieldOffset(0x0018)] public byte bOverride_DepthOfFieldOcclusion;
    [FieldOffset(0x0018)] public byte bOverride_DepthOfFieldSkyFocusDistance;
    [FieldOffset(0x0018)] public byte bOverride_DepthOfFieldVignetteSize;
    [FieldOffset(0x0018)] public byte bOverride_MotionBlurAmount;
    [FieldOffset(0x0018)] public byte bOverride_MotionBlurMax;
    [FieldOffset(0x0018)] public byte bOverride_MotionBlurTargetFPS;
    [FieldOffset(0x0018)] public byte bOverride_MotionBlurPerObjectSize;
    [FieldOffset(0x0019)] public byte bOverride_ScreenPercentage;
    [FieldOffset(0x0019)] public byte bOverride_ScreenSpaceReflectionIntensity;
    [FieldOffset(0x0019)] public byte bOverride_ScreenSpaceReflectionQuality;
    [FieldOffset(0x0019)] public byte bOverride_ScreenSpaceReflectionMaxRoughness;
    [FieldOffset(0x0019)] public byte bOverride_ScreenSpaceReflectionRoughnessScale;
    [FieldOffset(0x001C)] public byte bOverride_ReflectionsType;
    [FieldOffset(0x001C)] public byte bOverride_RayTracingReflectionsMaxRoughness;
    [FieldOffset(0x001C)] public byte bOverride_RayTracingReflectionsMaxBounces;
    [FieldOffset(0x001C)] public byte bOverride_RayTracingReflectionsSamplesPerPixel;
    [FieldOffset(0x001C)] public byte bOverride_RayTracingReflectionsShadows;
    [FieldOffset(0x001C)] public byte bOverride_RayTracingReflectionsTranslucency;
    [FieldOffset(0x001C)] public byte bOverride_TranslucencyType;
    [FieldOffset(0x001C)] public byte bOverride_RayTracingTranslucencyMaxRoughness;
    [FieldOffset(0x001D)] public byte bOverride_RayTracingTranslucencyRefractionRays;
    [FieldOffset(0x001D)] public byte bOverride_RayTracingTranslucencySamplesPerPixel;
    [FieldOffset(0x001D)] public byte bOverride_RayTracingTranslucencyShadows;
    [FieldOffset(0x001D)] public byte bOverride_RayTracingTranslucencyRefraction;
    [FieldOffset(0x001D)] public byte bOverride_RayTracingGI;
    [FieldOffset(0x001D)] public byte bOverride_RayTracingGIMaxBounces;
    [FieldOffset(0x001D)] public byte bOverride_RayTracingGISamplesPerPixel;
    [FieldOffset(0x001D)] public byte bOverride_PathTracingMaxBounces;
    [FieldOffset(0x001E)] public byte bOverride_PathTracingSamplesPerPixel;
    [FieldOffset(0x001E)] public byte bOverride_PathTracingFilterWidth;
    [FieldOffset(0x001E)] public byte bOverride_PathTracingEnableEmissive;
    [FieldOffset(0x001E)] public byte bOverride_PathTracingMaxPathExposure;
    [FieldOffset(0x001E)] public byte bOverride_PathTracingEnableDenoiser;
    [FieldOffset(0x0020)] public byte bMobileHQGaussian;
    [FieldOffset(0x0021)] public EBloomMethod BloomMethod;
    [FieldOffset(0x0022)] public EAutoExposureMethod AutoExposureMethod;
    [FieldOffset(0x0023)] public ETemperatureMethod TemperatureType;
    [FieldOffset(0x0024)] public float WhiteTemp;
    [FieldOffset(0x0028)] public float WhiteTint;
    [FieldOffset(0x0030)] public FVector4 ColorSaturation;
    [FieldOffset(0x0040)] public FVector4 ColorContrast;
    [FieldOffset(0x0050)] public FVector4 ColorGamma;
    [FieldOffset(0x0060)] public FVector4 ColorGain;
    [FieldOffset(0x0070)] public FVector4 ColorOffset;
    [FieldOffset(0x0080)] public FVector4 ColorSaturationShadows;
    [FieldOffset(0x0090)] public FVector4 ColorContrastShadows;
    [FieldOffset(0x00A0)] public FVector4 ColorGammaShadows;
    [FieldOffset(0x00B0)] public FVector4 ColorGainShadows;
    [FieldOffset(0x00C0)] public FVector4 ColorOffsetShadows;
    [FieldOffset(0x00D0)] public FVector4 ColorSaturationMidtones;
    [FieldOffset(0x00E0)] public FVector4 ColorContrastMidtones;
    [FieldOffset(0x00F0)] public FVector4 ColorGammaMidtones;
    [FieldOffset(0x0100)] public FVector4 ColorGainMidtones;
    [FieldOffset(0x0110)] public FVector4 ColorOffsetMidtones;
    [FieldOffset(0x0120)] public FVector4 ColorSaturationHighlights;
    [FieldOffset(0x0130)] public FVector4 ColorContrastHighlights;
    [FieldOffset(0x0140)] public FVector4 ColorGammaHighlights;
    [FieldOffset(0x0150)] public FVector4 ColorGainHighlights;
    [FieldOffset(0x0160)] public FVector4 ColorOffsetHighlights;
    [FieldOffset(0x0170)] public float ColorCorrectionHighlightsMin;
    [FieldOffset(0x0174)] public float ColorCorrectionShadowsMax;
    [FieldOffset(0x0178)] public float BlueCorrection;
    [FieldOffset(0x017C)] public float ExpandGamut;
    [FieldOffset(0x0180)] public float ToneCurveAmount;
    [FieldOffset(0x0184)] public float FilmSlope;
    [FieldOffset(0x0188)] public float FilmToe;
    [FieldOffset(0x018C)] public float FilmShoulder;
    [FieldOffset(0x0190)] public float FilmBlackClip;
    [FieldOffset(0x0194)] public float FilmWhiteClip;
    [FieldOffset(0x0198)] public FLinearColor FilmWhitePoint;
    [FieldOffset(0x01A8)] public FLinearColor FilmShadowTint;
    [FieldOffset(0x01B8)] public float FilmShadowTintBlend;
    [FieldOffset(0x01BC)] public float FilmShadowTintAmount;
    [FieldOffset(0x01C0)] public float FilmSaturation;
    [FieldOffset(0x01C4)] public FLinearColor FilmChannelMixerRed;
    [FieldOffset(0x01D4)] public FLinearColor FilmChannelMixerGreen;
    [FieldOffset(0x01E4)] public FLinearColor FilmChannelMixerBlue;
    [FieldOffset(0x01F4)] public float FilmContrast;
    [FieldOffset(0x01F8)] public float FilmToeAmount;
    [FieldOffset(0x01FC)] public float FilmHealAmount;
    [FieldOffset(0x0200)] public float FilmDynamicRange;
    [FieldOffset(0x0204)] public FLinearColor SceneColorTint;
    [FieldOffset(0x0214)] public float SceneFringeIntensity;
    [FieldOffset(0x0218)] public float ChromaticAberrationStartOffset;
    [FieldOffset(0x021C)] public float BloomIntensity;
    [FieldOffset(0x0220)] public float BloomThreshold;
    [FieldOffset(0x0224)] public float BloomSizeScale;
    [FieldOffset(0x0228)] public float Bloom1Size;
    [FieldOffset(0x022C)] public float Bloom2Size;
    [FieldOffset(0x0230)] public float Bloom3Size;
    [FieldOffset(0x0234)] public float Bloom4Size;
    [FieldOffset(0x0238)] public float Bloom5Size;
    [FieldOffset(0x023C)] public float Bloom6Size;
    [FieldOffset(0x0240)] public FLinearColor Bloom1Tint;
    [FieldOffset(0x0250)] public FLinearColor Bloom2Tint;
    [FieldOffset(0x0260)] public FLinearColor Bloom3Tint;
    [FieldOffset(0x0270)] public FLinearColor Bloom4Tint;
    [FieldOffset(0x0280)] public FLinearColor Bloom5Tint;
    [FieldOffset(0x0290)] public FLinearColor Bloom6Tint;
    [FieldOffset(0x02A0)] public float BloomConvolutionSize;
    [FieldOffset(0x02A8)] public UTexture2D* BloomConvolutionTexture;
    [FieldOffset(0x02B0)] public FVector2D BloomConvolutionCenterUV;
    [FieldOffset(0x02B8)] public float BloomConvolutionPreFilterMin;
    [FieldOffset(0x02BC)] public float BloomConvolutionPreFilterMax;
    [FieldOffset(0x02C0)] public float BloomConvolutionPreFilterMult;
    [FieldOffset(0x02C4)] public float BloomConvolutionBufferScale;
    [FieldOffset(0x02C8)] public UTexture* BloomDirtMask;
    [FieldOffset(0x02D0)] public float BloomDirtMaskIntensity;
    [FieldOffset(0x02D4)] public FLinearColor BloomDirtMaskTint;
    [FieldOffset(0x02E4)] public FLinearColor AmbientCubemapTint;
    [FieldOffset(0x02F4)] public float AmbientCubemapIntensity;
    [FieldOffset(0x02F8)] public UTextureCube* AmbientCubemap;
    [FieldOffset(0x0300)] public float CameraShutterSpeed;
    [FieldOffset(0x0304)] public float CameraISO;
    [FieldOffset(0x0308)] public float DepthOfFieldFstop;
    [FieldOffset(0x030C)] public float DepthOfFieldMinFstop;
    [FieldOffset(0x0310)] public int DepthOfFieldBladeCount;
    [FieldOffset(0x0314)] public float AutoExposureBias;
    [FieldOffset(0x0318)] public float AutoExposureBiasBackup;
    [FieldOffset(0x031C)] public byte bOverride_AutoExposureBiasBackup;
    [FieldOffset(0x0320)] public byte AutoExposureApplyPhysicalCameraExposure;
    [FieldOffset(0x0328)] public UCurveFloat* AutoExposureBiasCurve;
    [FieldOffset(0x0330)] public UTexture* AutoExposureMeterMask;
    [FieldOffset(0x0338)] public float AutoExposureLowPercent;
    [FieldOffset(0x033C)] public float AutoExposureHighPercent;
    [FieldOffset(0x0340)] public float AutoExposureMinBrightness;
    [FieldOffset(0x0344)] public float AutoExposureMaxBrightness;
    [FieldOffset(0x0348)] public float AutoExposureSpeedUp;
    [FieldOffset(0x034C)] public float AutoExposureSpeedDown;
    [FieldOffset(0x0350)] public float HistogramLogMin;
    [FieldOffset(0x0354)] public float HistogramLogMax;
    [FieldOffset(0x0358)] public float AutoExposureCalibrationConstant;
    [FieldOffset(0x035C)] public float LensFlareIntensity;
    [FieldOffset(0x0360)] public FLinearColor LensFlareTint;
    [FieldOffset(0x0370)] public float LensFlareBokehSize;
    [FieldOffset(0x0374)] public float LensFlareThreshold;
    [FieldOffset(0x0378)] public UTexture* LensFlareBokehShape;
    [FieldOffset(0x0380)] public FLinearColor LensFlareTints;
    [FieldOffset(0x0400)] public float VignetteIntensity;
    [FieldOffset(0x0404)] public float GrainJitter;
    [FieldOffset(0x0408)] public float GrainIntensity;
    [FieldOffset(0x040C)] public float AmbientOcclusionIntensity;
    [FieldOffset(0x0410)] public float AmbientOcclusionStaticFraction;
    [FieldOffset(0x0414)] public float AmbientOcclusionRadius;
    [FieldOffset(0x0418)] public byte AmbientOcclusionRadiusInWS;
    [FieldOffset(0x041C)] public float AmbientOcclusionFadeDistance;
    [FieldOffset(0x0420)] public float AmbientOcclusionFadeRadius;
    [FieldOffset(0x0424)] public float AmbientOcclusionDistance;
    [FieldOffset(0x0428)] public float AmbientOcclusionPower;
    [FieldOffset(0x042C)] public float AmbientOcclusionBias;
    [FieldOffset(0x0430)] public float AmbientOcclusionQuality;
    [FieldOffset(0x0434)] public float AmbientOcclusionMipBlend;
    [FieldOffset(0x0438)] public float AmbientOcclusionMipScale;
    [FieldOffset(0x043C)] public float AmbientOcclusionMipThreshold;
    [FieldOffset(0x0440)] public float AmbientOcclusionTemporalBlendWeight;
    [FieldOffset(0x0444)] public byte RayTracingAO;
    [FieldOffset(0x0448)] public int RayTracingAOSamplesPerPixel;
    [FieldOffset(0x044C)] public float RayTracingAOIntensity;
    [FieldOffset(0x0450)] public float RayTracingAORadius;
    [FieldOffset(0x0454)] public FLinearColor IndirectLightingColor;
    [FieldOffset(0x0464)] public float IndirectLightingIntensity;
    [FieldOffset(0x0468)] public ERayTracingGlobalIlluminationType RayTracingGIType;
    [FieldOffset(0x046C)] public int RayTracingGIMaxBounces;
    [FieldOffset(0x0470)] public int RayTracingGISamplesPerPixel;
    [FieldOffset(0x0474)] public float ColorGradingIntensity;
    [FieldOffset(0x0478)] public UTexture* ColorGradingLUT;
    [FieldOffset(0x0480)] public float DepthOfFieldSensorWidth;
    [FieldOffset(0x0484)] public float DepthOfFieldFocalDistance;
    [FieldOffset(0x0488)] public float DepthOfFieldDepthBlurAmount;
    [FieldOffset(0x048C)] public float DepthOfFieldDepthBlurRadius;
    [FieldOffset(0x0490)] public float DepthOfFieldFocalRegion;
    [FieldOffset(0x0494)] public float DepthOfFieldNearTransitionRegion;
    [FieldOffset(0x0498)] public float DepthOfFieldFarTransitionRegion;
    [FieldOffset(0x049C)] public float DepthOfFieldScale;
    [FieldOffset(0x04A0)] public float DepthOfFieldNearBlurSize;
    [FieldOffset(0x04A4)] public float DepthOfFieldFarBlurSize;
    [FieldOffset(0x04A8)] public float DepthOfFieldOcclusion;
    [FieldOffset(0x04AC)] public float DepthOfFieldSkyFocusDistance;
    [FieldOffset(0x04B0)] public float DepthOfFieldVignetteSize;
    [FieldOffset(0x04B4)] public float MotionBlurAmount;
    [FieldOffset(0x04B8)] public float MotionBlurMax;
    [FieldOffset(0x04BC)] public int MotionBlurTargetFPS;
    [FieldOffset(0x04C0)] public float MotionBlurPerObjectSize;
    [FieldOffset(0x04C4)] public float LPVIntensity;
    [FieldOffset(0x04C8)] public float LPVVplInjectionBias;
    [FieldOffset(0x04CC)] public float LPVSize;
    [FieldOffset(0x04D0)] public float LPVSecondaryOcclusionIntensity;
    [FieldOffset(0x04D4)] public float LPVSecondaryBounceIntensity;
    [FieldOffset(0x04D8)] public float LPVGeometryVolumeBias;
    [FieldOffset(0x04DC)] public float LPVEmissiveInjectionIntensity;
    [FieldOffset(0x04E0)] public float LPVDirectionalOcclusionIntensity;
    [FieldOffset(0x04E4)] public float LPVDirectionalOcclusionRadius;
    [FieldOffset(0x04E8)] public float LPVDiffuseOcclusionExponent;
    [FieldOffset(0x04EC)] public float LPVSpecularOcclusionExponent;
    [FieldOffset(0x04F0)] public float LPVDiffuseOcclusionIntensity;
    [FieldOffset(0x04F4)] public float LPVSpecularOcclusionIntensity;
    [FieldOffset(0x04F8)] public EReflectionsType ReflectionsType;
    [FieldOffset(0x04FC)] public float ScreenSpaceReflectionIntensity;
    [FieldOffset(0x0500)] public float ScreenSpaceReflectionQuality;
    [FieldOffset(0x0504)] public float ScreenSpaceReflectionMaxRoughness;
    [FieldOffset(0x0508)] public float RayTracingReflectionsMaxRoughness;
    [FieldOffset(0x050C)] public int RayTracingReflectionsMaxBounces;
    [FieldOffset(0x0510)] public int RayTracingReflectionsSamplesPerPixel;
    [FieldOffset(0x0514)] public EReflectedAndRefractedRayTracedShadows RayTracingReflectionsShadows;
    [FieldOffset(0x0515)] public byte RayTracingReflectionsTranslucency;
    [FieldOffset(0x0516)] public ETranslucencyType TranslucencyType;
    [FieldOffset(0x0518)] public float RayTracingTranslucencyMaxRoughness;
    [FieldOffset(0x051C)] public int RayTracingTranslucencyRefractionRays;
    [FieldOffset(0x0520)] public int RayTracingTranslucencySamplesPerPixel;
    [FieldOffset(0x0524)] public EReflectedAndRefractedRayTracedShadows RayTracingTranslucencyShadows;
    [FieldOffset(0x0525)] public byte RayTracingTranslucencyRefraction;
    [FieldOffset(0x0528)] public int PathTracingMaxBounces;
    [FieldOffset(0x052C)] public int PathTracingSamplesPerPixel;
    [FieldOffset(0x0530)] public float PathTracingFilterWidth;
    [FieldOffset(0x0534)] public byte PathTracingEnableEmissive;
    [FieldOffset(0x0538)] public float PathTracingMaxPathExposure;
    [FieldOffset(0x053C)] public byte PathTracingEnableDenoiser;
    [FieldOffset(0x0540)] public float LPVFadeRange;
    [FieldOffset(0x0544)] public float LPVDirectionalOcclusionFadeRange;
    [FieldOffset(0x0548)] public float ScreenPercentage;
    [FieldOffset(0x0550)] public FWeightedBlendables WeightedBlendables;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UCameraShakePattern
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FDirectoryPath
{
    [FieldOffset(0x0000)] public FString Path;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct FKeyHandleLookupTable
{
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UPlayer
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public APlayerController* PlayerController;
    [FieldOffset(0x0038)] public int CurrentNetSpeed;
    [FieldOffset(0x003C)] public int ConfiguredInternetSpeed;
    [FieldOffset(0x0040)] public int ConfiguredLanSpeed;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FUniqueNetIdRepl
{
    [FieldOffset(0x0000)] public FUniqueNetIdWrapper baseObj;
    [FieldOffset(0x0018)] public TArray<byte> ReplicationBytes;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1BA8)] 
public unsafe struct UNetConnection
{
    [FieldOffset(0x0000)] public UPlayer baseObj;
    [FieldOffset(0x0048)] public TArray<IntPtr> Children;
    [FieldOffset(0x0058)] public UNetDriver* Driver;
    [FieldOffset(0x0060)] public TSubclassOf<UPackageMap> PackageMapClass;
    [FieldOffset(0x0068)] public UPackageMap* PackageMap;
    [FieldOffset(0x0070)] public TArray<IntPtr> OpenChannels;
    [FieldOffset(0x0080)] public TArray<IntPtr> SentTemporaries;
    [FieldOffset(0x0090)] public AActor* ViewTarget;
    [FieldOffset(0x0098)] public AActor* OwningActor;
    [FieldOffset(0x00A0)] public int MaxPacket;
    [FieldOffset(0x00A4)] public byte InternalAck;
    [FieldOffset(0x0160)] public FUniqueNetIdRepl PlayerId;
    [FieldOffset(0x01D0)] public double LastReceiveTime;
    [FieldOffset(0x1510)] public TArray<IntPtr> ChannelsToTick;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FChannelDefinition
{
    [FieldOffset(0x0000)] public FName ChannelName;
    [FieldOffset(0x0008)] public FName ClassName;
    [FieldOffset(0x0010)] public UClass* ChannelClass;
    [FieldOffset(0x0018)] public int StaticChannelIndex;
    [FieldOffset(0x001C)] public bool bTickOnCreate;
    [FieldOffset(0x001D)] public bool bServerOpen;
    [FieldOffset(0x001E)] public bool bClientOpen;
    [FieldOffset(0x001F)] public bool bInitialServer;
    [FieldOffset(0x0020)] public bool bInitialClient;
}

[StructLayout(LayoutKind.Explicit, Size = 0x760)] 
public unsafe struct UNetDriver
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public FString NetConnectionClassName;
    [FieldOffset(0x0040)] public FString ReplicationDriverClassName;
    [FieldOffset(0x0050)] public int MaxDownloadSize;
    [FieldOffset(0x0054)] public byte bClampListenServerTickRate;
    [FieldOffset(0x0058)] public int NetServerMaxTickRate;
    [FieldOffset(0x005C)] public int MaxNetTickRate;
    [FieldOffset(0x0060)] public int MaxInternetClientRate;
    [FieldOffset(0x0064)] public int MaxClientRate;
    [FieldOffset(0x0068)] public float ServerTravelPause;
    [FieldOffset(0x006C)] public float SpawnPrioritySeconds;
    [FieldOffset(0x0070)] public float RelevantTimeout;
    [FieldOffset(0x0074)] public float KeepAliveTime;
    [FieldOffset(0x0078)] public float InitialConnectTimeout;
    [FieldOffset(0x007C)] public float ConnectionTimeout;
    [FieldOffset(0x0080)] public float TimeoutMultiplierForUnoptimizedBuilds;
    [FieldOffset(0x0084)] public bool bNoTimeouts;
    [FieldOffset(0x0085)] public bool bNeverApplyNetworkEmulationSettings;
    [FieldOffset(0x0088)] public UNetConnection* ServerConnection;
    [FieldOffset(0x0090)] public TArray<IntPtr> ClientConnections;
    [FieldOffset(0x0100)] public int RecentlyDisconnectedTrackingTime;
    [FieldOffset(0x0140)] public UWorld* World;
    [FieldOffset(0x0148)] public UPackage* WorldPackage;
    [FieldOffset(0x0170)] public UClass* NetConnectionClass;
    [FieldOffset(0x0178)] public UClass* ReplicationDriverClass;
    [FieldOffset(0x0190)] public FName NetDriverName;
    [FieldOffset(0x0198)] public TArray<FChannelDefinition> ChannelDefinitions;
    [FieldOffset(0x01A8)] public TMap<FName, FChannelDefinition> ChannelDefinitionMap;
    [FieldOffset(0x01F8)] public TArray<IntPtr> ActorChannelPool;
    [FieldOffset(0x0210)] public float Time;
    [FieldOffset(0x0700)] public UReplicationDriver* ReplicationDriver;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UBlueprintAsyncActionBase
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UOnlineBlueprintCallProxyBase
{
    [FieldOffset(0x0000)] public UBlueprintAsyncActionBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UOnlineEngineInterface
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UOnlineSession
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct FRuntimeFloatCurve
{
    [FieldOffset(0x0000)] public FRichCurve EditorCurveData;
    [FieldOffset(0x0080)] public UCurveFloat* ExternalCurve;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB0)] 
public unsafe struct FBaseAttenuationSettings
{
    [FieldOffset(0x0008)] public EAttenuationDistanceModel DistanceAlgorithm;
    [FieldOffset(0x0009)] public EAttenuationShape AttenuationShape;
    [FieldOffset(0x000C)] public float dBAttenuationAtMax;
    [FieldOffset(0x0010)] public ENaturalSoundFalloffMode FalloffMode;
    [FieldOffset(0x0014)] public FVector AttenuationShapeExtents;
    [FieldOffset(0x0020)] public float ConeOffset;
    [FieldOffset(0x0024)] public float FalloffDistance;
    [FieldOffset(0x0028)] public FRuntimeFloatCurve CustomAttenuationCurve;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA8)] 
public unsafe struct FAttenuationSubmixSendSettings
{
    [FieldOffset(0x0000)] public USoundSubmixBase* Submix;
    [FieldOffset(0x0008)] public ESubmixSendMethod SubmixSendMethod;
    [FieldOffset(0x000C)] public float SubmixSendLevelMin;
    [FieldOffset(0x0010)] public float SubmixSendLevelMax;
    [FieldOffset(0x0014)] public float SubmixSendDistanceMin;
    [FieldOffset(0x0018)] public float SubmixSendDistanceMax;
    [FieldOffset(0x001C)] public float ManualSubmixSendLevel;
    [FieldOffset(0x0020)] public FRuntimeFloatCurve CustomSubmixSendCurve;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FSoundAttenuationPluginSettings
{
    [FieldOffset(0x0000)] public TArray<IntPtr> SpatializationPluginSettingsArray;
    [FieldOffset(0x0010)] public TArray<IntPtr> OcclusionPluginSettingsArray;
    [FieldOffset(0x0020)] public TArray<IntPtr> ReverbPluginSettingsArray;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3A0)] 
public unsafe struct FSoundAttenuationSettings
{
    [FieldOffset(0x0000)] public FBaseAttenuationSettings baseObj;
    [FieldOffset(0x00B0)] public byte bAttenuate;
    [FieldOffset(0x00B0)] public byte bSpatialize;
    [FieldOffset(0x00B0)] public byte bAttenuateWithLPF;
    [FieldOffset(0x00B0)] public byte bEnableListenerFocus;
    [FieldOffset(0x00B0)] public byte bEnableFocusInterpolation;
    [FieldOffset(0x00B0)] public byte bEnableOcclusion;
    [FieldOffset(0x00B0)] public byte bUseComplexCollisionForOcclusion;
    [FieldOffset(0x00B0)] public byte bEnableReverbSend;
    [FieldOffset(0x00B1)] public byte bEnablePriorityAttenuation;
    [FieldOffset(0x00B1)] public byte bApplyNormalizationToStereoSounds;
    [FieldOffset(0x00B1)] public byte bEnableLogFrequencyScaling;
    [FieldOffset(0x00B1)] public byte bEnableSubmixSends;
    [FieldOffset(0x00B2)] public ESoundSpatializationAlgorithm SpatializationAlgorithm;
    [FieldOffset(0x00B4)] public float BinauralRadius;
    [FieldOffset(0x00B8)] public EAirAbsorptionMethod AbsorptionMethod;
    [FieldOffset(0x00B9)] public ECollisionChannel OcclusionTraceChannel;
    [FieldOffset(0x00BA)] public EReverbSendMethod ReverbSendMethod;
    [FieldOffset(0x00BB)] public EPriorityAttenuationMethod PriorityAttenuationMethod;
    [FieldOffset(0x00BC)] public float OmniRadius;
    [FieldOffset(0x00C0)] public float StereoSpread;
    [FieldOffset(0x00C4)] public float LPFRadiusMin;
    [FieldOffset(0x00C8)] public float LPFRadiusMax;
    [FieldOffset(0x00D0)] public FRuntimeFloatCurve CustomLowpassAirAbsorptionCurve;
    [FieldOffset(0x0158)] public FRuntimeFloatCurve CustomHighpassAirAbsorptionCurve;
    [FieldOffset(0x01E0)] public float LPFFrequencyAtMin;
    [FieldOffset(0x01E4)] public float LPFFrequencyAtMax;
    [FieldOffset(0x01E8)] public float HPFFrequencyAtMin;
    [FieldOffset(0x01EC)] public float HPFFrequencyAtMax;
    [FieldOffset(0x01F0)] public float FocusAzimuth;
    [FieldOffset(0x01F4)] public float NonFocusAzimuth;
    [FieldOffset(0x01F8)] public float FocusDistanceScale;
    [FieldOffset(0x01FC)] public float NonFocusDistanceScale;
    [FieldOffset(0x0200)] public float FocusPriorityScale;
    [FieldOffset(0x0204)] public float NonFocusPriorityScale;
    [FieldOffset(0x0208)] public float FocusVolumeAttenuation;
    [FieldOffset(0x020C)] public float NonFocusVolumeAttenuation;
    [FieldOffset(0x0210)] public float FocusAttackInterpSpeed;
    [FieldOffset(0x0214)] public float FocusReleaseInterpSpeed;
    [FieldOffset(0x0218)] public float OcclusionLowPassFilterFrequency;
    [FieldOffset(0x021C)] public float OcclusionVolumeAttenuation;
    [FieldOffset(0x0220)] public float OcclusionInterpolationTime;
    [FieldOffset(0x0224)] public float ReverbWetLevelMin;
    [FieldOffset(0x0228)] public float ReverbWetLevelMax;
    [FieldOffset(0x022C)] public float ReverbDistanceMin;
    [FieldOffset(0x0230)] public float ReverbDistanceMax;
    [FieldOffset(0x0234)] public float ManualReverbSendLevel;
    [FieldOffset(0x0238)] public FRuntimeFloatCurve CustomReverbSendCurve;
    [FieldOffset(0x02C0)] public TArray<FAttenuationSubmixSendSettings> SubmixSendSettings;
    [FieldOffset(0x02D0)] public float PriorityAttenuationMin;
    [FieldOffset(0x02D4)] public float PriorityAttenuationMax;
    [FieldOffset(0x02D8)] public float PriorityAttenuationDistanceMin;
    [FieldOffset(0x02DC)] public float PriorityAttenuationDistanceMax;
    [FieldOffset(0x02E0)] public float ManualPriorityAttenuation;
    [FieldOffset(0x02E8)] public FRuntimeFloatCurve CustomPriorityAttenuationCurve;
    [FieldOffset(0x0370)] public FSoundAttenuationPluginSettings PluginSettings;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB0)] 
public unsafe struct FSoundSubmixSendInfo
{
    [FieldOffset(0x0000)] public ESendLevelControlMethod SendLevelControlMethod;
    [FieldOffset(0x0001)] public ESubmixSendStage SendStage;
    [FieldOffset(0x0008)] public USoundSubmixBase* SoundSubmix;
    [FieldOffset(0x0010)] public float SendLevel;
    [FieldOffset(0x0014)] public float MinSendLevel;
    [FieldOffset(0x0018)] public float MaxSendLevel;
    [FieldOffset(0x001C)] public float MinSendDistance;
    [FieldOffset(0x0020)] public float MaxSendDistance;
    [FieldOffset(0x0028)] public FRuntimeFloatCurve CustomSendLevelCurve;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB8)] 
public unsafe struct FSoundSourceBusSendInfo
{
    [FieldOffset(0x0000)] public ESourceBusSendLevelControlMethod SourceBusSendLevelControlMethod;
    [FieldOffset(0x0008)] public USoundSourceBus* SoundSourceBus;
    [FieldOffset(0x0010)] public UAudioBus* AudioBus;
    [FieldOffset(0x0018)] public float SendLevel;
    [FieldOffset(0x001C)] public float MinSendLevel;
    [FieldOffset(0x0020)] public float MaxSendLevel;
    [FieldOffset(0x0024)] public float MinSendDistance;
    [FieldOffset(0x0028)] public float MaxSendDistance;
    [FieldOffset(0x0030)] public FRuntimeFloatCurve CustomSendLevelCurve;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1A8)] 
public unsafe struct UGameInstance
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0038)] public TArray<IntPtr> LocalPlayers;
    [FieldOffset(0x0048)] public UOnlineSession* OnlineSession;
    [FieldOffset(0x0050)] public TArray<IntPtr> ReferencedObjects;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct USubsystem
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UGameInstanceSubsystem
{
    [FieldOffset(0x0000)] public USubsystem baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x480)] 
public unsafe struct UMeshComponent
{
    [FieldOffset(0x0000)] public UPrimitiveComponent baseObj;
    [FieldOffset(0x0450)] public TArray<IntPtr> OverrideMaterials;
    [FieldOffset(0x0470)] public byte bEnableMaterialParameterCaching;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FVertexOffsetUsage
{
    [FieldOffset(0x0000)] public int Usage;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct FSkelMeshComponentLODInfo
{
    [FieldOffset(0x0000)] public TArray<bool> HiddenMaterials;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3C)] 
public unsafe struct FSkelMeshSkinWeightInfo
{
    [FieldOffset(0x0000)] public int Bones;
    [FieldOffset(0x0030)] public byte Weights;
}

[StructLayout(LayoutKind.Explicit, Size = 0x6A0)] 
public unsafe struct USkinnedMeshComponent
{
    [FieldOffset(0x0000)] public UMeshComponent baseObj;
    [FieldOffset(0x0480)] public USkeletalMesh* SkeletalMesh;
    [FieldOffset(0x0488)] public TWeakObjectPtr<USkinnedMeshComponent> MasterPoseComponent;
    [FieldOffset(0x0490)] public TArray<ESkinCacheUsage> SkinCacheUsage;
    [FieldOffset(0x04A0)] public TArray<FVertexOffsetUsage> VertexOffsetUsage;
    [FieldOffset(0x05A8)] public UPhysicsAsset* PhysicsAssetOverride;
    [FieldOffset(0x05B0)] public int ForcedLodModel;
    [FieldOffset(0x05B4)] public int MinLodModel;
    [FieldOffset(0x05C0)] public float StreamingDistanceMultiplier;
    [FieldOffset(0x05D0)] public TArray<FSkelMeshComponentLODInfo> LODInfo;
    [FieldOffset(0x0604)] public EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption;
    [FieldOffset(0x0606)] public byte bOverrideMinLOD;
    [FieldOffset(0x0606)] public byte bUseBoundsFromMasterPoseComponent;
    [FieldOffset(0x0606)] public byte bForceWireframe;
    [FieldOffset(0x0606)] public byte bDisplayBones;
    [FieldOffset(0x0606)] public byte bDisableMorphTarget;
    [FieldOffset(0x0607)] public byte bHideSkin;
    [FieldOffset(0x0607)] public byte bPerBoneMotionBlur;
    [FieldOffset(0x0607)] public byte bComponentUseFixedSkelBounds;
    [FieldOffset(0x0607)] public byte bConsiderAllBodiesForBounds;
    [FieldOffset(0x0607)] public byte bSyncAttachParentLOD;
    [FieldOffset(0x0607)] public byte bCanHighlightSelectedSections;
    [FieldOffset(0x0607)] public byte bRecentlyRendered;
    [FieldOffset(0x0607)] public byte bCastCapsuleDirectShadow;
    [FieldOffset(0x0608)] public byte bCastCapsuleIndirectShadow;
    [FieldOffset(0x0608)] public byte bCPUSkinning;
    [FieldOffset(0x0608)] public byte bEnableUpdateRateOptimizations;
    [FieldOffset(0x0608)] public byte bDisplayDebugUpdateRateOptimizations;
    [FieldOffset(0x0608)] public byte bRenderStatic;
    [FieldOffset(0x0608)] public byte bIgnoreMasterPoseComponentLOD;
    [FieldOffset(0x0609)] public byte bCachedLocalBoundsUpToDate;
    [FieldOffset(0x0609)] public byte bForceMeshObjectUpdate;
    [FieldOffset(0x060C)] public float CapsuleIndirectShadowMinVisibility;
    [FieldOffset(0x0620)] public FBoxSphereBounds CachedWorldSpaceBounds;
    [FieldOffset(0x0640)] public FMatrix CachedWorldToLocalTransform;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FSingleAnimationPlayData
{
    [FieldOffset(0x0000)] public UAnimationAsset* AnimToPlay;
    [FieldOffset(0x0008)] public byte bSavedLooping;
    [FieldOffset(0x0008)] public byte bSavedPlaying;
    [FieldOffset(0x000C)] public float SavedPosition;
    [FieldOffset(0x0010)] public float SavedPlayRate;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct FPoseSnapshot
{
    [FieldOffset(0x0000)] public TArray<FTransform> LocalTransforms;
    [FieldOffset(0x0010)] public TArray<FName> BoneNames;
    [FieldOffset(0x0020)] public FName SkeletalMeshName;
    [FieldOffset(0x0028)] public FName SnapshotName;
    [FieldOffset(0x0030)] public bool bIsValid;
}

[StructLayout(LayoutKind.Explicit, Size = 0xED0)] 
public unsafe struct USkeletalMeshComponent
{
    [FieldOffset(0x0000)] public USkinnedMeshComponent baseObj;
    [FieldOffset(0x06A0)] public UClass* AnimBlueprintGeneratedClass;
    [FieldOffset(0x06A8)] public TSubclassOf<UAnimInstance> AnimClass;
    [FieldOffset(0x06B0)] public UAnimInstance* AnimScriptInstance;
    [FieldOffset(0x06B8)] public UAnimInstance* PostProcessAnimInstance;
    [FieldOffset(0x06C0)] public FSingleAnimationPlayData AnimationData;
    [FieldOffset(0x06E8)] public FVector RootBoneTranslation;
    [FieldOffset(0x06F4)] public FVector LineCheckBoundsScale;
    [FieldOffset(0x0730)] public TArray<IntPtr> LinkedInstances;
    [FieldOffset(0x0740)] public TArray<FTransform> CachedBoneSpaceTransforms;
    [FieldOffset(0x0750)] public TArray<FTransform> CachedComponentSpaceTransforms;
    [FieldOffset(0x08B0)] public float GlobalAnimRateScale;
    [FieldOffset(0x08B4)] public EKinematicBonesUpdateToPhysics KinematicBonesUpdateType;
    [FieldOffset(0x08B5)] public EPhysicsTransformUpdateMode PhysicsTransformUpdateMode;
    [FieldOffset(0x08B7)] public EAnimationMode AnimationMode;
    [FieldOffset(0x08B9)] public byte bDisablePostProcessBlueprint;
    [FieldOffset(0x08B9)] public byte bUpdateOverlapsOnAnimationFinalize;
    [FieldOffset(0x08B9)] public byte bHasValidBodies;
    [FieldOffset(0x08B9)] public byte bBlendPhysics;
    [FieldOffset(0x08B9)] public byte bEnablePhysicsOnDedicatedServer;
    [FieldOffset(0x08B9)] public byte bUpdateJointsFromAnimation;
    [FieldOffset(0x08BA)] public byte bDisableClothSimulation;
    [FieldOffset(0x08C0)] public byte bDisableRigidBodyAnimNode;
    [FieldOffset(0x08C0)] public byte bAllowAnimCurveEvaluation;
    [FieldOffset(0x08C0)] public byte bDisableAnimCurves;
    [FieldOffset(0x08C0)] public byte bCollideWithEnvironment;
    [FieldOffset(0x08C1)] public byte bCollideWithAttachedChildren;
    [FieldOffset(0x08C1)] public byte bLocalSpaceSimulation;
    [FieldOffset(0x08C1)] public byte bResetAfterTeleport;
    [FieldOffset(0x08C1)] public byte bDeferKinematicBoneUpdate;
    [FieldOffset(0x08C1)] public byte bNoSkeletonUpdate;
    [FieldOffset(0x08C1)] public byte bPauseAnims;
    [FieldOffset(0x08C1)] public byte bUseRefPoseOnInitAnim;
    [FieldOffset(0x08C2)] public byte bEnablePerPolyCollision;
    [FieldOffset(0x08C2)] public byte bForceRefpose;
    [FieldOffset(0x08C2)] public byte bOnlyAllowAutonomousTickPose;
    [FieldOffset(0x08C2)] public byte bIsAutonomousTickPose;
    [FieldOffset(0x08C2)] public byte bOldForceRefPose;
    [FieldOffset(0x08C2)] public byte bShowPrePhysBones;
    [FieldOffset(0x08C2)] public byte bRequiredBonesUpToDate;
    [FieldOffset(0x08C2)] public byte bAnimTreeInitialised;
    [FieldOffset(0x08C3)] public byte bIncludeComponentLocationIntoBounds;
    [FieldOffset(0x08C3)] public byte bEnableLineCheckWithBounds;
    [FieldOffset(0x08C3)] public byte bPropagateCurvesToSlaves;
    [FieldOffset(0x08C3)] public byte bSkipKinematicUpdateWhenInterpolating;
    [FieldOffset(0x08C3)] public byte bSkipBoundsUpdateWhenInterpolating;
    [FieldOffset(0x08C3)] public byte bNeedsQueuedAnimEventsDispatched;
    [FieldOffset(0x08C6)] public ushort CachedAnimCurveUidVersion;
    [FieldOffset(0x08C8)] public float ClothBlendWeight;
    [FieldOffset(0x08CC)] public bool bWaitForParallelClothTask;
    [FieldOffset(0x08D0)] public TArray<FName> DisallowedAnimCurves;
    [FieldOffset(0x08E0)] public UBodySetup* BodySetup;
    [FieldOffset(0x0900)] public TSubclassOf<UClothingSimulationFactory> ClothingSimulationFactory;
    [FieldOffset(0x09D8)] public float TeleportDistanceThreshold;
    [FieldOffset(0x09DC)] public float TeleportRotationThreshold;
    [FieldOffset(0x09E8)] public uint LastPoseTickFrame;
    [FieldOffset(0x0A40)] public UClothingSimulationInteractor* ClothingInteractor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FAnimNotifyEventReference
{
    [FieldOffset(0x0008)] public UObject* NotifySource;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FAnimNotifyArray
{
    [FieldOffset(0x0000)] public TArray<FAnimNotifyEventReference> Notifies;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct FAnimNotifyQueue
{
    [FieldOffset(0x0010)] public TArray<FAnimNotifyEventReference> AnimNotifies;
    [FieldOffset(0x0020)] public TMap<FName, FAnimNotifyArray> UnfilteredMontageAnimNotifies;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FAnimLinkableElement
{
    [FieldOffset(0x0008)] public UAnimMontage* LinkedMontage;
    [FieldOffset(0x0010)] public int SlotIndex;
    [FieldOffset(0x0014)] public int SegmentIndex;
    [FieldOffset(0x0018)] public EAnimLinkMethod LinkMethod;
    [FieldOffset(0x0019)] public EAnimLinkMethod CachedLinkMethod;
    [FieldOffset(0x001C)] public float SegmentBeginTime;
    [FieldOffset(0x0020)] public float SegmentLength;
    [FieldOffset(0x0024)] public float LinkValue;
    [FieldOffset(0x0028)] public UAnimSequenceBase* LinkedSequence;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB8)] 
public unsafe struct FAnimNotifyEvent
{
    [FieldOffset(0x0000)] public FAnimLinkableElement baseObj;
    [FieldOffset(0x0030)] public float DisplayTime;
    [FieldOffset(0x0034)] public float TriggerTimeOffset;
    [FieldOffset(0x0038)] public float EndTriggerTimeOffset;
    [FieldOffset(0x003C)] public float TriggerWeightThreshold;
    [FieldOffset(0x0040)] public FName NotifyName;
    [FieldOffset(0x0048)] public UAnimNotify* Notify;
    [FieldOffset(0x0050)] public UAnimNotifyState* NotifyStateClass;
    [FieldOffset(0x0058)] public float Duration;
    [FieldOffset(0x0060)] public FAnimLinkableElement EndLink;
    [FieldOffset(0x0090)] public bool bConvertedFromBranchingPoint;
    [FieldOffset(0x0091)] public EMontageNotifyTickType MontageTickType;
    [FieldOffset(0x0094)] public float NotifyTriggerChance;
    [FieldOffset(0x0098)] public ENotifyFilterType NotifyFilterType;
    [FieldOffset(0x009C)] public int NotifyFilterLOD;
    [FieldOffset(0x00A0)] public bool bTriggerOnDedicatedServer;
    [FieldOffset(0x00A1)] public bool bTriggerOnFollower;
    [FieldOffset(0x00A4)] public int TrackIndex;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FMarkerSyncAnimPosition
{
    [FieldOffset(0x0000)] public FName PreviousMarkerName;
    [FieldOffset(0x0008)] public FName NextMarkerName;
    [FieldOffset(0x0010)] public float PositionBetweenMarkers;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C0)] 
public unsafe struct UAnimInstance
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public USkeleton* CurrentSkeleton;
    [FieldOffset(0x0030)] public ERootMotionMode RootMotionMode;
    [FieldOffset(0x0031)] public byte bUseMultiThreadedAnimationUpdate;
    [FieldOffset(0x0031)] public byte bUsingCopyPoseFromMesh;
    [FieldOffset(0x0031)] public byte bReceiveNotifiesFromLinkedInstances;
    [FieldOffset(0x0031)] public byte bPropagateNotifiesToLinkedInstances;
    [FieldOffset(0x0031)] public byte bQueueMontageEvents;
    [FieldOffset(0x0100)] public FAnimNotifyQueue NotifyQueue;
    [FieldOffset(0x0170)] public TArray<FAnimNotifyEvent> ActiveAnimNotifyState;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UDataAsset
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TSubclassOf<UDataAsset> NativeClass;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct APawn
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0228)] public byte bUseControllerRotationPitch;
    [FieldOffset(0x0228)] public byte bUseControllerRotationYaw;
    [FieldOffset(0x0228)] public byte bUseControllerRotationRoll;
    [FieldOffset(0x0228)] public byte bCanAffectNavigationGeneration;
    [FieldOffset(0x022C)] public float BaseEyeHeight;
    [FieldOffset(0x0230)] public EAutoReceiveInput AutoPossessPlayer;
    [FieldOffset(0x0231)] public EAutoPossessAI AutoPossessAI;
    [FieldOffset(0x0232)] public byte RemoteViewPitch;
    [FieldOffset(0x0238)] public TSubclassOf<AController> AIControllerClass;
    [FieldOffset(0x0240)] public APlayerState* PlayerState;
    [FieldOffset(0x0250)] public AController* LastHitBy;
    [FieldOffset(0x0258)] public AController* Controller;
    [FieldOffset(0x0264)] public FVector ControlInputVector;
    [FieldOffset(0x0270)] public FVector LastControlInputVector;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FBasedMovementInfo
{
    [FieldOffset(0x0000)] public UPrimitiveComponent* MovementBase;
    [FieldOffset(0x0008)] public FName BoneName;
    [FieldOffset(0x0010)] public FVector_NetQuantize100 Location;
    [FieldOffset(0x001C)] public FRotator Rotation;
    [FieldOffset(0x0028)] public bool bServerHasBaseComponent;
    [FieldOffset(0x0029)] public bool bRelativeRotation;
    [FieldOffset(0x002A)] public bool bServerHasVelocity;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1)] 
public unsafe struct FRootMotionSourceSettings
{
    [FieldOffset(0x0000)] public byte flags;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FVector_NetQuantize10
{
    [FieldOffset(0x0000)] public FVector baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct FRootMotionSourceGroup
{
    [FieldOffset(0x0028)] public byte bHasAdditiveSources;
    [FieldOffset(0x0028)] public byte bHasOverrideSources;
    [FieldOffset(0x0028)] public byte bHasOverrideSourcesWithIgnoreZAccumulate;
    [FieldOffset(0x0028)] public byte bIsAdditiveVelocityApplied;
    [FieldOffset(0x0029)] public FRootMotionSourceSettings LastAccumulatedSettings;
    [FieldOffset(0x002C)] public FVector_NetQuantize10 LastPreAdditiveVelocity;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct FRootMotionMovementParams
{
    [FieldOffset(0x0000)] public bool bHasRootMotion;
    [FieldOffset(0x0004)] public float BlendWeight;
    [FieldOffset(0x0010)] public FTransform RootMotionTransform;
}

[StructLayout(LayoutKind.Explicit, Size = 0x98)] 
public unsafe struct FRepRootMotionMontage
{
    [FieldOffset(0x0000)] public bool bIsActive;
    [FieldOffset(0x0008)] public UAnimMontage* AnimMontage;
    [FieldOffset(0x0010)] public float Position;
    [FieldOffset(0x0014)] public FVector_NetQuantize100 Location;
    [FieldOffset(0x0020)] public FRotator Rotation;
    [FieldOffset(0x0030)] public UPrimitiveComponent* MovementBase;
    [FieldOffset(0x0038)] public FName MovementBaseBoneName;
    [FieldOffset(0x0040)] public bool bRelativePosition;
    [FieldOffset(0x0041)] public bool bRelativeRotation;
    [FieldOffset(0x0048)] public FRootMotionSourceGroup AuthoritativeRootMotion;
    [FieldOffset(0x0080)] public FVector_NetQuantize10 Acceleration;
    [FieldOffset(0x008C)] public FVector_NetQuantize10 LinearVelocity;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA0)] 
public unsafe struct FSimulatedRootMotionReplicatedMove
{
    [FieldOffset(0x0000)] public float Time;
    [FieldOffset(0x0008)] public FRepRootMotionMontage RootMotion;
}

[StructLayout(LayoutKind.Explicit, Size = 0x98)] 
public unsafe struct FCharacterNetworkSerializationPackedBits
{
}

[StructLayout(LayoutKind.Explicit, Size = 0x98)] 
public unsafe struct FCharacterServerMovePackedBits
{
    [FieldOffset(0x0000)] public FCharacterNetworkSerializationPackedBits baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x98)] 
public unsafe struct FCharacterMoveResponsePackedBits
{
    [FieldOffset(0x0000)] public FCharacterNetworkSerializationPackedBits baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4C0)] 
public unsafe struct ACharacter
{
    [FieldOffset(0x0000)] public APawn baseObj;
    [FieldOffset(0x0280)] public USkeletalMeshComponent* Mesh;
    [FieldOffset(0x0288)] public UCharacterMovementComponent* CharacterMovement;
    [FieldOffset(0x0290)] public UCapsuleComponent* CapsuleComponent;
    [FieldOffset(0x0298)] public FBasedMovementInfo BasedMovement;
    [FieldOffset(0x02C8)] public FBasedMovementInfo ReplicatedBasedMovement;
    [FieldOffset(0x02F8)] public float AnimRootMotionTranslationScale;
    [FieldOffset(0x02FC)] public FVector BaseTranslationOffset;
    [FieldOffset(0x0310)] public FQuat BaseRotationOffset;
    [FieldOffset(0x0320)] public float ReplicatedServerLastTransformUpdateTimeStamp;
    [FieldOffset(0x0324)] public float ReplayLastTransformUpdateTimeStamp;
    [FieldOffset(0x0328)] public byte ReplicatedMovementMode;
    [FieldOffset(0x0329)] public bool bInBaseReplication;
    [FieldOffset(0x032C)] public float CrouchedEyeHeight;
    [FieldOffset(0x0330)] public byte bIsCrouched;
    [FieldOffset(0x0330)] public byte bProxyIsJumpForceApplied;
    [FieldOffset(0x0330)] public byte bPressedJump;
    [FieldOffset(0x0330)] public byte bClientUpdating;
    [FieldOffset(0x0330)] public byte bClientWasFalling;
    [FieldOffset(0x0330)] public byte bClientResimulateRootMotion;
    [FieldOffset(0x0330)] public byte bClientResimulateRootMotionSources;
    [FieldOffset(0x0330)] public byte bSimGravityDisabled;
    [FieldOffset(0x0331)] public byte bClientCheckEncroachmentOnNetUpdate;
    [FieldOffset(0x0331)] public byte bServerMoveIgnoreRootMotion;
    [FieldOffset(0x0331)] public byte bWasJumping;
    [FieldOffset(0x0334)] public float JumpKeyHoldTime;
    [FieldOffset(0x0338)] public float JumpForceTimeRemaining;
    [FieldOffset(0x033C)] public float ProxyJumpForceStartedTime;
    [FieldOffset(0x0340)] public float JumpMaxHoldTime;
    [FieldOffset(0x0344)] public int JumpMaxCount;
    [FieldOffset(0x0348)] public int JumpCurrentCount;
    [FieldOffset(0x034C)] public int JumpCurrentCountPreJump;
    [FieldOffset(0x0398)] public FRootMotionSourceGroup SavedRootMotion;
    [FieldOffset(0x03D0)] public FRootMotionMovementParams ClientRootMotionParams;
    [FieldOffset(0x0410)] public TArray<FSimulatedRootMotionReplicatedMove> RootMotionRepMoves;
    [FieldOffset(0x0420)] public FRepRootMotionMontage RepRootMotion;
}

[StructLayout(LayoutKind.Explicit, Size = 0x298)] 
public unsafe struct AController
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0228)] public APlayerState* PlayerState;
    [FieldOffset(0x0248)] public FName StateName;
    [FieldOffset(0x0250)] public APawn* Pawn;
    [FieldOffset(0x0260)] public ACharacter* Character;
    [FieldOffset(0x0268)] public USceneComponent* TransformComponent;
    [FieldOffset(0x0288)] public FRotator ControlRotation;
    [FieldOffset(0x0294)] public byte bAttachToPawn;
}

[StructLayout(LayoutKind.Explicit, Size = 0x220)] 
public unsafe struct ATargetPoint
{
    [FieldOffset(0x0000)] public AActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FActiveForceFeedbackEffect
{
    [FieldOffset(0x0000)] public UForceFeedbackEffect* ForceFeedbackEffect;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FViewTargetTransitionParams
{
    [FieldOffset(0x0000)] public float BlendTime;
    [FieldOffset(0x0004)] public EViewTargetBlendFunction BlendFunction;
    [FieldOffset(0x0008)] public float BlendExp;
    [FieldOffset(0x000C)] public byte bLockOutgoing;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FUpdateLevelVisibilityLevelInfo
{
    [FieldOffset(0x0000)] public FName PackageName;
    [FieldOffset(0x0008)] public FName Filename;
    [FieldOffset(0x0010)] public byte bIsVisible;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FLatentActionInfo
{
    [FieldOffset(0x0000)] public int Linkage;
    [FieldOffset(0x0004)] public int UUID;
    [FieldOffset(0x0008)] public FName ExecutionFunction;
    [FieldOffset(0x0010)] public UObject* CallbackTarget;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FUpdateLevelStreamingLevelStatus
{
    [FieldOffset(0x0000)] public FName PackageName;
    [FieldOffset(0x0008)] public int LODIndex;
    [FieldOffset(0x000C)] public bool bNewShouldBeLoaded;
    [FieldOffset(0x000D)] public bool bNewShouldBeVisible;
    [FieldOffset(0x000E)] public bool bNewShouldBlockOnLoad;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FForceFeedbackParameters
{
    [FieldOffset(0x0000)] public FName Tag;
    [FieldOffset(0x0008)] public bool bLooping;
    [FieldOffset(0x0009)] public bool bIgnoreTimeDilation;
    [FieldOffset(0x000A)] public bool bPlayWhilePaused;
}

[StructLayout(LayoutKind.Explicit, Size = 0x580)] 
public unsafe struct APlayerController
{
    [FieldOffset(0x0000)] public AController baseObj;
    [FieldOffset(0x0298)] public UPlayer* Player;
    [FieldOffset(0x02A0)] public APawn* AcknowledgedPawn;
    [FieldOffset(0x02A8)] public UInterpTrackInstDirector* ControllingDirTrackInst;
    [FieldOffset(0x02B0)] public AHUD* MyHUD;
    [FieldOffset(0x02B8)] public APlayerCameraManager* PlayerCameraManager;
    [FieldOffset(0x02C0)] public TSubclassOf<APlayerCameraManager> PlayerCameraManagerClass;
    [FieldOffset(0x02C8)] public bool bAutoManageActiveCameraTarget;
    [FieldOffset(0x02CC)] public FRotator TargetViewRotation;
    [FieldOffset(0x02E4)] public float SmoothTargetViewRotationSpeed;
    [FieldOffset(0x02F0)] public TArray<IntPtr> HiddenActors;
    [FieldOffset(0x0300)] public TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenPrimitiveComponents;
    [FieldOffset(0x0314)] public float LastSpectatorStateSynchTime;
    [FieldOffset(0x0318)] public FVector LastSpectatorSyncLocation;
    [FieldOffset(0x0324)] public FRotator LastSpectatorSyncRotation;
    [FieldOffset(0x0330)] public int ClientCap;
    [FieldOffset(0x0338)] public UCheatManager* CheatManager;
    [FieldOffset(0x0340)] public TSubclassOf<UCheatManager> CheatClass;
    [FieldOffset(0x0348)] public UPlayerInput* PlayerInput;
    [FieldOffset(0x0350)] public TArray<FActiveForceFeedbackEffect> ActiveForceFeedbackEffects;
    [FieldOffset(0x03E0)] public byte bPlayerIsWaiting;
    [FieldOffset(0x03E4)] public byte NetPlayerIndex;
    [FieldOffset(0x0420)] public UNetConnection* PendingSwapConnection;
    [FieldOffset(0x0428)] public UNetConnection* NetConnection;
    [FieldOffset(0x043C)] public float InputYawScale;
    [FieldOffset(0x0440)] public float InputPitchScale;
    [FieldOffset(0x0444)] public float InputRollScale;
    [FieldOffset(0x0448)] public byte bShowMouseCursor;
    [FieldOffset(0x0448)] public byte bEnableClickEvents;
    [FieldOffset(0x0448)] public byte bEnableTouchEvents;
    [FieldOffset(0x0448)] public byte bEnableMouseOverEvents;
    [FieldOffset(0x0448)] public byte bEnableTouchOverEvents;
    [FieldOffset(0x0448)] public byte bForceFeedbackEnabled;
    [FieldOffset(0x044C)] public float ForceFeedbackScale;
    [FieldOffset(0x0450)] public TArray<FKey> ClickEventKeys;
    [FieldOffset(0x0460)] public EMouseCursor DefaultMouseCursor;
    [FieldOffset(0x0461)] public EMouseCursor CurrentMouseCursor;
    [FieldOffset(0x0462)] public ECollisionChannel DefaultClickTraceChannel;
    [FieldOffset(0x0463)] public ECollisionChannel CurrentClickTraceChannel;
    [FieldOffset(0x0464)] public float HitResultTraceDistance;
    [FieldOffset(0x0468)] public ushort SeamlessTravelCount;
    [FieldOffset(0x046A)] public ushort LastCompletedSeamlessTravelCount;
    [FieldOffset(0x04E0)] public UInputComponent* InactiveStateInputComponent;
    [FieldOffset(0x04E8)] public byte bShouldPerformFullTickWhenPaused;
    [FieldOffset(0x0500)] public UTouchInterface* CurrentTouchInterface;
    [FieldOffset(0x0558)] public ASpectatorPawn* SpectatorPawn;
    [FieldOffset(0x0564)] public bool bIsLocalPlayerController;
    [FieldOffset(0x0568)] public FVector SpawnLocation;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FBoneReference
{
    [FieldOffset(0x0000)] public FName BoneName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct FSplineCurves
{
    [FieldOffset(0x0000)] public FInterpCurveVector Position;
    [FieldOffset(0x0018)] public FInterpCurveQuat Rotation;
    [FieldOffset(0x0030)] public FInterpCurveVector Scale;
    [FieldOffset(0x0048)] public FInterpCurveFloat ReparamTable;
    [FieldOffset(0x0060)] public USplineMetadata* MetaData;
    [FieldOffset(0x0068)] public uint Version;
}

[StructLayout(LayoutKind.Explicit, Size = 0x44)] 
public unsafe struct FSplinePoint
{
    [FieldOffset(0x0000)] public float InputKey;
    [FieldOffset(0x0004)] public FVector Position;
    [FieldOffset(0x0010)] public FVector ArriveTangent;
    [FieldOffset(0x001C)] public FVector LeaveTangent;
    [FieldOffset(0x0028)] public FRotator Rotation;
    [FieldOffset(0x0034)] public FVector Scale;
    [FieldOffset(0x0040)] public ESplinePointType Type;
}

[StructLayout(LayoutKind.Explicit, Size = 0x550)] 
public unsafe struct USplineComponent
{
    [FieldOffset(0x0000)] public UPrimitiveComponent baseObj;
    [FieldOffset(0x0450)] public FSplineCurves SplineCurves;
    [FieldOffset(0x04C0)] public FInterpCurveVector SplineInfo;
    [FieldOffset(0x04D8)] public FInterpCurveQuat SplineRotInfo;
    [FieldOffset(0x04F0)] public FInterpCurveVector SplineScaleInfo;
    [FieldOffset(0x0508)] public FInterpCurveFloat SplineReparamTable;
    [FieldOffset(0x0520)] public bool bAllowSplineEditingPerInstance;
    [FieldOffset(0x0524)] public int ReparamStepsPerSegment;
    [FieldOffset(0x0528)] public float Duration;
    [FieldOffset(0x052C)] public bool bStationaryEndpoints;
    [FieldOffset(0x052D)] public bool bSplineHasBeenEdited;
    [FieldOffset(0x052E)] public bool bModifiedByConstructionScript;
    [FieldOffset(0x052F)] public bool bInputSplinePointsToConstructionScript;
    [FieldOffset(0x0530)] public bool bDrawDebug;
    [FieldOffset(0x0531)] public bool bClosedLoop;
    [FieldOffset(0x0532)] public bool bLoopPositionOverride;
    [FieldOffset(0x0534)] public float LoopPosition;
    [FieldOffset(0x0538)] public FVector DefaultUpVector;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB0)] 
public unsafe struct UCameraShakeBase
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public bool bSingleInstance;
    [FieldOffset(0x002C)] public float ShakeScale;
    [FieldOffset(0x0030)] public UCameraShakePattern* RootShakePattern;
    [FieldOffset(0x0038)] public APlayerCameraManager* CameraManager;
}

[StructLayout(LayoutKind.Explicit, Size = 0x5F0)] 
public unsafe struct FMinimalViewInfo
{
    [FieldOffset(0x0000)] public FVector Location;
    [FieldOffset(0x000C)] public FRotator Rotation;
    [FieldOffset(0x0018)] public float FOV;
    [FieldOffset(0x001C)] public float DesiredFOV;
    [FieldOffset(0x0020)] public float OrthoWidth;
    [FieldOffset(0x0024)] public float OrthoNearClipPlane;
    [FieldOffset(0x0028)] public float OrthoFarClipPlane;
    [FieldOffset(0x002C)] public float AspectRatio;
    [FieldOffset(0x0030)] public byte bConstrainAspectRatio;
    [FieldOffset(0x0030)] public byte bUseFieldOfViewForLOD;
    [FieldOffset(0x0034)] public ECameraProjectionMode ProjectionMode;
    [FieldOffset(0x0038)] public float PostProcessBlendWeight;
    [FieldOffset(0x0040)] public FPostProcessSettings PostProcessSettings;
    [FieldOffset(0x05A0)] public FVector2D OffCenterProjectionOffset;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FGeomSelection
{
    [FieldOffset(0x0000)] public int Type;
    [FieldOffset(0x0004)] public int Index;
    [FieldOffset(0x0008)] public int SelectionIndex;
}

[StructLayout(LayoutKind.Explicit, Size = 0x258)] 
public unsafe struct ABrush
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public EBrushType BrushType;
    [FieldOffset(0x0224)] public FColor BrushColor;
    [FieldOffset(0x0228)] public int PolyFlags;
    [FieldOffset(0x022C)] public byte bColored;
    [FieldOffset(0x022C)] public byte bSolidWhenSelected;
    [FieldOffset(0x022C)] public byte bPlaceableFromClassBrowser;
    [FieldOffset(0x022C)] public byte bNotForClientOrServer;
    [FieldOffset(0x0230)] public UModel* Brush;
    [FieldOffset(0x0238)] public UBrushComponent* BrushComponent;
    [FieldOffset(0x0240)] public byte bInManipulation;
    [FieldOffset(0x0248)] public TArray<FGeomSelection> SavedSelections;
}

[StructLayout(LayoutKind.Explicit, Size = 0x258)] 
public unsafe struct AVolume
{
    [FieldOffset(0x0000)] public ABrush baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FTableRowBase
{
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FSoundConcurrencySettings
{
    [FieldOffset(0x0000)] public int MaxCount;
    [FieldOffset(0x0004)] public byte bLimitToOwner;
    [FieldOffset(0x0008)] public EMaxConcurrentResolutionRule ResolutionRule;
    [FieldOffset(0x000C)] public float RetriggerTime;
    [FieldOffset(0x0010)] public float VolumeScale;
    [FieldOffset(0x0014)] public EConcurrencyVolumeScaleMode VolumeScaleMode;
    [FieldOffset(0x0018)] public float VolumeScaleAttackTime;
    [FieldOffset(0x001C)] public byte bVolumeScaleCanRelease;
    [FieldOffset(0x0020)] public float VolumeScaleReleaseTime;
    [FieldOffset(0x0024)] public float VoiceStealReleaseTime;
}

[StructLayout(LayoutKind.Explicit, Size = 0x170)] 
public unsafe struct USoundBase
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public USoundClass* SoundClassObject;
    [FieldOffset(0x0038)] public byte bDebug;
    [FieldOffset(0x0038)] public byte bOverrideConcurrency;
    [FieldOffset(0x0038)] public byte bEnableBusSends;
    [FieldOffset(0x0038)] public byte bEnableBaseSubmix;
    [FieldOffset(0x0038)] public byte bEnableSubmixSends;
    [FieldOffset(0x0038)] public byte bHasDelayNode;
    [FieldOffset(0x0038)] public byte bHasConcatenatorNode;
    [FieldOffset(0x0038)] public byte bBypassVolumeScaleForPriority;
    [FieldOffset(0x0039)] public EVirtualizationMode VirtualizationMode;
    [FieldOffset(0x0090)] public TSet<IntPtr> ConcurrencySet;
    [FieldOffset(0x00E0)] public FSoundConcurrencySettings ConcurrencyOverrides;
    [FieldOffset(0x0108)] public float Duration;
    [FieldOffset(0x010C)] public float MaxDistance;
    [FieldOffset(0x0110)] public float TotalSamples;
    [FieldOffset(0x0114)] public float Priority;
    [FieldOffset(0x0118)] public USoundAttenuation* AttenuationSettings;
    [FieldOffset(0x0120)] public USoundSubmixBase* SoundSubmixObject;
    [FieldOffset(0x0128)] public TArray<FSoundSubmixSendInfo> SoundSubmixSends;
    [FieldOffset(0x0138)] public USoundEffectSourcePresetChain* SourceEffectChain;
    [FieldOffset(0x0140)] public TArray<FSoundSourceBusSendInfo> BusSends;
    [FieldOffset(0x0150)] public TArray<FSoundSourceBusSendInfo> PreEffectBusSends;
    [FieldOffset(0x0160)] public TArray<IntPtr> AssetUserData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FSoundModulationDestinationSettings
{
    [FieldOffset(0x0000)] public float Value;
    [FieldOffset(0x0008)] public USoundModulatorBase* Modulator;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct FSoundModulationDefaultSettings
{
    [FieldOffset(0x0000)] public FSoundModulationDestinationSettings VolumeModulationDestination;
    [FieldOffset(0x0010)] public FSoundModulationDestinationSettings PitchModulationDestination;
    [FieldOffset(0x0020)] public FSoundModulationDestinationSettings HighpassModulationDestination;
    [FieldOffset(0x0030)] public FSoundModulationDestinationSettings LowpassModulationDestination;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct FSoundModulationDefaultRoutingSettings
{
    [FieldOffset(0x0000)] public FSoundModulationDefaultSettings baseObj;
    [FieldOffset(0x0040)] public EModulationRouting VolumeRouting;
    [FieldOffset(0x0041)] public EModulationRouting PitchRouting;
    [FieldOffset(0x0042)] public EModulationRouting HighpassRouting;
    [FieldOffset(0x0043)] public EModulationRouting LowpassRouting;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FSoundWaveSpectralDataEntry
{
    [FieldOffset(0x0000)] public float Magnitude;
    [FieldOffset(0x0004)] public float NormalizedMagnitude;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FSoundWaveSpectralTimeData
{
    [FieldOffset(0x0000)] public TArray<FSoundWaveSpectralDataEntry> Data;
    [FieldOffset(0x0010)] public float TimeSec;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FSoundWaveEnvelopeTimeData
{
    [FieldOffset(0x0000)] public float Amplitude;
    [FieldOffset(0x0004)] public float TimeSec;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FSubtitleCue
{
    [FieldOffset(0x0000)] public FText Text;
    [FieldOffset(0x0018)] public float Time;
}

[StructLayout(LayoutKind.Explicit, Size = 0x370)] 
public unsafe struct USoundWave
{
    [FieldOffset(0x0000)] public USoundBase baseObj;
    [FieldOffset(0x0170)] public int CompressionQuality;
    [FieldOffset(0x0174)] public int StreamingPriority;
    [FieldOffset(0x0178)] public ESoundwaveSampleRateSettings SampleRateQuality;
    [FieldOffset(0x017A)] public ESoundGroup SoundGroup;
    [FieldOffset(0x017B)] public byte bLooping;
    [FieldOffset(0x017B)] public byte bStreaming;
    [FieldOffset(0x017B)] public byte bSeekableStreaming;
    [FieldOffset(0x017C)] public ESoundWaveLoadingBehavior LoadingBehavior;
    [FieldOffset(0x017D)] public byte bMature;
    [FieldOffset(0x017D)] public byte bManualWordWrap;
    [FieldOffset(0x017E)] public byte bSingleLine;
    [FieldOffset(0x017E)] public byte bIsAmbisonics;
    [FieldOffset(0x0180)] public FSoundModulationDefaultRoutingSettings ModulationSettings;
    [FieldOffset(0x01C8)] public TArray<float> FrequenciesToAnalyze;
    [FieldOffset(0x01D8)] public TArray<FSoundWaveSpectralTimeData> CookedSpectralTimeData;
    [FieldOffset(0x01E8)] public TArray<FSoundWaveEnvelopeTimeData> CookedEnvelopeTimeData;
    [FieldOffset(0x01F8)] public int InitialChunkSize;
    [FieldOffset(0x0240)] public FString SpokenText;
    [FieldOffset(0x0250)] public float SubtitlePriority;
    [FieldOffset(0x0254)] public float Volume;
    [FieldOffset(0x0258)] public float Pitch;
    [FieldOffset(0x025C)] public int NumChannels;
    [FieldOffset(0x0260)] public int SampleRate;
    [FieldOffset(0x0270)] public TArray<FSubtitleCue> Subtitles;
    [FieldOffset(0x0280)] public UCurveTable* Curves;
    [FieldOffset(0x0288)] public UCurveTable* InternalCurves;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3C0)] 
public unsafe struct USoundWaveProcedural
{
    [FieldOffset(0x0000)] public USoundWave baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UStreamableRenderAsset
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0040)] public double ForceMipLevelsToBeResidentTimestamp;
    [FieldOffset(0x0048)] public int NumCinematicMipLevels;
    [FieldOffset(0x004C)] public int StreamingIndex;
    [FieldOffset(0x0050)] public int CachedCombinedLODBias;
    [FieldOffset(0x0054)] public byte NeverStream;
    [FieldOffset(0x0054)] public byte bGlobalForceMipLevelsToBeResident;
    [FieldOffset(0x0054)] public byte bHasStreamingUpdatePending;
    [FieldOffset(0x0054)] public byte bForceMiplevelsToBeResident;
    [FieldOffset(0x0054)] public byte bIgnoreStreamingMipBias;
    [FieldOffset(0x0054)] public byte bUseCinematicMipLevels;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FPerPlatformFloat
{
    [FieldOffset(0x0000)] public float Default;
}

[StructLayout(LayoutKind.Explicit, Size = 0x180)] 
public unsafe struct UTexture
{
    [FieldOffset(0x0000)] public UStreamableRenderAsset baseObj;
    [FieldOffset(0x0068)] public FGuid LightingGuid;
    [FieldOffset(0x0078)] public int LODBias;
    [FieldOffset(0x007C)] public TextureCompressionSettings CompressionSettings;
    [FieldOffset(0x007D)] public TextureFilter Filter;
    [FieldOffset(0x007E)] public ETextureMipLoadOptions MipLoadOptions;
    [FieldOffset(0x007F)] public TextureGroup LODGroup;
    [FieldOffset(0x0080)] public FPerPlatformFloat Downscale;
    [FieldOffset(0x0084)] public ETextureDownscaleOptions DownscaleOptions;
    [FieldOffset(0x0085)] public byte sRGB;
    [FieldOffset(0x0085)] public byte bNoTiling;
    [FieldOffset(0x0085)] public byte VirtualTextureStreaming;
    [FieldOffset(0x0085)] public byte CompressionYCoCg;
    [FieldOffset(0x0085)] public byte bNotOfflineProcessed;
    [FieldOffset(0x0085)] public byte bAsyncResourceReleaseHasBeenStarted;
    [FieldOffset(0x0088)] public TArray<IntPtr> AssetUserData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UMaterialExpression
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UMaterial* Material;
    [FieldOffset(0x0030)] public UMaterialFunction* Function;
    [FieldOffset(0x0038)] public byte bIsParameterExpression;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FExpressionInput
{
    [FieldOffset(0x0000)] public int OutputIndex;
    [FieldOffset(0x0004)] public FName InputName;
    [FieldOffset(0x000C)] public FName ExpressionName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UMaterialExpressionTextureBase
{
    [FieldOffset(0x0000)] public UMaterialExpression baseObj;
    [FieldOffset(0x0040)] public UTexture* Texture;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UMaterialExpressionTextureSample
{
    [FieldOffset(0x0000)] public UMaterialExpressionTextureBase baseObj;
    [FieldOffset(0x0048)] public FExpressionInput Coordinates;
}

[StructLayout(LayoutKind.Explicit, Size = 0x80)] 
public unsafe struct UMaterialExpressionTextureSampleParameter
{
    [FieldOffset(0x0000)] public UMaterialExpressionTextureSample baseObj;
    [FieldOffset(0x0060)] public FName ParameterName;
    [FieldOffset(0x0068)] public FGuid ExpressionGUID;
    [FieldOffset(0x0078)] public FName Group;
}

[StructLayout(LayoutKind.Explicit, Size = 0x80)] 
public unsafe struct UMaterialExpressionTextureSampleParameter2D
{
    [FieldOffset(0x0000)] public UMaterialExpressionTextureSampleParameter baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x80)] 
public unsafe struct UCommandlet
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public FString HelpDescription;
    [FieldOffset(0x0038)] public FString HelpUsage;
    [FieldOffset(0x0048)] public FString HelpWebLink;
    [FieldOffset(0x0058)] public TArray<FString> HelpParamNames;
    [FieldOffset(0x0068)] public TArray<FString> HelpParamDescriptions;
    [FieldOffset(0x0078)] public byte IsServer;
    [FieldOffset(0x0078)] public byte IsClient;
    [FieldOffset(0x0078)] public byte IsEditor;
    [FieldOffset(0x0078)] public byte LogToConsole;
    [FieldOffset(0x0078)] public byte ShowErrorCount;
    [FieldOffset(0x0078)] public byte ShowProgress;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FPerPlatformInt
{
    [FieldOffset(0x0000)] public int Default;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1)] 
public unsafe struct FPerPlatformBool
{
    [FieldOffset(0x0000)] public bool Default;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FAudioComponentParam
{
    [FieldOffset(0x0000)] public FName ParamName;
    [FieldOffset(0x0008)] public float FloatParam;
    [FieldOffset(0x000C)] public bool BoolParam;
    [FieldOffset(0x0010)] public int IntParam;
    [FieldOffset(0x0018)] public USoundWave* SoundWaveParam;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FQuartzQuantizationBoundary
{
    [FieldOffset(0x0000)] public EQuartzCommandQuantization Quantization;
    [FieldOffset(0x0004)] public float Multiplier;
    [FieldOffset(0x0008)] public EQuarztQuantizationReference CountingReferencePoint;
    [FieldOffset(0x0009)] public bool bFireOnClockStart;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FSoundWaveSpectralData
{
    [FieldOffset(0x0000)] public float FrequencyHz;
    [FieldOffset(0x0004)] public float Magnitude;
    [FieldOffset(0x0008)] public float NormalizedMagnitude;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FSoundWaveSpectralDataPerSound
{
    [FieldOffset(0x0000)] public TArray<FSoundWaveSpectralData> SpectralData;
    [FieldOffset(0x0010)] public float PlaybackTime;
    [FieldOffset(0x0018)] public USoundWave* SoundWave;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FSoundWaveEnvelopeDataPerSound
{
    [FieldOffset(0x0000)] public float Envelope;
    [FieldOffset(0x0004)] public float PlaybackTime;
    [FieldOffset(0x0008)] public USoundWave* SoundWave;
}

[StructLayout(LayoutKind.Explicit, Size = 0x860)] 
public unsafe struct UAudioComponent
{
    [FieldOffset(0x0000)] public USceneComponent baseObj;
    [FieldOffset(0x01F8)] public USoundBase* Sound;
    [FieldOffset(0x0200)] public TArray<FAudioComponentParam> InstanceParameters;
    [FieldOffset(0x0210)] public USoundClass* SoundClassOverride;
    [FieldOffset(0x0218)] public byte bAutoDestroy;
    [FieldOffset(0x0218)] public byte bStopWhenOwnerDestroyed;
    [FieldOffset(0x0218)] public byte bShouldRemainActiveIfDropped;
    [FieldOffset(0x0218)] public byte bAllowSpatialization;
    [FieldOffset(0x0218)] public byte bOverrideAttenuation;
    [FieldOffset(0x0218)] public byte bOverrideSubtitlePriority;
    [FieldOffset(0x0218)] public byte bIsUISound;
    [FieldOffset(0x0218)] public byte bEnableLowPassFilter;
    [FieldOffset(0x0219)] public byte bOverridePriority;
    [FieldOffset(0x0219)] public byte bSuppressSubtitles;
    [FieldOffset(0x021A)] public byte bAutoManageAttachment;
    [FieldOffset(0x0220)] public FName AudioComponentUserID;
    [FieldOffset(0x0228)] public float PitchModulationMin;
    [FieldOffset(0x022C)] public float PitchModulationMax;
    [FieldOffset(0x0230)] public float VolumeModulationMin;
    [FieldOffset(0x0234)] public float VolumeModulationMax;
    [FieldOffset(0x0238)] public float VolumeMultiplier;
    [FieldOffset(0x023C)] public int EnvelopeFollowerAttackTime;
    [FieldOffset(0x0240)] public int EnvelopeFollowerReleaseTime;
    [FieldOffset(0x0244)] public float Priority;
    [FieldOffset(0x0248)] public float SubtitlePriority;
    [FieldOffset(0x0250)] public USoundEffectSourcePresetChain* SourceEffectChain;
    [FieldOffset(0x0258)] public float PitchMultiplier;
    [FieldOffset(0x025C)] public float LowPassFilterFrequency;
    [FieldOffset(0x0268)] public USoundAttenuation* AttenuationSettings;
    [FieldOffset(0x0270)] public FSoundAttenuationSettings AttenuationOverrides;
    [FieldOffset(0x0610)] public USoundConcurrency* ConcurrencySettings;
    [FieldOffset(0x0618)] public TSet<IntPtr> ConcurrencySet;
    [FieldOffset(0x0674)] public EAttachmentRule AutoAttachLocationRule;
    [FieldOffset(0x0675)] public EAttachmentRule AutoAttachRotationRule;
    [FieldOffset(0x0676)] public EAttachmentRule AutoAttachScaleRule;
    [FieldOffset(0x0678)] public FSoundModulationDefaultRoutingSettings ModulationRouting;
    [FieldOffset(0x07C0)] public TWeakObjectPtr<USceneComponent> AutoAttachParent;
    [FieldOffset(0x07C8)] public FName AutoAttachSocketName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UAssetImportData
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UAssetUserData
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FKShapeElem
{
    [FieldOffset(0x0008)] public float RestOffset;
    [FieldOffset(0x000C)] public FName Name;
    [FieldOffset(0x0018)] public byte bContributeToMass;
    [FieldOffset(0x0019)] public ECollisionEnabled CollisionEnabled;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB0)] 
public unsafe struct FKConvexElem
{
    [FieldOffset(0x0000)] public FKShapeElem baseObj;
    [FieldOffset(0x0030)] public TArray<FVector> VertexData;
    [FieldOffset(0x0040)] public TArray<int> IndexData;
    [FieldOffset(0x0050)] public FBox ElemBox;
    [FieldOffset(0x0070)] public FTransform Transform;
}

[StructLayout(LayoutKind.Explicit, Size = 0xF0)] 
public unsafe struct UMovementComponent
{
    [FieldOffset(0x0000)] public UActorComponent baseObj;
    [FieldOffset(0x00B0)] public USceneComponent* UpdatedComponent;
    [FieldOffset(0x00B8)] public UPrimitiveComponent* UpdatedPrimitive;
    [FieldOffset(0x00C4)] public FVector Velocity;
    [FieldOffset(0x00D0)] public FVector PlaneConstraintNormal;
    [FieldOffset(0x00DC)] public FVector PlaneConstraintOrigin;
    [FieldOffset(0x00E8)] public byte bUpdateOnlyIfRendered;
    [FieldOffset(0x00E8)] public byte bAutoUpdateTickRegistration;
    [FieldOffset(0x00E8)] public byte bTickBeforeOwner;
    [FieldOffset(0x00E8)] public byte bAutoRegisterUpdatedComponent;
    [FieldOffset(0x00E8)] public byte bConstrainToPlane;
    [FieldOffset(0x00E8)] public byte bSnapToPlaneAtStart;
    [FieldOffset(0x00E8)] public byte bAutoRegisterPhysicsVolumeUpdates;
    [FieldOffset(0x00E8)] public byte bComponentShouldUpdatePhysicsVolume;
    [FieldOffset(0x00EB)] public EPlaneConstraintAxisSetting PlaneConstraintAxisSetting;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1)] 
public unsafe struct FMovementProperties
{
    [FieldOffset(0x0000)] public byte bCanCrouch;
    [FieldOffset(0x0000)] public byte bCanJump;
    [FieldOffset(0x0000)] public byte bCanWalk;
    [FieldOffset(0x0000)] public byte bCanSwim;
    [FieldOffset(0x0000)] public byte bCanFly;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FNavAgentProperties
{
    [FieldOffset(0x0000)] public FMovementProperties baseObj;
    [FieldOffset(0x0004)] public float AgentRadius;
    [FieldOffset(0x0008)] public float AgentHeight;
    [FieldOffset(0x000C)] public float AgentStepHeight;
    [FieldOffset(0x0010)] public float NavWalkingSearchHeightScale;
    [FieldOffset(0x0018)] public FSoftClassPath PreferredNavData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x130)] 
public unsafe struct UNavMovementComponent
{
    [FieldOffset(0x0000)] public UMovementComponent baseObj;
    [FieldOffset(0x00F0)] public FNavAgentProperties NavAgentProps;
    [FieldOffset(0x0120)] public float FixedPathBrakingDistance;
    [FieldOffset(0x0124)] public byte bUpdateNavAgentWithOwnersCollision;
    [FieldOffset(0x0124)] public byte bUseAccelerationForPaths;
    [FieldOffset(0x0124)] public byte bUseFixedBrakingDistanceForPaths;
    [FieldOffset(0x0125)] public FMovementProperties MovementState;
    [FieldOffset(0x0128)] public UObject* PathFollowingComp;
}

[StructLayout(LayoutKind.Explicit, Size = 0x138)] 
public unsafe struct UPawnMovementComponent
{
    [FieldOffset(0x0000)] public UNavMovementComponent baseObj;
    [FieldOffset(0x0130)] public APawn* PawnOwner;
}

[StructLayout(LayoutKind.Explicit, Size = 0x94)] 
public unsafe struct FFindFloorResult
{
    [FieldOffset(0x0000)] public byte bBlockingHit;
    [FieldOffset(0x0000)] public byte bWalkableFloor;
    [FieldOffset(0x0000)] public byte bLineTrace;
    [FieldOffset(0x0004)] public float FloorDist;
    [FieldOffset(0x0008)] public float LineDist;
    [FieldOffset(0x000C)] public FHitResult HitResult;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FNavAvoidanceMask
{
    [FieldOffset(0x0000)] public byte bGroup0;
    [FieldOffset(0x0000)] public byte bGroup1;
    [FieldOffset(0x0000)] public byte bGroup2;
    [FieldOffset(0x0000)] public byte bGroup3;
    [FieldOffset(0x0000)] public byte bGroup4;
    [FieldOffset(0x0000)] public byte bGroup5;
    [FieldOffset(0x0000)] public byte bGroup6;
    [FieldOffset(0x0000)] public byte bGroup7;
    [FieldOffset(0x0001)] public byte bGroup8;
    [FieldOffset(0x0001)] public byte bGroup9;
    [FieldOffset(0x0001)] public byte bGroup10;
    [FieldOffset(0x0001)] public byte bGroup11;
    [FieldOffset(0x0001)] public byte bGroup12;
    [FieldOffset(0x0001)] public byte bGroup13;
    [FieldOffset(0x0001)] public byte bGroup14;
    [FieldOffset(0x0001)] public byte bGroup15;
    [FieldOffset(0x0002)] public byte bGroup16;
    [FieldOffset(0x0002)] public byte bGroup17;
    [FieldOffset(0x0002)] public byte bGroup18;
    [FieldOffset(0x0002)] public byte bGroup19;
    [FieldOffset(0x0002)] public byte bGroup20;
    [FieldOffset(0x0002)] public byte bGroup21;
    [FieldOffset(0x0002)] public byte bGroup22;
    [FieldOffset(0x0002)] public byte bGroup23;
    [FieldOffset(0x0003)] public byte bGroup24;
    [FieldOffset(0x0003)] public byte bGroup25;
    [FieldOffset(0x0003)] public byte bGroup26;
    [FieldOffset(0x0003)] public byte bGroup27;
    [FieldOffset(0x0003)] public byte bGroup28;
    [FieldOffset(0x0003)] public byte bGroup29;
    [FieldOffset(0x0003)] public byte bGroup30;
    [FieldOffset(0x0003)] public byte bGroup31;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FCharacterMovementComponentPostPhysicsTickFunction
{
    [FieldOffset(0x0000)] public FTickFunction baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xAF0)] 
public unsafe struct UCharacterMovementComponent
{
    [FieldOffset(0x0000)] public UPawnMovementComponent baseObj;
    [FieldOffset(0x0148)] public ACharacter* CharacterOwner;
    [FieldOffset(0x0150)] public float GravityScale;
    [FieldOffset(0x0154)] public float MaxStepHeight;
    [FieldOffset(0x0158)] public float JumpZVelocity;
    [FieldOffset(0x015C)] public float JumpOffJumpZFactor;
    [FieldOffset(0x0160)] public float WalkableFloorAngle;
    [FieldOffset(0x0164)] public float WalkableFloorZ;
    [FieldOffset(0x0168)] public EMovementMode MovementMode;
    [FieldOffset(0x0169)] public byte CustomMovementMode;
    [FieldOffset(0x016A)] public ENetworkSmoothingMode NetworkSmoothingMode;
    [FieldOffset(0x016C)] public float GroundFriction;
    [FieldOffset(0x018C)] public float MaxWalkSpeed;
    [FieldOffset(0x0190)] public float MaxWalkSpeedCrouched;
    [FieldOffset(0x0194)] public float MaxSwimSpeed;
    [FieldOffset(0x0198)] public float MaxFlySpeed;
    [FieldOffset(0x019C)] public float MaxCustomMovementSpeed;
    [FieldOffset(0x01A0)] public float MaxAcceleration;
    [FieldOffset(0x01A4)] public float MinAnalogWalkSpeed;
    [FieldOffset(0x01A8)] public float BrakingFrictionFactor;
    [FieldOffset(0x01AC)] public float BrakingFriction;
    [FieldOffset(0x01B0)] public float BrakingSubStepTime;
    [FieldOffset(0x01B4)] public float BrakingDecelerationWalking;
    [FieldOffset(0x01B8)] public float BrakingDecelerationFalling;
    [FieldOffset(0x01BC)] public float BrakingDecelerationSwimming;
    [FieldOffset(0x01C0)] public float BrakingDecelerationFlying;
    [FieldOffset(0x01C4)] public float AirControl;
    [FieldOffset(0x01C8)] public float AirControlBoostMultiplier;
    [FieldOffset(0x01CC)] public float AirControlBoostVelocityThreshold;
    [FieldOffset(0x01D0)] public float FallingLateralFriction;
    [FieldOffset(0x01D4)] public float CrouchedHalfHeight;
    [FieldOffset(0x01D8)] public float Buoyancy;
    [FieldOffset(0x01DC)] public float PerchRadiusThreshold;
    [FieldOffset(0x01E0)] public float PerchAdditionalHeight;
    [FieldOffset(0x01E4)] public FRotator RotationRate;
    [FieldOffset(0x01F0)] public byte bUseSeparateBrakingFriction;
    [FieldOffset(0x01F0)] public byte bApplyGravityWhileJumping;
    [FieldOffset(0x01F0)] public byte bUseControllerDesiredRotation;
    [FieldOffset(0x01F0)] public byte bOrientRotationToMovement;
    [FieldOffset(0x01F0)] public byte bSweepWhileNavWalking;
    [FieldOffset(0x01F0)] public byte bMovementInProgress;
    [FieldOffset(0x01F0)] public byte bEnableScopedMovementUpdates;
    [FieldOffset(0x01F1)] public byte bEnableServerDualMoveScopedMovementUpdates;
    [FieldOffset(0x01F1)] public byte bForceMaxAccel;
    [FieldOffset(0x01F1)] public byte bRunPhysicsWithNoController;
    [FieldOffset(0x01F1)] public byte bForceNextFloorCheck;
    [FieldOffset(0x01F1)] public byte bShrinkProxyCapsule;
    [FieldOffset(0x01F1)] public byte bCanWalkOffLedges;
    [FieldOffset(0x01F1)] public byte bCanWalkOffLedgesWhenCrouching;
    [FieldOffset(0x01F2)] public byte bNetworkSkipProxyPredictionOnNetUpdate;
    [FieldOffset(0x01F2)] public byte bNetworkAlwaysReplicateTransformUpdateTimestamp;
    [FieldOffset(0x01F2)] public byte bDeferUpdateMoveComponent;
    [FieldOffset(0x01F2)] public byte bEnablePhysicsInteraction;
    [FieldOffset(0x01F2)] public byte bTouchForceScaledToMass;
    [FieldOffset(0x01F2)] public byte bPushForceScaledToMass;
    [FieldOffset(0x01F2)] public byte bPushForceUsingZOffset;
    [FieldOffset(0x01F3)] public byte bScalePushForceToVelocity;
    [FieldOffset(0x01F8)] public USceneComponent* DeferredUpdatedMoveComponent;
    [FieldOffset(0x0200)] public float MaxOutOfWaterStepHeight;
    [FieldOffset(0x0204)] public float OutofWaterZ;
    [FieldOffset(0x0208)] public float Mass;
    [FieldOffset(0x020C)] public float StandingDownwardForceScale;
    [FieldOffset(0x0210)] public float InitialPushForceFactor;
    [FieldOffset(0x0214)] public float PushForceFactor;
    [FieldOffset(0x0218)] public float PushForcePointZOffsetFactor;
    [FieldOffset(0x021C)] public float TouchForceFactor;
    [FieldOffset(0x0220)] public float MinTouchForce;
    [FieldOffset(0x0224)] public float MaxTouchForce;
    [FieldOffset(0x0228)] public float RepulsionForce;
    [FieldOffset(0x022C)] public FVector Acceleration;
    [FieldOffset(0x0240)] public FQuat LastUpdateRotation;
    [FieldOffset(0x0250)] public FVector LastUpdateLocation;
    [FieldOffset(0x025C)] public FVector LastUpdateVelocity;
    [FieldOffset(0x0268)] public float ServerLastTransformUpdateTimeStamp;
    [FieldOffset(0x026C)] public float ServerLastClientGoodMoveAckTime;
    [FieldOffset(0x0270)] public float ServerLastClientAdjustmentTime;
    [FieldOffset(0x0274)] public FVector PendingImpulseToApply;
    [FieldOffset(0x0280)] public FVector PendingForceToApply;
    [FieldOffset(0x028C)] public float AnalogInputModifier;
    [FieldOffset(0x029C)] public float MaxSimulationTimeStep;
    [FieldOffset(0x02A0)] public int MaxSimulationIterations;
    [FieldOffset(0x02A4)] public int MaxJumpApexAttemptsPerSimulation;
    [FieldOffset(0x02A8)] public float MaxDepenetrationWithGeometry;
    [FieldOffset(0x02AC)] public float MaxDepenetrationWithGeometryAsProxy;
    [FieldOffset(0x02B0)] public float MaxDepenetrationWithPawn;
    [FieldOffset(0x02B4)] public float MaxDepenetrationWithPawnAsProxy;
    [FieldOffset(0x02B8)] public float NetworkSimulatedSmoothLocationTime;
    [FieldOffset(0x02BC)] public float NetworkSimulatedSmoothRotationTime;
    [FieldOffset(0x02C0)] public float ListenServerNetworkSimulatedSmoothLocationTime;
    [FieldOffset(0x02C4)] public float ListenServerNetworkSimulatedSmoothRotationTime;
    [FieldOffset(0x02C8)] public float NetProxyShrinkRadius;
    [FieldOffset(0x02CC)] public float NetProxyShrinkHalfHeight;
    [FieldOffset(0x02D0)] public float NetworkMaxSmoothUpdateDistance;
    [FieldOffset(0x02D4)] public float NetworkNoSmoothUpdateDistance;
    [FieldOffset(0x02D8)] public float NetworkMinTimeBetweenClientAckGoodMoves;
    [FieldOffset(0x02DC)] public float NetworkMinTimeBetweenClientAdjustments;
    [FieldOffset(0x02E0)] public float NetworkMinTimeBetweenClientAdjustmentsLargeCorrection;
    [FieldOffset(0x02E4)] public float NetworkLargeClientCorrectionDistance;
    [FieldOffset(0x02E8)] public float LedgeCheckThreshold;
    [FieldOffset(0x02EC)] public float JumpOutOfWaterPitch;
    [FieldOffset(0x02F0)] public FFindFloorResult CurrentFloor;
    [FieldOffset(0x0384)] public EMovementMode DefaultLandMovementMode;
    [FieldOffset(0x0385)] public EMovementMode DefaultWaterMovementMode;
    [FieldOffset(0x0386)] public EMovementMode GroundMovementMode;
    [FieldOffset(0x0387)] public byte bMaintainHorizontalGroundVelocity;
    [FieldOffset(0x0387)] public byte bImpartBaseVelocityX;
    [FieldOffset(0x0387)] public byte bImpartBaseVelocityY;
    [FieldOffset(0x0387)] public byte bImpartBaseVelocityZ;
    [FieldOffset(0x0387)] public byte bImpartBaseAngularVelocity;
    [FieldOffset(0x0387)] public byte bJustTeleported;
    [FieldOffset(0x0387)] public byte bNetworkUpdateReceived;
    [FieldOffset(0x0387)] public byte bNetworkMovementModeChanged;
    [FieldOffset(0x0388)] public byte bIgnoreClientMovementErrorChecksAndCorrection;
    [FieldOffset(0x0388)] public byte bServerAcceptClientAuthoritativePosition;
    [FieldOffset(0x0388)] public byte bNotifyApex;
    [FieldOffset(0x0388)] public byte bCheatFlying;
    [FieldOffset(0x0388)] public byte bWantsToCrouch;
    [FieldOffset(0x0388)] public byte bCrouchMaintainsBaseLocation;
    [FieldOffset(0x0388)] public byte bIgnoreBaseRotation;
    [FieldOffset(0x0388)] public byte bFastAttachedMove;
    [FieldOffset(0x0389)] public byte bAlwaysCheckFloor;
    [FieldOffset(0x0389)] public byte bUseFlatBaseForFloorChecks;
    [FieldOffset(0x0389)] public byte bPerformingJumpOff;
    [FieldOffset(0x0389)] public byte bWantsToLeaveNavWalking;
    [FieldOffset(0x0389)] public byte bUseRVOAvoidance;
    [FieldOffset(0x0389)] public byte bRequestedMoveUseAcceleration;
    [FieldOffset(0x0389)] public byte bWasSimulatingRootMotion;
    [FieldOffset(0x038A)] public byte bAllowPhysicsRotationDuringAnimRootMotion;
    [FieldOffset(0x038A)] public byte bHasRequestedVelocity;
    [FieldOffset(0x038A)] public byte bRequestedMoveWithMaxSpeed;
    [FieldOffset(0x038A)] public byte bWasAvoidanceUpdated;
    [FieldOffset(0x038A)] public byte bProjectNavMeshWalking;
    [FieldOffset(0x038A)] public byte bProjectNavMeshOnBothWorldChannels;
    [FieldOffset(0x039C)] public float AvoidanceConsiderationRadius;
    [FieldOffset(0x03A0)] public FVector RequestedVelocity;
    [FieldOffset(0x03AC)] public int AvoidanceUID;
    [FieldOffset(0x03B0)] public FNavAvoidanceMask AvoidanceGroup;
    [FieldOffset(0x03B4)] public FNavAvoidanceMask GroupsToAvoid;
    [FieldOffset(0x03B8)] public FNavAvoidanceMask GroupsToIgnore;
    [FieldOffset(0x03BC)] public float AvoidanceWeight;
    [FieldOffset(0x03C0)] public FVector PendingLaunchVelocity;
    [FieldOffset(0x0470)] public float NavMeshProjectionInterval;
    [FieldOffset(0x0474)] public float NavMeshProjectionTimer;
    [FieldOffset(0x0478)] public float NavMeshProjectionInterpSpeed;
    [FieldOffset(0x047C)] public float NavMeshProjectionHeightScaleUp;
    [FieldOffset(0x0480)] public float NavMeshProjectionHeightScaleDown;
    [FieldOffset(0x0484)] public float NavWalkingFloorDistTolerance;
    [FieldOffset(0x0488)] public FCharacterMovementComponentPostPhysicsTickFunction PostPhysicsTickFunction;
    [FieldOffset(0x04D0)] public float MinTimeBetweenTimeStampResets;
    [FieldOffset(0x0980)] public FRootMotionSourceGroup CurrentRootMotion;
    [FieldOffset(0x09B8)] public FRootMotionSourceGroup ServerCorrectionRootMotion;
    [FieldOffset(0x0A80)] public FRootMotionMovementParams RootMotionParams;
    [FieldOffset(0x0AC0)] public FVector AnimRootMotionVelocity;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UDynamicSubsystem
{
    [FieldOffset(0x0000)] public USubsystem baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UEngineSubsystem
{
    [FieldOffset(0x0000)] public UDynamicSubsystem baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FComponentReference
{
    [FieldOffset(0x0000)] public AActor* OtherActor;
    [FieldOffset(0x0008)] public FName ComponentProperty;
    [FieldOffset(0x0010)] public FString PathToComponent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct USoundEffectPreset
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct USoundEffectSourcePreset
{
    [FieldOffset(0x0000)] public USoundEffectPreset baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct USoundEffectSubmixPreset
{
    [FieldOffset(0x0000)] public USoundEffectPreset baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x470)] 
public unsafe struct UShapeComponent
{
    [FieldOffset(0x0000)] public UPrimitiveComponent baseObj;
    [FieldOffset(0x0450)] public UBodySetup* ShapeBodySetup;
    [FieldOffset(0x0458)] public TSubclassOf<UNavAreaBase> AreaClass;
    [FieldOffset(0x0460)] public FColor ShapeColor;
    [FieldOffset(0x0464)] public byte bDrawOnlyIfSelected;
    [FieldOffset(0x0464)] public byte bShouldCollideWhenPlacing;
    [FieldOffset(0x0464)] public byte bDynamicObstacle;
}

[StructLayout(LayoutKind.Explicit, Size = 0x480)] 
public unsafe struct UBoxComponent
{
    [FieldOffset(0x0000)] public UShapeComponent baseObj;
    [FieldOffset(0x0468)] public FVector BoxExtent;
    [FieldOffset(0x0474)] public float LineThickness;
}

[StructLayout(LayoutKind.Explicit, Size = 0x470)] 
public unsafe struct USphereComponent
{
    [FieldOffset(0x0000)] public UShapeComponent baseObj;
    [FieldOffset(0x0468)] public float SphereRadius;
}

[StructLayout(LayoutKind.Explicit, Size = 0x258)] 
public unsafe struct ATriggerVolume
{
    [FieldOffset(0x0000)] public AVolume baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct UCheatManager
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public ADebugCameraController* DebugCameraControllerRef;
    [FieldOffset(0x0030)] public TSubclassOf<ADebugCameraController> DebugCameraControllerClass;
    [FieldOffset(0x0078)] public TArray<IntPtr> CheatManagerExtensions;
}

[StructLayout(LayoutKind.Explicit, Size = 0x230)] 
public unsafe struct ASceneCapture
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public UStaticMeshComponent* MeshComp;
    [FieldOffset(0x0228)] public USceneComponent* SceneComponent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x238)] 
public unsafe struct ASceneCapture2D
{
    [FieldOffset(0x0000)] public ASceneCapture baseObj;
    [FieldOffset(0x0230)] public USceneCaptureComponent2D* CaptureComponent2D;
}

[StructLayout(LayoutKind.Explicit, Size = 0x7B0)] 
public unsafe struct ACameraActor
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public EAutoReceiveInput AutoActivateForPlayer;
    [FieldOffset(0x0228)] public UCameraComponent* CameraComponent;
    [FieldOffset(0x0230)] public USceneComponent* SceneComponent;
    [FieldOffset(0x0240)] public byte bConstrainAspectRatio;
    [FieldOffset(0x0244)] public float AspectRatio;
    [FieldOffset(0x0248)] public float FOVAngle;
    [FieldOffset(0x024C)] public float PostProcessBlendWeight;
    [FieldOffset(0x0250)] public FPostProcessSettings PostProcessSettings;
}

[StructLayout(LayoutKind.Explicit, Size = 0x248)] 
public unsafe struct ANavigationObjectBase
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0228)] public UCapsuleComponent* CapsuleComponent;
    [FieldOffset(0x0230)] public UBillboardComponent* GoodSprite;
    [FieldOffset(0x0238)] public UBillboardComponent* BadSprite;
    [FieldOffset(0x0240)] public byte bIsPIEPlayerStart;
}

[StructLayout(LayoutKind.Explicit, Size = 0x250)] 
public unsafe struct APlayerStart
{
    [FieldOffset(0x0000)] public ANavigationObjectBase baseObj;
    [FieldOffset(0x0248)] public FName PlayerStartTag;
}

[StructLayout(LayoutKind.Explicit, Size = 0x220)] 
public unsafe struct AInfo
{
    [FieldOffset(0x0000)] public AActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C0)] 
public unsafe struct AGameModeBase
{
    [FieldOffset(0x0000)] public AInfo baseObj;
    [FieldOffset(0x0220)] public FString OptionsString;
    [FieldOffset(0x0230)] public TSubclassOf<AGameSession> GameSessionClass;
    [FieldOffset(0x0238)] public TSubclassOf<AGameStateBase> GameStateClass;
    [FieldOffset(0x0240)] public TSubclassOf<APlayerController> PlayerControllerClass;
    [FieldOffset(0x0248)] public TSubclassOf<APlayerState> PlayerStateClass;
    [FieldOffset(0x0250)] public TSubclassOf<AHUD> HUDClass;
    [FieldOffset(0x0258)] public TSubclassOf<APawn> DefaultPawnClass;
    [FieldOffset(0x0260)] public TSubclassOf<ASpectatorPawn> SpectatorClass;
    [FieldOffset(0x0268)] public TSubclassOf<APlayerController> ReplaySpectatorPlayerControllerClass;
    [FieldOffset(0x0270)] public TSubclassOf<AServerStatReplicator> ServerStatReplicatorClass;
    [FieldOffset(0x0278)] public AGameSession* GameSession;
    [FieldOffset(0x0280)] public AGameStateBase* GameState;
    [FieldOffset(0x0288)] public AServerStatReplicator* ServerStatReplicator;
    [FieldOffset(0x0290)] public FText DefaultPlayerName;
    [FieldOffset(0x02A8)] public byte bUseSeamlessTravel;
    [FieldOffset(0x02A8)] public byte bStartPlayersAsSpectators;
    [FieldOffset(0x02A8)] public byte bPauseable;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FNameCurveKey
{
    [FieldOffset(0x0000)] public float Time;
    [FieldOffset(0x0004)] public FName Value;
}

[StructLayout(LayoutKind.Explicit, Size = 0x78)] 
public unsafe struct FNameCurve
{
    [FieldOffset(0x0000)] public FIndexedCurve baseObj;
    [FieldOffset(0x0068)] public TArray<FNameCurveKey> Keys;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct FDebugTextInfo
{
    [FieldOffset(0x0000)] public AActor* SrcActor;
    [FieldOffset(0x0008)] public FVector SrcActorOffset;
    [FieldOffset(0x0014)] public FVector SrcActorDesiredOffset;
    [FieldOffset(0x0020)] public FString DebugText;
    [FieldOffset(0x0030)] public float TimeRemaining;
    [FieldOffset(0x0034)] public float Duration;
    [FieldOffset(0x0038)] public FColor TextColor;
    [FieldOffset(0x003C)] public byte bAbsoluteLocation;
    [FieldOffset(0x003C)] public byte bKeepAttachedToActor;
    [FieldOffset(0x003C)] public byte bDrawShadow;
    [FieldOffset(0x0040)] public FVector OrigActorLocation;
    [FieldOffset(0x0050)] public UFont* Font;
    [FieldOffset(0x0058)] public float FontScale;
}

[StructLayout(LayoutKind.Explicit, Size = 0x310)] 
public unsafe struct AHUD
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public APlayerController* PlayerOwner;
    [FieldOffset(0x0228)] public byte bLostFocusPaused;
    [FieldOffset(0x0228)] public byte bShowHUD;
    [FieldOffset(0x0228)] public byte bShowDebugInfo;
    [FieldOffset(0x022C)] public int CurrentTargetIndex;
    [FieldOffset(0x0230)] public byte bShowHitBoxDebugInfo;
    [FieldOffset(0x0230)] public byte bShowOverlays;
    [FieldOffset(0x0230)] public byte bEnableDebugTextShadow;
    [FieldOffset(0x0238)] public TArray<IntPtr> PostRenderedActors;
    [FieldOffset(0x0250)] public TArray<FName> DebugDisplay;
    [FieldOffset(0x0260)] public TArray<FName> ToggledDebugCategories;
    [FieldOffset(0x0270)] public UCanvas* Canvas;
    [FieldOffset(0x0278)] public UCanvas* DebugCanvas;
    [FieldOffset(0x0280)] public TArray<FDebugTextInfo> DebugTextList;
    [FieldOffset(0x0290)] public TSubclassOf<AActor> ShowDebugTargetDesiredClass;
    [FieldOffset(0x0298)] public AActor* ShowDebugTargetActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FCollectionParameterBase
{
    [FieldOffset(0x0000)] public FName ParameterName;
    [FieldOffset(0x0008)] public FGuid ID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C)] 
public unsafe struct FCollectionScalarParameter
{
    [FieldOffset(0x0000)] public FCollectionParameterBase baseObj;
    [FieldOffset(0x0018)] public float DefaultValue;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FCollectionVectorParameter
{
    [FieldOffset(0x0000)] public FCollectionParameterBase baseObj;
    [FieldOffset(0x0018)] public FLinearColor DefaultValue;
}

[StructLayout(LayoutKind.Explicit, Size = 0x478)] 
public unsafe struct UAssetManager
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x02E0)] public TArray<IntPtr> ObjectReferenceList;
    [FieldOffset(0x02F0)] public bool bIsGlobalAsyncScanEnvironment;
    [FieldOffset(0x02F1)] public bool bShouldGuessTypeAndName;
    [FieldOffset(0x02F2)] public bool bShouldUseSynchronousLoad;
    [FieldOffset(0x02F3)] public bool bIsLoadingFromPakFiles;
    [FieldOffset(0x02F4)] public bool bShouldAcquireMissingChunksOnLoad;
    [FieldOffset(0x02F5)] public bool bOnlyCookProductionAssets;
    [FieldOffset(0x02F6)] public bool bIsBulkScanning;
    [FieldOffset(0x02F7)] public bool bIsPrimaryAssetDirectoryCurrent;
    [FieldOffset(0x02F8)] public bool bIsManagementDatabaseCurrent;
    [FieldOffset(0x02F9)] public bool bUpdateManagementDatabaseAfterScan;
    [FieldOffset(0x02FA)] public bool bIncludeOnlyOnDiskAssets;
    [FieldOffset(0x02FB)] public bool bHasCompletedInitialScan;
    [FieldOffset(0x02FC)] public int NumberOfSpawnedNotifications;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UPrimaryDataAsset
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FPrimaryAssetRules
{
    [FieldOffset(0x0000)] public int Priority;
    [FieldOffset(0x0004)] public int ChunkId;
    [FieldOffset(0x0008)] public bool bApplyRecursively;
    [FieldOffset(0x0009)] public EPrimaryAssetCookRule CookRule;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FCollectionReference
{
    [FieldOffset(0x0000)] public FName CollectionName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct UPrimaryAssetLabel
{
    [FieldOffset(0x0000)] public UPrimaryDataAsset baseObj;
    [FieldOffset(0x0030)] public FPrimaryAssetRules Rules;
    [FieldOffset(0x003C)] public byte bLabelAssetsInMyDirectory;
    [FieldOffset(0x003C)] public byte bIsRuntimeLabel;
    [FieldOffset(0x0040)] public TArray<TSoftObjectPtr<UObject>> ExplicitAssets;
    [FieldOffset(0x0050)] public TArray<TSoftClassPtr<UObject>> ExplicitBlueprints;
    [FieldOffset(0x0060)] public FCollectionReference AssetCollection;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct USaveGame
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x308)] 
public unsafe struct AGameMode
{
    [FieldOffset(0x0000)] public AGameModeBase baseObj;
    [FieldOffset(0x02C0)] public FName MatchState;
    [FieldOffset(0x02C8)] public byte bDelayedStart;
    [FieldOffset(0x02CC)] public int NumSpectators;
    [FieldOffset(0x02D0)] public int NumPlayers;
    [FieldOffset(0x02D4)] public int NumBots;
    [FieldOffset(0x02D8)] public float MinRespawnDelay;
    [FieldOffset(0x02DC)] public int NumTravellingPlayers;
    [FieldOffset(0x02E0)] public TSubclassOf<ULocalMessage> EngineMessageClass;
    [FieldOffset(0x02E8)] public TArray<IntPtr> InactivePlayerArray;
    [FieldOffset(0x02F8)] public float InactivePlayerStateLifeSpan;
    [FieldOffset(0x02FC)] public int MaxInactivePlayers;
    [FieldOffset(0x0300)] public bool bHandleDedicatedServerReplays;
}

[StructLayout(LayoutKind.Explicit, Size = 0x270)] 
public unsafe struct AGameStateBase
{
    [FieldOffset(0x0000)] public AInfo baseObj;
    [FieldOffset(0x0220)] public TSubclassOf<AGameModeBase> GameModeClass;
    [FieldOffset(0x0228)] public AGameModeBase* AuthorityGameMode;
    [FieldOffset(0x0230)] public TSubclassOf<ASpectatorPawn> SpectatorClass;
    [FieldOffset(0x0238)] public TArray<IntPtr> PlayerArray;
    [FieldOffset(0x0248)] public bool bReplicatedHasBegunPlay;
    [FieldOffset(0x024C)] public float ReplicatedWorldTimeSeconds;
    [FieldOffset(0x0250)] public float ServerWorldTimeSecondsDelta;
    [FieldOffset(0x0254)] public float ServerWorldTimeSecondsUpdateFrequency;
}

[StructLayout(LayoutKind.Explicit, Size = 0x290)] 
public unsafe struct AGameState
{
    [FieldOffset(0x0000)] public AGameStateBase baseObj;
    [FieldOffset(0x0270)] public FName MatchState;
    [FieldOffset(0x0278)] public FName PreviousMatchState;
    [FieldOffset(0x0280)] public int ElapsedTime;
}

[StructLayout(LayoutKind.Explicit, Size = 0x230)] 
public unsafe struct ASkyLight
{
    [FieldOffset(0x0000)] public AInfo baseObj;
    [FieldOffset(0x0220)] public USkyLightComponent* LightComponent;
    [FieldOffset(0x0228)] public byte bEnabled;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1D0)] 
public unsafe struct UTextureCube
{
    [FieldOffset(0x0000)] public UTexture baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x90)] 
public unsafe struct FStaticMeshComponentLODInfo
{
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FStreamingTextureBuildInfo
{
    [FieldOffset(0x0000)] public uint PackedRelativeBox;
    [FieldOffset(0x0004)] public int TextureLevelIndex;
    [FieldOffset(0x0008)] public float TexelFactor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FLightmassPrimitiveSettings
{
    [FieldOffset(0x0000)] public byte bUseTwoSidedLighting;
    [FieldOffset(0x0000)] public byte bShadowIndirectOnly;
    [FieldOffset(0x0000)] public byte bUseEmissiveForStaticLighting;
    [FieldOffset(0x0000)] public byte bUseVertexNormalForHemisphereGather;
    [FieldOffset(0x0004)] public float EmissiveLightFalloffExponent;
    [FieldOffset(0x0008)] public float EmissiveLightExplicitInfluenceRadius;
    [FieldOffset(0x000C)] public float EmissiveBoost;
    [FieldOffset(0x0010)] public float DiffuseBoost;
    [FieldOffset(0x0014)] public float FullyOccludedSamplesFraction;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4E0)] 
public unsafe struct UStaticMeshComponent
{
    [FieldOffset(0x0000)] public UMeshComponent baseObj;
    [FieldOffset(0x0478)] public int ForcedLodModel;
    [FieldOffset(0x047C)] public int PreviousLODLevel;
    [FieldOffset(0x0480)] public int MinLOD;
    [FieldOffset(0x0484)] public int SubDivisionStepSize;
    [FieldOffset(0x0488)] public UStaticMesh* StaticMesh;
    [FieldOffset(0x0490)] public FColor WireframeColorOverride;
    [FieldOffset(0x0494)] public byte bEvaluateWorldPositionOffset;
    [FieldOffset(0x0494)] public byte bOverrideWireframeColor;
    [FieldOffset(0x0494)] public byte bOverrideMinLOD;
    [FieldOffset(0x0494)] public byte bOverrideNavigationExport;
    [FieldOffset(0x0494)] public byte bForceNavigationObstacle;
    [FieldOffset(0x0494)] public byte bDisallowMeshPaintPerInstance;
    [FieldOffset(0x0494)] public byte bIgnoreInstanceForTextureStreaming;
    [FieldOffset(0x0494)] public byte bOverrideLightMapRes;
    [FieldOffset(0x0495)] public byte bCastDistanceFieldIndirectShadow;
    [FieldOffset(0x0495)] public byte bOverrideDistanceFieldSelfShadowBias;
    [FieldOffset(0x0495)] public byte bUseSubDivisions;
    [FieldOffset(0x0495)] public byte bUseDefaultCollision;
    [FieldOffset(0x0495)] public byte bReverseCulling;
    [FieldOffset(0x0498)] public int OverriddenLightMapRes;
    [FieldOffset(0x049C)] public float DistanceFieldIndirectShadowMinVisibility;
    [FieldOffset(0x04A0)] public float DistanceFieldSelfShadowBias;
    [FieldOffset(0x04A4)] public float StreamingDistanceMultiplier;
    [FieldOffset(0x04A8)] public TArray<FStaticMeshComponentLODInfo> LODData;
    [FieldOffset(0x04B8)] public TArray<FStreamingTextureBuildInfo> StreamingTextureData;
    [FieldOffset(0x04C8)] public FLightmassPrimitiveSettings LightmassSettings;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct FInstancedStaticMeshInstanceData
{
    [FieldOffset(0x0000)] public FMatrix Transform;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FInstancedStaticMeshMappingInfo
{
}

[StructLayout(LayoutKind.Explicit, Size = 0x590)] 
public unsafe struct UInstancedStaticMeshComponent
{
    [FieldOffset(0x0000)] public UStaticMeshComponent baseObj;
    [FieldOffset(0x04E0)] public TArray<FInstancedStaticMeshInstanceData> PerInstanceSMData;
    [FieldOffset(0x04F0)] public int NumCustomDataFloats;
    [FieldOffset(0x04F8)] public TArray<float> PerInstanceSMCustomData;
    [FieldOffset(0x0508)] public int InstancingRandomSeed;
    [FieldOffset(0x050C)] public int InstanceStartCullDistance;
    [FieldOffset(0x0510)] public int InstanceEndCullDistance;
    [FieldOffset(0x0518)] public TArray<int> InstanceReorderTable;
    [FieldOffset(0x0570)] public int NumPendingLightmaps;
    [FieldOffset(0x0578)] public TArray<FInstancedStaticMeshMappingInfo> CachedMappings;
}

[StructLayout(LayoutKind.Explicit, Size = 0x680)] 
public unsafe struct UHierarchicalInstancedStaticMeshComponent
{
    [FieldOffset(0x0000)] public UInstancedStaticMeshComponent baseObj;
    [FieldOffset(0x0598)] public TArray<int> SortedInstances;
    [FieldOffset(0x05A8)] public int NumBuiltInstances;
    [FieldOffset(0x05B0)] public FBox BuiltInstanceBounds;
    [FieldOffset(0x05CC)] public FBox UnbuiltInstanceBounds;
    [FieldOffset(0x05E8)] public TArray<FBox> UnbuiltInstanceBoundsList;
    [FieldOffset(0x05F8)] public byte bEnableDensityScaling;
    [FieldOffset(0x0600)] public int OcclusionLayerNumNodes;
    [FieldOffset(0x0604)] public FBoxSphereBounds CacheMeshExtendedBounds;
    [FieldOffset(0x0620)] public bool bDisableCollision;
    [FieldOffset(0x0624)] public int InstanceCountToRender;
}

[StructLayout(LayoutKind.Explicit, Size = 0x230)] 
public unsafe struct AStaticMeshActor
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public UStaticMeshComponent* StaticMeshComponent;
    [FieldOffset(0x0228)] public bool bStaticMeshReplicateMovement;
    [FieldOffset(0x0229)] public ENavDataGatheringMode NavigationGeometryGatheringMode;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FLightmassMaterialInterfaceSettings
{
    [FieldOffset(0x0000)] public float EmissiveBoost;
    [FieldOffset(0x0004)] public float DiffuseBoost;
    [FieldOffset(0x0008)] public float ExportResolutionScale;
    [FieldOffset(0x000C)] public byte bCastShadowAsMasked;
    [FieldOffset(0x000C)] public byte bOverrideCastShadowAsMasked;
    [FieldOffset(0x000C)] public byte bOverrideEmissiveBoost;
    [FieldOffset(0x000C)] public byte bOverrideDiffuseBoost;
    [FieldOffset(0x000C)] public byte bOverrideExportResolutionScale;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FMaterialTextureInfo
{
    [FieldOffset(0x0000)] public float SamplingScale;
    [FieldOffset(0x0004)] public int UVChannelIndex;
    [FieldOffset(0x0008)] public FName TextureName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FMaterialParameterInfo
{
    [FieldOffset(0x0000)] public FName Name;
    [FieldOffset(0x0008)] public EMaterialParameterAssociation Association;
    [FieldOffset(0x000C)] public int Index;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct UMaterialInterface
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0038)] public USubsurfaceProfile* SubsurfaceProfile;
    [FieldOffset(0x0050)] public FLightmassMaterialInterfaceSettings LightmassSettings;
    [FieldOffset(0x0060)] public TArray<FMaterialTextureInfo> TextureStreamingData;
    [FieldOffset(0x0070)] public TArray<IntPtr> AssetUserData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x24)] 
public unsafe struct FScalarParameterValue
{
    [FieldOffset(0x0000)] public FMaterialParameterInfo ParameterInfo;
    [FieldOffset(0x0010)] public float ParameterValue;
    [FieldOffset(0x0014)] public FGuid ExpressionGUID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FVectorParameterValue
{
    [FieldOffset(0x0000)] public FMaterialParameterInfo ParameterInfo;
    [FieldOffset(0x0010)] public FLinearColor ParameterValue;
    [FieldOffset(0x0020)] public FGuid ExpressionGUID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FTextureParameterValue
{
    [FieldOffset(0x0000)] public FMaterialParameterInfo ParameterInfo;
    [FieldOffset(0x0010)] public UTexture* ParameterValue;
    [FieldOffset(0x0018)] public FGuid ExpressionGUID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FRuntimeVirtualTextureParameterValue
{
    [FieldOffset(0x0000)] public FMaterialParameterInfo ParameterInfo;
    [FieldOffset(0x0010)] public URuntimeVirtualTexture* ParameterValue;
    [FieldOffset(0x0018)] public FGuid ExpressionGUID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FFontParameterValue
{
    [FieldOffset(0x0000)] public FMaterialParameterInfo ParameterInfo;
    [FieldOffset(0x0010)] public UFont* FontValue;
    [FieldOffset(0x0018)] public int FontPage;
    [FieldOffset(0x001C)] public FGuid ExpressionGUID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FMaterialInstanceBasePropertyOverrides
{
    [FieldOffset(0x0000)] public byte bOverride_OpacityMaskClipValue;
    [FieldOffset(0x0000)] public byte bOverride_BlendMode;
    [FieldOffset(0x0000)] public byte bOverride_ShadingModel;
    [FieldOffset(0x0000)] public byte bOverride_DitheredLODTransition;
    [FieldOffset(0x0000)] public byte bOverride_CastDynamicShadowAsMasked;
    [FieldOffset(0x0000)] public byte bOverride_TwoSided;
    [FieldOffset(0x0000)] public byte TwoSided;
    [FieldOffset(0x0000)] public byte DitheredLODTransition;
    [FieldOffset(0x0001)] public byte bCastDynamicShadowAsMasked;
    [FieldOffset(0x0002)] public EBlendMode BlendMode;
    [FieldOffset(0x0003)] public EMaterialShadingModel ShadingModel;
    [FieldOffset(0x0004)] public float OpacityMaskClipValue;
}

[StructLayout(LayoutKind.Explicit, Size = 0x24)] 
public unsafe struct FStaticParameterBase
{
    [FieldOffset(0x0000)] public FMaterialParameterInfo ParameterInfo;
    [FieldOffset(0x0010)] public bool bOverride;
    [FieldOffset(0x0014)] public FGuid ExpressionGUID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FStaticSwitchParameter
{
    [FieldOffset(0x0000)] public FStaticParameterBase baseObj;
    [FieldOffset(0x0024)] public bool Value;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FStaticComponentMaskParameter
{
    [FieldOffset(0x0000)] public FStaticParameterBase baseObj;
    [FieldOffset(0x0024)] public bool R;
    [FieldOffset(0x0025)] public bool G;
    [FieldOffset(0x0026)] public bool B;
    [FieldOffset(0x0027)] public bool A;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C)] 
public unsafe struct FStaticTerrainLayerWeightParameter
{
    [FieldOffset(0x0000)] public FStaticParameterBase baseObj;
    [FieldOffset(0x0024)] public int WeightmapIndex;
    [FieldOffset(0x0028)] public bool bWeightBasedBlend;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct FMaterialLayersFunctions
{
    [FieldOffset(0x0000)] public TArray<IntPtr> Layers;
    [FieldOffset(0x0010)] public TArray<IntPtr> Blends;
    [FieldOffset(0x0020)] public TArray<bool> LayerStates;
    [FieldOffset(0x0030)] public FString KeyString;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct FStaticMaterialLayersParameter
{
    [FieldOffset(0x0000)] public FStaticParameterBase baseObj;
    [FieldOffset(0x0028)] public FMaterialLayersFunctions Value;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct FStaticParameterSet
{
    [FieldOffset(0x0000)] public TArray<FStaticSwitchParameter> StaticSwitchParameters;
    [FieldOffset(0x0010)] public TArray<FStaticComponentMaskParameter> StaticComponentMaskParameters;
    [FieldOffset(0x0020)] public TArray<FStaticTerrainLayerWeightParameter> TerrainLayerWeightParameters;
    [FieldOffset(0x0030)] public TArray<FStaticMaterialLayersParameter> MaterialLayersParameters;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FMaterialCachedParameterEntry
{
    [FieldOffset(0x0000)] public TArray<ulong> NameHashes;
    [FieldOffset(0x0010)] public TArray<FMaterialParameterInfo> ParameterInfos;
    [FieldOffset(0x0020)] public TArray<FGuid> ExpressionGuids;
}

[StructLayout(LayoutKind.Explicit, Size = 0x150)] 
public unsafe struct FMaterialCachedParameters
{
    [FieldOffset(0x0000)] public FMaterialCachedParameterEntry RuntimeEntries;
    [FieldOffset(0x00F0)] public TArray<float> ScalarValues;
    [FieldOffset(0x0100)] public TArray<FLinearColor> VectorValues;
    [FieldOffset(0x0110)] public TArray<IntPtr> TextureValues;
    [FieldOffset(0x0120)] public TArray<IntPtr> FontValues;
    [FieldOffset(0x0130)] public TArray<int> FontPageValues;
    [FieldOffset(0x0140)] public TArray<IntPtr> RuntimeVirtualTextureValues;
}

[StructLayout(LayoutKind.Explicit, Size = 0x310)] 
public unsafe struct UMaterialInstance
{
    [FieldOffset(0x0000)] public UMaterialInterface baseObj;
    [FieldOffset(0x0088)] public UPhysicalMaterial* PhysMaterial;
    [FieldOffset(0x0090)] public UPhysicalMaterial* PhysicalMaterialMap;
    [FieldOffset(0x00D0)] public UMaterialInterface* Parent;
    [FieldOffset(0x00D8)] public byte bHasStaticPermutationResource;
    [FieldOffset(0x00D8)] public byte bOverrideSubsurfaceProfile;
    [FieldOffset(0x00E0)] public TArray<FScalarParameterValue> ScalarParameterValues;
    [FieldOffset(0x00F0)] public TArray<FVectorParameterValue> VectorParameterValues;
    [FieldOffset(0x0100)] public TArray<FTextureParameterValue> TextureParameterValues;
    [FieldOffset(0x0110)] public TArray<FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues;
    [FieldOffset(0x0120)] public TArray<FFontParameterValue> FontParameterValues;
    [FieldOffset(0x0130)] public FMaterialInstanceBasePropertyOverrides BasePropertyOverrides;
    [FieldOffset(0x0148)] public FStaticParameterSet StaticParameters;
    [FieldOffset(0x0188)] public FMaterialCachedParameters CachedLayerParameters;
    [FieldOffset(0x02D8)] public TArray<IntPtr> CachedReferencedTextures;
}

[StructLayout(LayoutKind.Explicit, Size = 0x318)] 
public unsafe struct UMaterialInstanceConstant
{
    [FieldOffset(0x0000)] public UMaterialInstance baseObj;
    [FieldOffset(0x0310)] public UPhysicalMaterialMask* PhysMaterialMask;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UWorldSubsystem
{
    [FieldOffset(0x0000)] public USubsystem baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UTickableWorldSubsystem
{
    [FieldOffset(0x0000)] public UWorldSubsystem baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UMaterialExpressionCustomOutput
{
    [FieldOffset(0x0000)] public UMaterialExpression baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UEngineCustomTimeStep
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UTimecodeProvider
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public float FrameDelay;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FBranchingPointNotifyPayload
{
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FIntegralKey
{
    [FieldOffset(0x0000)] public float Time;
    [FieldOffset(0x0004)] public int Value;
}

[StructLayout(LayoutKind.Explicit, Size = 0x80)] 
public unsafe struct FIntegralCurve
{
    [FieldOffset(0x0000)] public FIndexedCurve baseObj;
    [FieldOffset(0x0068)] public TArray<FIntegralKey> Keys;
    [FieldOffset(0x0078)] public int DefaultValue;
    [FieldOffset(0x007C)] public bool bUseDefaultValueBeforeFirstKey;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UDynamicBlueprintBinding
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FBPComponentClassOverride
{
    [FieldOffset(0x0000)] public FName ComponentName;
    [FieldOffset(0x0008)] public UClass* ComponentClass;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FBlueprintComponentChangedPropertyInfo
{
    [FieldOffset(0x0000)] public FName PropertyName;
    [FieldOffset(0x0008)] public int ArrayIndex;
    [FieldOffset(0x0010)] public UStruct* PropertyScope;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct FBlueprintCookedComponentInstancingData
{
    [FieldOffset(0x0000)] public TArray<FBlueprintComponentChangedPropertyInfo> ChangedPropertyList;
    [FieldOffset(0x0021)] public bool bHasValidCookedData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x328)] 
public unsafe struct UBlueprintGeneratedClass
{
    [FieldOffset(0x0000)] public UClass baseObj;
    [FieldOffset(0x0230)] public int NumReplicatedProperties;
    [FieldOffset(0x0234)] public byte bHasNativizedParent;
    [FieldOffset(0x0234)] public byte bHasCookedComponentInstancingData;
    [FieldOffset(0x0238)] public TArray<IntPtr> DynamicBindingObjects;
    [FieldOffset(0x0248)] public TArray<IntPtr> ComponentTemplates;
    [FieldOffset(0x0258)] public TArray<IntPtr> Timelines;
    [FieldOffset(0x0268)] public TArray<FBPComponentClassOverride> ComponentClassOverrides;
    [FieldOffset(0x0278)] public USimpleConstructionScript* SimpleConstructionScript;
    [FieldOffset(0x0280)] public UInheritableComponentHandler* InheritableComponentHandler;
    [FieldOffset(0x0288)] public UStructProperty* UberGraphFramePointerProperty;
    [FieldOffset(0x0298)] public UFunction* UberGraphFunction;
    [FieldOffset(0x02A0)] public TMap<FName, FBlueprintCookedComponentInstancingData> CookedComponentInstancingData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x7D0)] 
public unsafe struct UCameraComponent
{
    [FieldOffset(0x0000)] public USceneComponent baseObj;
    [FieldOffset(0x01F8)] public float FieldOfView;
    [FieldOffset(0x01FC)] public float OrthoWidth;
    [FieldOffset(0x0200)] public float OrthoNearClipPlane;
    [FieldOffset(0x0204)] public float OrthoFarClipPlane;
    [FieldOffset(0x0208)] public float AspectRatio;
    [FieldOffset(0x020C)] public byte bConstrainAspectRatio;
    [FieldOffset(0x020C)] public byte bUseFieldOfViewForLOD;
    [FieldOffset(0x020C)] public byte bLockToHmd;
    [FieldOffset(0x020C)] public byte bUsePawnControlRotation;
    [FieldOffset(0x020D)] public ECameraProjectionMode ProjectionMode;
    [FieldOffset(0x0240)] public float PostProcessBlendWeight;
    [FieldOffset(0x0270)] public FPostProcessSettings PostProcessSettings;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FSoundSubmixSpectralAnalysisBandSettings
{
    [FieldOffset(0x0000)] public float BandFrequency;
    [FieldOffset(0x0004)] public int AttackTimeMsec;
    [FieldOffset(0x0008)] public int ReleaseTimeMsec;
    [FieldOffset(0x000C)] public float QFactor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FSourceEffectChainEntry
{
    [FieldOffset(0x0000)] public USoundEffectSourcePreset* Preset;
    [FieldOffset(0x0008)] public byte bBypass;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FQuartzTransportTimeStamp
{
    [FieldOffset(0x0000)] public int Bars;
    [FieldOffset(0x0004)] public int Beat;
    [FieldOffset(0x0008)] public float BeatFraction;
    [FieldOffset(0x000C)] public float Seconds;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FQuartzPulseOverrideStep
{
    [FieldOffset(0x0000)] public int NumberOfPulses;
    [FieldOffset(0x0004)] public EQuartzCommandQuantization PulseDuration;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FQuartzTimeSignature
{
    [FieldOffset(0x0000)] public int NumBeats;
    [FieldOffset(0x0004)] public EQuartzTimeSignatureQuantization BeatType;
    [FieldOffset(0x0008)] public TArray<FQuartzPulseOverrideStep> OptionalPulseOverride;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FQuartzClockSettings
{
    [FieldOffset(0x0000)] public FQuartzTimeSignature TimeSignature;
    [FieldOffset(0x0018)] public bool bIgnoreLevelChange;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UBlueprintCore
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UClass* SkeletonGeneratedClass;
    [FieldOffset(0x0030)] public UClass* GeneratedClass;
    [FieldOffset(0x0038)] public bool bLegacyNeedToPurgeSkelRefs;
    [FieldOffset(0x003C)] public FGuid BlueprintGuid;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA0)] 
public unsafe struct UBlueprint
{
    [FieldOffset(0x0000)] public UBlueprintCore baseObj;
    [FieldOffset(0x0050)] public UClass* ParentClass;
    [FieldOffset(0x0058)] public EBlueprintType BlueprintType;
    [FieldOffset(0x0059)] public byte bRecompileOnLoad;
    [FieldOffset(0x0059)] public byte bHasBeenRegenerated;
    [FieldOffset(0x0059)] public byte bIsRegeneratingOnLoad;
    [FieldOffset(0x005C)] public int BlueprintSystemVersion;
    [FieldOffset(0x0060)] public USimpleConstructionScript* SimpleConstructionScript;
    [FieldOffset(0x0068)] public TArray<IntPtr> ComponentTemplates;
    [FieldOffset(0x0078)] public TArray<IntPtr> Timelines;
    [FieldOffset(0x0088)] public TArray<FBPComponentClassOverride> ComponentClassOverrides;
    [FieldOffset(0x0098)] public UInheritableComponentHandler* InheritableComponentHandler;
}

[StructLayout(LayoutKind.Explicit, Size = 0x258)] 
public unsafe struct UModel
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct UChannel
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UNetConnection* Connection;
}

[StructLayout(LayoutKind.Explicit, Size = 0x290)] 
public unsafe struct UActorChannel
{
    [FieldOffset(0x0000)] public UChannel baseObj;
    [FieldOffset(0x0068)] public AActor* Actor;
    [FieldOffset(0x0158)] public TArray<IntPtr> CreateSubObjects;
}

[StructLayout(LayoutKind.Explicit, Size = 0x80)] 
public unsafe struct UAnimationAsset
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0038)] public USkeleton* Skeleton;
    [FieldOffset(0x0060)] public TArray<IntPtr> MetaData;
    [FieldOffset(0x0070)] public TArray<IntPtr> AssetUserData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FInterpolationParameter
{
    [FieldOffset(0x0000)] public float InterpolationTime;
    [FieldOffset(0x0004)] public EFilterInterpolationType InterpolationType;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FPerBoneInterpolation
{
    [FieldOffset(0x0000)] public FBoneReference BoneReference;
    [FieldOffset(0x0010)] public float InterpolationSpeedPerSec;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FBlendSample
{
    [FieldOffset(0x0000)] public UAnimSequence* Animation;
    [FieldOffset(0x0008)] public FVector SampleValue;
    [FieldOffset(0x0014)] public float RateScale;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FEditorElement
{
    [FieldOffset(0x0000)] public int Indices;
    [FieldOffset(0x000C)] public float Weights;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FBlendParameter
{
    [FieldOffset(0x0000)] public FString DisplayName;
    [FieldOffset(0x0010)] public float Min;
    [FieldOffset(0x0014)] public float Max;
    [FieldOffset(0x0018)] public int GridNum;
}

[StructLayout(LayoutKind.Explicit, Size = 0x148)] 
public unsafe struct UBlendSpaceBase
{
    [FieldOffset(0x0000)] public UAnimationAsset baseObj;
    [FieldOffset(0x0088)] public bool bRotationBlendInMeshSpace;
    [FieldOffset(0x008C)] public float AnimLength;
    [FieldOffset(0x0090)] public FInterpolationParameter InterpolationParam;
    [FieldOffset(0x00A8)] public float TargetWeightInterpolationSpeedPerSec;
    [FieldOffset(0x00AC)] public ENotifyTriggerMode NotifyTriggerMode;
    [FieldOffset(0x00B0)] public TArray<FPerBoneInterpolation> PerBoneBlend;
    [FieldOffset(0x00C0)] public int SampleIndexWithMarkers;
    [FieldOffset(0x00C8)] public TArray<FBlendSample> SampleData;
    [FieldOffset(0x00D8)] public TArray<FEditorElement> GridSamples;
    [FieldOffset(0x00E8)] public FBlendParameter BlendParameters;
}

[StructLayout(LayoutKind.Explicit, Size = 0x150)] 
public unsafe struct UBlendSpace
{
    [FieldOffset(0x0000)] public UBlendSpaceBase baseObj;
    [FieldOffset(0x0148)] public EBlendSpaceAxis AxisToScaleAnimation;
}

[StructLayout(LayoutKind.Explicit, Size = 0x150)] 
public unsafe struct UAimOffsetBlendSpace
{
    [FieldOffset(0x0000)] public UBlendSpace baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x150)] 
public unsafe struct UBlendSpace1D
{
    [FieldOffset(0x0000)] public UBlendSpaceBase baseObj;
    [FieldOffset(0x0148)] public bool bScaleAnimation;
}

[StructLayout(LayoutKind.Explicit, Size = 0x150)] 
public unsafe struct UAimOffsetBlendSpace1D
{
    [FieldOffset(0x0000)] public UBlendSpace1D baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UAISystemBase
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public FSoftClassPath AISystemClassName;
    [FieldOffset(0x0040)] public FName AISystemModuleName;
    [FieldOffset(0x0050)] public bool bInstantiateAISystemOnClient;
}

[StructLayout(LayoutKind.Explicit, Size = 0x228)] 
public unsafe struct AAmbientSound
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public UAudioComponent* AudioComponent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FCustomAttributeSetting
{
    [FieldOffset(0x0000)] public FString Name;
    [FieldOffset(0x0010)] public FString Meaning;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD0)] 
public unsafe struct UAnimationSettings
{
    [FieldOffset(0x0000)] public UDeveloperSettings baseObj;
    [FieldOffset(0x0038)] public int CompressCommandletVersion;
    [FieldOffset(0x0040)] public TArray<FString> KeyEndEffectorsMatchNameArray;
    [FieldOffset(0x0050)] public bool ForceRecompression;
    [FieldOffset(0x0051)] public bool bForceBelowThreshold;
    [FieldOffset(0x0052)] public bool bFirstRecompressUsingCurrentOrDefault;
    [FieldOffset(0x0053)] public bool bRaiseMaxErrorToExisting;
    [FieldOffset(0x0054)] public bool bEnablePerformanceLog;
    [FieldOffset(0x0055)] public bool bStripAnimationDataOnDedicatedServer;
    [FieldOffset(0x0056)] public bool bTickAnimationOnSkeletalMeshInit;
    [FieldOffset(0x0058)] public TArray<FCustomAttributeSetting> BoneCustomAttributesNames;
    [FieldOffset(0x0068)] public TArray<FString> BoneNamesWithCustomAttributes;
    [FieldOffset(0x0078)] public TMap<FName, ECustomAttributeBlendType> AttributeBlendModes;
    [FieldOffset(0x00C8)] public ECustomAttributeBlendType DefaultAttributeBlendMode;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FAnimGroupInfo
{
    [FieldOffset(0x0000)] public FName Name;
    [FieldOffset(0x0008)] public FLinearColor Color;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC8)] 
public unsafe struct UAnimBlueprint
{
    [FieldOffset(0x0000)] public UBlueprint baseObj;
    [FieldOffset(0x00A8)] public USkeleton* TargetSkeleton;
    [FieldOffset(0x00B0)] public TArray<FAnimGroupInfo> Groups;
    [FieldOffset(0x00C0)] public bool bUseMultiThreadedAnimationUpdate;
    [FieldOffset(0x00C1)] public bool bWarnAboutBlueprintUsage;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FBakedStateExitTransition
{
    [FieldOffset(0x0000)] public int CanTakeDelegateIndex;
    [FieldOffset(0x0004)] public int CustomResultNodeIndex;
    [FieldOffset(0x0008)] public int TransitionIndex;
    [FieldOffset(0x000C)] public bool bDesiredTransitionReturnValue;
    [FieldOffset(0x000D)] public bool bAutomaticRemainingTimeRule;
    [FieldOffset(0x0010)] public TArray<int> PoseEvaluatorLinks;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct FBakedAnimationState
{
    [FieldOffset(0x0000)] public FName StateName;
    [FieldOffset(0x0008)] public TArray<FBakedStateExitTransition> Transitions;
    [FieldOffset(0x0018)] public int StateRootNodeIndex;
    [FieldOffset(0x001C)] public int StartNotify;
    [FieldOffset(0x0020)] public int EndNotify;
    [FieldOffset(0x0024)] public int FullyBlendedNotify;
    [FieldOffset(0x0028)] public bool bIsAConduit;
    [FieldOffset(0x002C)] public int EntryRuleNodeIndex;
    [FieldOffset(0x0030)] public TArray<int> PlayerNodeIndices;
    [FieldOffset(0x0040)] public TArray<int> LayerNodeIndices;
    [FieldOffset(0x0050)] public bool bAlwaysResetOnEntry;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FAnimationStateBase
{
    [FieldOffset(0x0000)] public FName StateName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct FAnimationTransitionBetweenStates
{
    [FieldOffset(0x0000)] public FAnimationStateBase baseObj;
    [FieldOffset(0x0008)] public int PreviousState;
    [FieldOffset(0x000C)] public int NextState;
    [FieldOffset(0x0010)] public float CrossfadeDuration;
    [FieldOffset(0x0014)] public int StartNotify;
    [FieldOffset(0x0018)] public int EndNotify;
    [FieldOffset(0x001C)] public int InterruptNotify;
    [FieldOffset(0x0020)] public EAlphaBlendOption BlendMode;
    [FieldOffset(0x0028)] public UCurveFloat* CustomCurve;
    [FieldOffset(0x0030)] public UBlendProfile* BlendProfile;
    [FieldOffset(0x0038)] public ETransitionLogicType LogicType;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FBakedAnimationStateMachine
{
    [FieldOffset(0x0000)] public FName MachineName;
    [FieldOffset(0x0008)] public int InitialState;
    [FieldOffset(0x0010)] public TArray<FBakedAnimationState> States;
    [FieldOffset(0x0020)] public TArray<FAnimationTransitionBetweenStates> Transitions;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FCachedPoseIndices
{
    [FieldOffset(0x0000)] public TArray<int> OrderedSavedPoseNodeIndices;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FExposedValueCopyRecord
{
    [FieldOffset(0x0000)] public int CopyIndex;
    [FieldOffset(0x0004)] public EPostCopyOperation PostCopyOperation;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct FExposedValueHandler
{
    [FieldOffset(0x0000)] public FName BoundFunction;
    [FieldOffset(0x0008)] public TArray<FExposedValueCopyRecord> CopyRecords;
    [FieldOffset(0x0018)] public UFunction* Function;
    [FieldOffset(0x0020)] public TFieldPath<FStructProperty> ValueHandlerNodeProperty;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FGraphAssetPlayerInformation
{
    [FieldOffset(0x0000)] public TArray<int> PlayerNodeIndices;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FAnimGraphBlendOptions
{
    [FieldOffset(0x0000)] public float BlendInTime;
    [FieldOffset(0x0004)] public float BlendOutTime;
}

[StructLayout(LayoutKind.Explicit, Size = 0x5B0)] 
public unsafe struct UAnimBlueprintGeneratedClass
{
    [FieldOffset(0x0000)] public UBlueprintGeneratedClass baseObj;
    [FieldOffset(0x0330)] public TArray<FBakedAnimationStateMachine> BakedStateMachines;
    [FieldOffset(0x0340)] public USkeleton* TargetSkeleton;
    [FieldOffset(0x0348)] public TArray<FAnimNotifyEvent> AnimNotifies;
    [FieldOffset(0x0358)] public TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap;
    [FieldOffset(0x0428)] public TArray<FName> SyncGroupNames;
    [FieldOffset(0x0438)] public TArray<FExposedValueHandler> EvaluateGraphExposedInputs;
    [FieldOffset(0x0448)] public TMap<FName, FGraphAssetPlayerInformation> GraphAssetPlayerInformation;
    [FieldOffset(0x0498)] public TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions;
    [FieldOffset(0x04E8)] public FPropertyAccessLibrary PropertyAccessLibrary;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UAnimBoneCompressionCodec
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public FString Description;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UAnimBoneCompressionSettings
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TArray<IntPtr> Codecs;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct FAnimBlueprintFunction
{
    [FieldOffset(0x0000)] public FName Name;
    [FieldOffset(0x0008)] public FName Group;
    [FieldOffset(0x0010)] public int OutputPoseNodeIndex;
    [FieldOffset(0x0018)] public TArray<FName> InputPoseNames;
    [FieldOffset(0x0028)] public TArray<int> InputPoseNodeIndices;
    [FieldOffset(0x0060)] public bool bImplemented;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct FAnimBlueprintFunctionData
{
    [FieldOffset(0x0000)] public TFieldPath<FStructProperty> OutputPoseNodeProperty;
    [FieldOffset(0x0020)] public TArray<TFieldPath<FStructProperty>> InputPoseNodeProperties;
    [FieldOffset(0x0030)] public TArray<TFieldPath<FProperty>> InputProperties;
}

[StructLayout(LayoutKind.Explicit, Size = 0x330)] 
public unsafe struct UAnimClassData
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public TArray<FBakedAnimationStateMachine> BakedStateMachines;
    [FieldOffset(0x0040)] public USkeleton* TargetSkeleton;
    [FieldOffset(0x0048)] public TArray<FAnimNotifyEvent> AnimNotifies;
    [FieldOffset(0x0058)] public TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap;
    [FieldOffset(0x00A8)] public TArray<FAnimBlueprintFunction> AnimBlueprintFunctions;
    [FieldOffset(0x00B8)] public TArray<FAnimBlueprintFunctionData> AnimBlueprintFunctionData;
    [FieldOffset(0x00C8)] public TArray<TFieldPath<FStructProperty>> AnimNodeProperties;
    [FieldOffset(0x00E8)] public TArray<TFieldPath<FStructProperty>> LinkedAnimGraphNodeProperties;
    [FieldOffset(0x0108)] public TArray<TFieldPath<FStructProperty>> LinkedAnimLayerNodeProperties;
    [FieldOffset(0x0128)] public TArray<TFieldPath<FStructProperty>> PreUpdateNodeProperties;
    [FieldOffset(0x0148)] public TArray<TFieldPath<FStructProperty>> DynamicResetNodeProperties;
    [FieldOffset(0x0168)] public TArray<TFieldPath<FStructProperty>> StateMachineNodeProperties;
    [FieldOffset(0x0188)] public TArray<TFieldPath<FStructProperty>> InitializationNodeProperties;
    [FieldOffset(0x01A8)] public TMap<FName, FGraphAssetPlayerInformation> GraphNameAssetPlayers;
    [FieldOffset(0x01F8)] public TArray<FName> SyncGroupNames;
    [FieldOffset(0x0208)] public TArray<FExposedValueHandler> EvaluateGraphExposedInputs;
    [FieldOffset(0x0218)] public TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions;
    [FieldOffset(0x0268)] public FPropertyAccessLibrary PropertyAccessLibrary;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IAnimClassInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FSmartName
{
    [FieldOffset(0x0000)] public FName DisplayName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FAnimCurveBase
{
    [FieldOffset(0x0000)] public FName LastObservedName;
    [FieldOffset(0x0008)] public FSmartName Name;
    [FieldOffset(0x0014)] public int CurveTypeFlags;
}

[StructLayout(LayoutKind.Explicit, Size = 0x98)] 
public unsafe struct FFloatCurve
{
    [FieldOffset(0x0000)] public FAnimCurveBase baseObj;
    [FieldOffset(0x0018)] public FRichCurve FloatCurve;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FRawCurveTracks
{
    [FieldOffset(0x0000)] public TArray<FFloatCurve> FloatCurves;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA8)] 
public unsafe struct UAnimSequenceBase
{
    [FieldOffset(0x0000)] public UAnimationAsset baseObj;
    [FieldOffset(0x0080)] public TArray<FAnimNotifyEvent> Notifies;
    [FieldOffset(0x0090)] public float SequenceLength;
    [FieldOffset(0x0094)] public float RateScale;
    [FieldOffset(0x0098)] public FRawCurveTracks RawCurveData;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA8)] 
public unsafe struct UAnimCompositeBase
{
    [FieldOffset(0x0000)] public UAnimSequenceBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FAnimSegment
{
    [FieldOffset(0x0000)] public UAnimSequenceBase* AnimReference;
    [FieldOffset(0x0008)] public float StartPos;
    [FieldOffset(0x000C)] public float AnimStartTime;
    [FieldOffset(0x0010)] public float AnimEndTime;
    [FieldOffset(0x0014)] public float AnimPlayRate;
    [FieldOffset(0x0018)] public int LoopingCount;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FAnimTrack
{
    [FieldOffset(0x0000)] public TArray<FAnimSegment> AnimSegments;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB8)] 
public unsafe struct UAnimComposite
{
    [FieldOffset(0x0000)] public UAnimCompositeBase baseObj;
    [FieldOffset(0x00A8)] public FAnimTrack AnimationTrack;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UAnimCompress
{
    [FieldOffset(0x0000)] public UAnimBoneCompressionCodec baseObj;
    [FieldOffset(0x0038)] public byte bNeedsSkeleton;
    [FieldOffset(0x003C)] public AnimationCompressionFormat TranslationCompressionFormat;
    [FieldOffset(0x003D)] public AnimationCompressionFormat RotationCompressionFormat;
    [FieldOffset(0x003E)] public AnimationCompressionFormat ScaleCompressionFormat;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UAnimCompress_BitwiseCompressOnly
{
    [FieldOffset(0x0000)] public UAnimCompress baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UAnimCompress_LeastDestructive
{
    [FieldOffset(0x0000)] public UAnimCompress_BitwiseCompressOnly baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UAnimCompress_RemoveLinearKeys
{
    [FieldOffset(0x0000)] public UAnimCompress baseObj;
    [FieldOffset(0x0040)] public float MaxPosDiff;
    [FieldOffset(0x0044)] public float MaxAngleDiff;
    [FieldOffset(0x0048)] public float MaxScaleDiff;
    [FieldOffset(0x004C)] public float MaxEffectorDiff;
    [FieldOffset(0x0050)] public float MinEffectorDiff;
    [FieldOffset(0x0054)] public float EffectorDiffSocket;
    [FieldOffset(0x0058)] public float ParentKeyScale;
    [FieldOffset(0x005C)] public byte bRetarget;
    [FieldOffset(0x005C)] public byte bActuallyFilterLinearKeys;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD8)] 
public unsafe struct UAnimCompress_PerTrackCompression
{
    [FieldOffset(0x0000)] public UAnimCompress_RemoveLinearKeys baseObj;
    [FieldOffset(0x0060)] public float MaxZeroingThreshold;
    [FieldOffset(0x0064)] public float MaxPosDiffBitwise;
    [FieldOffset(0x0068)] public float MaxAngleDiffBitwise;
    [FieldOffset(0x006C)] public float MaxScaleDiffBitwise;
    [FieldOffset(0x0070)] public TArray<AnimationCompressionFormat> AllowedRotationFormats;
    [FieldOffset(0x0080)] public TArray<AnimationCompressionFormat> AllowedTranslationFormats;
    [FieldOffset(0x0090)] public TArray<AnimationCompressionFormat> AllowedScaleFormats;
    [FieldOffset(0x00A0)] public byte bResampleAnimation;
    [FieldOffset(0x00A4)] public float ResampledFramerate;
    [FieldOffset(0x00A8)] public int MinKeysForResampling;
    [FieldOffset(0x00AC)] public byte bUseAdaptiveError;
    [FieldOffset(0x00AC)] public byte bUseOverrideForEndEffectors;
    [FieldOffset(0x00B0)] public int TrackHeightBias;
    [FieldOffset(0x00B4)] public float ParentingDivisor;
    [FieldOffset(0x00B8)] public float ParentingDivisorExponent;
    [FieldOffset(0x00BC)] public byte bUseAdaptiveError2;
    [FieldOffset(0x00C0)] public float RotationErrorSourceRatio;
    [FieldOffset(0x00C4)] public float TranslationErrorSourceRatio;
    [FieldOffset(0x00C8)] public float ScaleErrorSourceRatio;
    [FieldOffset(0x00CC)] public float MaxErrorPerTrackRatio;
    [FieldOffset(0x00D0)] public float PerturbationProbeSize;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UAnimCompress_RemoveEverySecondKey
{
    [FieldOffset(0x0000)] public UAnimCompress baseObj;
    [FieldOffset(0x0040)] public int MinKeys;
    [FieldOffset(0x0044)] public byte bStartAtSecondKey;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UAnimCompress_RemoveTrivialKeys
{
    [FieldOffset(0x0000)] public UAnimCompress baseObj;
    [FieldOffset(0x0040)] public float MaxPosDiff;
    [FieldOffset(0x0044)] public float MaxAngleDiff;
    [FieldOffset(0x0048)] public float MaxScaleDiff;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UAnimCurveCompressionCodec
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UAnimCurveCompressionCodec_CompressedRichCurve
{
    [FieldOffset(0x0000)] public UAnimCurveCompressionCodec baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UAnimCurveCompressionCodec_UniformIndexable
{
    [FieldOffset(0x0000)] public UAnimCurveCompressionCodec baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UAnimCurveCompressionCodec_UniformlySampled
{
    [FieldOffset(0x0000)] public UAnimCurveCompressionCodec baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UAnimCurveCompressionSettings
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAnimCurveCompressionCodec* Codec;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IAnimLayerInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UAnimMetaData
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FAlphaBlend
{
    [FieldOffset(0x0000)] public UCurveFloat* CustomCurve;
    [FieldOffset(0x0008)] public float BlendTime;
    [FieldOffset(0x0024)] public EAlphaBlendOption BlendOption;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FAnimSyncMarker
{
    [FieldOffset(0x0000)] public FName MarkerName;
    [FieldOffset(0x0008)] public float Time;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FMarkerSyncData
{
    [FieldOffset(0x0000)] public TArray<FAnimSyncMarker> AuthoredSyncMarkers;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct FCompositeSection
{
    [FieldOffset(0x0000)] public FAnimLinkableElement baseObj;
    [FieldOffset(0x0030)] public FName SectionName;
    [FieldOffset(0x0038)] public float StartTime;
    [FieldOffset(0x003C)] public FName NextSectionName;
    [FieldOffset(0x0048)] public TArray<IntPtr> MetaData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FSlotAnimationTrack
{
    [FieldOffset(0x0000)] public FName SlotName;
    [FieldOffset(0x0008)] public FAnimTrack AnimTrack;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct FBranchingPoint
{
    [FieldOffset(0x0000)] public FAnimLinkableElement baseObj;
    [FieldOffset(0x0030)] public FName EventName;
    [FieldOffset(0x0038)] public float DisplayTime;
    [FieldOffset(0x003C)] public float TriggerTimeOffset;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FBranchingPointMarker
{
    [FieldOffset(0x0000)] public int NotifyIndex;
    [FieldOffset(0x0004)] public float TriggerTime;
    [FieldOffset(0x0008)] public EAnimNotifyEventType NotifyEventType;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FTimeStretchCurveMarker
{
    [FieldOffset(0x0000)] public float Time;
    [FieldOffset(0x000C)] public float Alpha;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FTimeStretchCurve
{
    [FieldOffset(0x0000)] public float SamplingRate;
    [FieldOffset(0x0004)] public float CurveValueMinPrecision;
    [FieldOffset(0x0008)] public TArray<FTimeStretchCurveMarker> Markers;
    [FieldOffset(0x0018)] public float Sum_dT_i_by_C_i;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1D0)] 
public unsafe struct UAnimMontage
{
    [FieldOffset(0x0000)] public UAnimCompositeBase baseObj;
    [FieldOffset(0x00A8)] public FAlphaBlend BlendIn;
    [FieldOffset(0x00D8)] public float BlendInTime;
    [FieldOffset(0x00E0)] public FAlphaBlend BlendOut;
    [FieldOffset(0x0110)] public float BlendOutTime;
    [FieldOffset(0x0114)] public float BlendOutTriggerTime;
    [FieldOffset(0x0118)] public FName SyncGroup;
    [FieldOffset(0x0120)] public int SyncSlotIndex;
    [FieldOffset(0x0128)] public FMarkerSyncData MarkerData;
    [FieldOffset(0x0148)] public TArray<FCompositeSection> CompositeSections;
    [FieldOffset(0x0158)] public TArray<FSlotAnimationTrack> SlotAnimTracks;
    [FieldOffset(0x0168)] public TArray<FBranchingPoint> BranchingPoints;
    [FieldOffset(0x0178)] public bool bEnableRootMotionTranslation;
    [FieldOffset(0x0179)] public bool bEnableRootMotionRotation;
    [FieldOffset(0x017A)] public bool bEnableAutoBlendOut;
    [FieldOffset(0x017B)] public ERootMotionRootLock RootMotionRootLock;
    [FieldOffset(0x0180)] public TArray<FBranchingPointMarker> BranchingPointMarkers;
    [FieldOffset(0x0190)] public TArray<int> BranchingPointStateNotifyIndices;
    [FieldOffset(0x01A0)] public FTimeStretchCurve TimeStretchCurve;
    [FieldOffset(0x01C8)] public FName TimeStretchCurveName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UAnimNotify_PauseClothingSimulation
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x90)] 
public unsafe struct UAnimNotify_PlayParticleEffect
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
    [FieldOffset(0x0038)] public UParticleSystem* PSTemplate;
    [FieldOffset(0x0040)] public FVector LocationOffset;
    [FieldOffset(0x004C)] public FRotator RotationOffset;
    [FieldOffset(0x0058)] public FVector Scale;
    [FieldOffset(0x0080)] public byte Attached;
    [FieldOffset(0x0084)] public FName SocketName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UAnimNotify_PlaySound
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
    [FieldOffset(0x0038)] public USoundBase* Sound;
    [FieldOffset(0x0040)] public float VolumeMultiplier;
    [FieldOffset(0x0044)] public float PitchMultiplier;
    [FieldOffset(0x0048)] public byte bFollow;
    [FieldOffset(0x004C)] public FName AttachName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UAnimNotify_ResetClothingSimulation
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UAnimNotify_ResetDynamics
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UAnimNotify_ResumeClothingSimulation
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UAnimNotifyState_DisableRootMotion
{
    [FieldOffset(0x0000)] public UAnimNotifyState baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UAnimNotifyState_TimedParticleEffect
{
    [FieldOffset(0x0000)] public UAnimNotifyState baseObj;
    [FieldOffset(0x0030)] public UParticleSystem* PSTemplate;
    [FieldOffset(0x0038)] public FName SocketName;
    [FieldOffset(0x0040)] public FVector LocationOffset;
    [FieldOffset(0x004C)] public FRotator RotationOffset;
    [FieldOffset(0x0058)] public bool bDestroyAtEnd;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UAnimNotifyState_Trail
{
    [FieldOffset(0x0000)] public UAnimNotifyState baseObj;
    [FieldOffset(0x0030)] public UParticleSystem* PSTemplate;
    [FieldOffset(0x0038)] public FName FirstSocketName;
    [FieldOffset(0x0040)] public FName SecondSocketName;
    [FieldOffset(0x0048)] public ETrailWidthMode WidthScaleMode;
    [FieldOffset(0x004C)] public FName WidthScaleCurve;
    [FieldOffset(0x0054)] public byte bRecycleSpawnedSystems;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FTrackToSkeletonMap
{
    [FieldOffset(0x0000)] public int BoneTreeIndex;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FStringCurveKey
{
    [FieldOffset(0x0000)] public float Time;
    [FieldOffset(0x0008)] public FString Value;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct FStringCurve
{
    [FieldOffset(0x0000)] public FIndexedCurve baseObj;
    [FieldOffset(0x0068)] public FString DefaultValue;
    [FieldOffset(0x0078)] public TArray<FStringCurveKey> Keys;
}

[StructLayout(LayoutKind.Explicit, Size = 0x90)] 
public unsafe struct FBakedStringCustomAttribute
{
    [FieldOffset(0x0000)] public FName AttributeName;
    [FieldOffset(0x0008)] public FStringCurve StringCurve;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct FBakedIntegerCustomAttribute
{
    [FieldOffset(0x0000)] public FName AttributeName;
    [FieldOffset(0x0008)] public FIntegralCurve IntCurve;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FSimpleCurveKey
{
    [FieldOffset(0x0000)] public float Time;
    [FieldOffset(0x0004)] public float Value;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct FSimpleCurve
{
    [FieldOffset(0x0000)] public FRealCurve baseObj;
    [FieldOffset(0x0070)] public ERichCurveInterpMode InterpMode;
    [FieldOffset(0x0078)] public TArray<FSimpleCurveKey> Keys;
}

[StructLayout(LayoutKind.Explicit, Size = 0x90)] 
public unsafe struct FBakedFloatCustomAttribute
{
    [FieldOffset(0x0000)] public FName AttributeName;
    [FieldOffset(0x0008)] public FSimpleCurve FloatCurve;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct FBakedCustomAttributePerBoneData
{
    [FieldOffset(0x0000)] public int BoneTreeIndex;
    [FieldOffset(0x0008)] public TArray<FBakedStringCustomAttribute> StringAttributes;
    [FieldOffset(0x0018)] public TArray<FBakedIntegerCustomAttribute> IntAttributes;
    [FieldOffset(0x0028)] public TArray<FBakedFloatCustomAttribute> FloatAttributes;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C0)] 
public unsafe struct UAnimSequence
{
    [FieldOffset(0x0000)] public UAnimSequenceBase baseObj;
    [FieldOffset(0x00A8)] public int NumFrames;
    [FieldOffset(0x00B0)] public TArray<FTrackToSkeletonMap> TrackToSkeletonMapTable;
    [FieldOffset(0x00D0)] public UAnimBoneCompressionSettings* BoneCompressionSettings;
    [FieldOffset(0x00D8)] public UAnimCurveCompressionSettings* CurveCompressionSettings;
    [FieldOffset(0x0150)] public EAdditiveAnimationType AdditiveAnimType;
    [FieldOffset(0x0151)] public EAdditiveBasePoseType RefPoseType;
    [FieldOffset(0x0158)] public UAnimSequence* RefPoseSeq;
    [FieldOffset(0x0160)] public int RefFrameIndex;
    [FieldOffset(0x0164)] public FName RetargetSource;
    [FieldOffset(0x0170)] public TArray<FTransform> RetargetSourceAssetReferencePose;
    [FieldOffset(0x0180)] public EAnimInterpolationType Interpolation;
    [FieldOffset(0x0181)] public bool bEnableRootMotion;
    [FieldOffset(0x0182)] public ERootMotionRootLock RootMotionRootLock;
    [FieldOffset(0x0183)] public bool bForceRootLock;
    [FieldOffset(0x0184)] public bool bUseNormalizedRootMotionScale;
    [FieldOffset(0x0185)] public bool bRootMotionSettingsCopiedFromMontage;
    [FieldOffset(0x0188)] public TArray<FAnimSyncMarker> AuthoredSyncMarkers;
    [FieldOffset(0x01B0)] public TArray<FBakedCustomAttributePerBoneData> BakedPerBoneCustomAttributeData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FAnimSetMeshLinkup
{
    [FieldOffset(0x0000)] public TArray<int> BoneToTrackTable;
}

[StructLayout(LayoutKind.Explicit, Size = 0xF0)] 
public unsafe struct UAnimSet
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public byte bAnimRotationOnly;
    [FieldOffset(0x0030)] public TArray<FName> TrackBoneNames;
    [FieldOffset(0x0040)] public TArray<FAnimSetMeshLinkup> LinkupCache;
    [FieldOffset(0x0050)] public TArray<byte> BoneUseAnimTranslation;
    [FieldOffset(0x0060)] public TArray<byte> ForceUseMeshTranslation;
    [FieldOffset(0x0070)] public TArray<FName> UseTranslationBoneNames;
    [FieldOffset(0x0080)] public TArray<FName> ForceMeshTranslationBoneNames;
    [FieldOffset(0x0090)] public FName PreviewSkelMeshName;
    [FieldOffset(0x0098)] public FName BestRatioSkelMeshName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2D0)] 
public unsafe struct UAnimSingleNodeInstance
{
    [FieldOffset(0x0000)] public UAnimInstance baseObj;
    [FieldOffset(0x02B8)] public UAnimationAsset* CurrentAsset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UAnimStateMachineTypes
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xE0)] 
public unsafe struct UAnimStreamable
{
    [FieldOffset(0x0000)] public UAnimSequenceBase baseObj;
    [FieldOffset(0x00A8)] public int NumFrames;
    [FieldOffset(0x00AC)] public EAnimInterpolationType Interpolation;
    [FieldOffset(0x00B0)] public FName RetargetSource;
    [FieldOffset(0x00C8)] public UAnimBoneCompressionSettings* BoneCompressionSettings;
    [FieldOffset(0x00D0)] public UAnimCurveCompressionSettings* CurveCompressionSettings;
    [FieldOffset(0x00D8)] public bool bEnableRootMotion;
    [FieldOffset(0x00D9)] public ERootMotionRootLock RootMotionRootLock;
    [FieldOffset(0x00DA)] public bool bForceRootLock;
    [FieldOffset(0x00DB)] public bool bUseNormalizedRootMotionScale;
}

[StructLayout(LayoutKind.Explicit, Size = 0x140)] 
public unsafe struct UApplicationLifecycleComponent
{
    [FieldOffset(0x0000)] public UActorComponent baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x470)] 
public unsafe struct UArrowComponent
{
    [FieldOffset(0x0000)] public UPrimitiveComponent baseObj;
    [FieldOffset(0x0450)] public FColor ArrowColor;
    [FieldOffset(0x0454)] public float ArrowSize;
    [FieldOffset(0x0458)] public float ArrowLength;
    [FieldOffset(0x045C)] public float ScreenSize;
    [FieldOffset(0x0460)] public byte bIsScreenSizeScaled;
    [FieldOffset(0x0460)] public byte bTreatAsASprite;
}

[StructLayout(LayoutKind.Explicit, Size = 0x78)] 
public unsafe struct UAssetExportTask
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UObject* Object;
    [FieldOffset(0x0030)] public UExporter* Exporter;
    [FieldOffset(0x0038)] public FString Filename;
    [FieldOffset(0x0048)] public bool bSelected;
    [FieldOffset(0x0049)] public bool bReplaceIdentical;
    [FieldOffset(0x004A)] public bool bPrompt;
    [FieldOffset(0x004B)] public bool bAutomated;
    [FieldOffset(0x004C)] public bool bUseFileArchive;
    [FieldOffset(0x004D)] public bool bWriteEmptyFiles;
    [FieldOffset(0x0050)] public TArray<IntPtr> IgnoreObjectList;
    [FieldOffset(0x0060)] public UObject* Options;
    [FieldOffset(0x0068)] public TArray<FString> Errors;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct FPrimaryAssetTypeInfo
{
    [FieldOffset(0x0000)] public FName PrimaryAssetType;
    [FieldOffset(0x0008)] public TSoftClassPtr<UObject> AssetBaseClass;
    [FieldOffset(0x0030)] public UClass* AssetBaseClassLoaded;
    [FieldOffset(0x0038)] public bool bHasBlueprintClasses;
    [FieldOffset(0x0039)] public bool bIsEditorOnly;
    [FieldOffset(0x0040)] public TArray<FDirectoryPath> Directories;
    [FieldOffset(0x0050)] public TArray<FSoftObjectPath> SpecificAssets;
    [FieldOffset(0x0060)] public FPrimaryAssetRules Rules;
    [FieldOffset(0x0070)] public TArray<FString> AssetScanPaths;
    [FieldOffset(0x0080)] public bool bIsDynamicAsset;
    [FieldOffset(0x0084)] public int NumberOfAssets;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C)] 
public unsafe struct FPrimaryAssetRulesOverride
{
    [FieldOffset(0x0000)] public FPrimaryAssetId PrimaryAssetId;
    [FieldOffset(0x0010)] public FPrimaryAssetRules Rules;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct FPrimaryAssetRulesCustomOverride
{
    [FieldOffset(0x0000)] public FPrimaryAssetType PrimaryAssetType;
    [FieldOffset(0x0008)] public FDirectoryPath FilterDirectory;
    [FieldOffset(0x0018)] public FString FilterString;
    [FieldOffset(0x0028)] public FPrimaryAssetRules Rules;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FAssetManagerRedirect
{
    [FieldOffset(0x0000)] public FString Old;
    [FieldOffset(0x0010)] public FString New;
}

[StructLayout(LayoutKind.Explicit, Size = 0x100)] 
public unsafe struct UAssetManagerSettings
{
    [FieldOffset(0x0000)] public UDeveloperSettings baseObj;
    [FieldOffset(0x0038)] public TArray<FPrimaryAssetTypeInfo> PrimaryAssetTypesToScan;
    [FieldOffset(0x0048)] public TArray<FDirectoryPath> DirectoriesToExclude;
    [FieldOffset(0x0058)] public TArray<FPrimaryAssetRulesOverride> PrimaryAssetRules;
    [FieldOffset(0x0068)] public TArray<FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules;
    [FieldOffset(0x0078)] public bool bOnlyCookProductionAssets;
    [FieldOffset(0x0079)] public bool bShouldManagerDetermineTypeAndName;
    [FieldOffset(0x007A)] public bool bShouldGuessTypeAndNameInEditor;
    [FieldOffset(0x007B)] public bool bShouldAcquireMissingChunksOnLoad;
    [FieldOffset(0x0080)] public TArray<FAssetManagerRedirect> PrimaryAssetIdRedirects;
    [FieldOffset(0x0090)] public TArray<FAssetManagerRedirect> PrimaryAssetTypeRedirects;
    [FieldOffset(0x00A0)] public TArray<FAssetManagerRedirect> AssetPathRedirects;
    [FieldOffset(0x00B0)] public TSet<FName> MetaDataTagsForAssetRegistry;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FAssetMapping
{
    [FieldOffset(0x0000)] public UAnimationAsset* SourceAsset;
    [FieldOffset(0x0008)] public UAnimationAsset* TargetAsset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UAssetMappingTable
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TArray<FAssetMapping> MappedAssets;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct UAsyncActionHandleSaveGame
{
    [FieldOffset(0x0000)] public UBlueprintAsyncActionBase baseObj;
    [FieldOffset(0x0060)] public USaveGame* SaveGameObject;
}

[StructLayout(LayoutKind.Explicit, Size = 0x78)] 
public unsafe struct UAsyncActionLoadPrimaryAssetBase
{
    [FieldOffset(0x0000)] public UBlueprintAsyncActionBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct UAsyncActionLoadPrimaryAsset
{
    [FieldOffset(0x0000)] public UAsyncActionLoadPrimaryAssetBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct UAsyncActionLoadPrimaryAssetClass
{
    [FieldOffset(0x0000)] public UAsyncActionLoadPrimaryAssetBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct UAsyncActionLoadPrimaryAssetList
{
    [FieldOffset(0x0000)] public UAsyncActionLoadPrimaryAssetBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct UAsyncActionLoadPrimaryAssetClassList
{
    [FieldOffset(0x0000)] public UAsyncActionLoadPrimaryAssetBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct UAsyncActionChangePrimaryAssetBundles
{
    [FieldOffset(0x0000)] public UAsyncActionLoadPrimaryAssetBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x228)] 
public unsafe struct AAtmosphericFog
{
    [FieldOffset(0x0000)] public AInfo baseObj;
    [FieldOffset(0x0220)] public UAtmosphericFogComponent* AtmosphericFogComponent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C)] 
public unsafe struct FAtmospherePrecomputeParameters
{
    [FieldOffset(0x0000)] public float DensityHeight;
    [FieldOffset(0x0004)] public float DecayHeight;
    [FieldOffset(0x0008)] public int MaxScatteringOrder;
    [FieldOffset(0x000C)] public int TransmittanceTexWidth;
    [FieldOffset(0x0010)] public int TransmittanceTexHeight;
    [FieldOffset(0x0014)] public int IrradianceTexWidth;
    [FieldOffset(0x0018)] public int IrradianceTexHeight;
    [FieldOffset(0x001C)] public int InscatterAltitudeSampleNum;
    [FieldOffset(0x0020)] public int InscatterMuNum;
    [FieldOffset(0x0024)] public int InscatterMuSNum;
    [FieldOffset(0x0028)] public int InscatterNuNum;
}

[StructLayout(LayoutKind.Explicit, Size = 0x300)] 
public unsafe struct UAtmosphericFogComponent
{
    [FieldOffset(0x0000)] public USceneComponent baseObj;
    [FieldOffset(0x01F8)] public float SunMultiplier;
    [FieldOffset(0x01FC)] public float FogMultiplier;
    [FieldOffset(0x0200)] public float DensityMultiplier;
    [FieldOffset(0x0204)] public float DensityOffset;
    [FieldOffset(0x0208)] public float DistanceScale;
    [FieldOffset(0x020C)] public float AltitudeScale;
    [FieldOffset(0x0210)] public float DistanceOffset;
    [FieldOffset(0x0214)] public float GroundOffset;
    [FieldOffset(0x0218)] public float StartDistance;
    [FieldOffset(0x021C)] public float SunDiscScale;
    [FieldOffset(0x0220)] public float DefaultBrightness;
    [FieldOffset(0x0224)] public FColor DefaultLightColor;
    [FieldOffset(0x0228)] public byte bDisableSunDisk;
    [FieldOffset(0x0228)] public byte bAtmosphereAffectsSunIlluminance;
    [FieldOffset(0x0228)] public byte bDisableGroundScattering;
    [FieldOffset(0x022C)] public FAtmospherePrecomputeParameters PrecomputeParams;
    [FieldOffset(0x0258)] public UTexture2D* TransmittanceTexture;
    [FieldOffset(0x0260)] public UTexture2D* IrradianceTexture;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UAudioBus
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public EAudioBusChannels AudioBusChannels;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FAudioQualitySettings
{
    [FieldOffset(0x0000)] public FText DisplayName;
    [FieldOffset(0x0018)] public int MaxChannels;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FSoundDebugEntry
{
    [FieldOffset(0x0000)] public FName DebugName;
    [FieldOffset(0x0008)] public FSoftObjectPath Sound;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FDefaultAudioBusSettings
{
    [FieldOffset(0x0000)] public FSoftObjectPath AudioBus;
}

[StructLayout(LayoutKind.Explicit, Size = 0x198)] 
public unsafe struct UAudioSettings
{
    [FieldOffset(0x0000)] public UDeveloperSettings baseObj;
    [FieldOffset(0x0038)] public FSoftObjectPath DefaultSoundClassName;
    [FieldOffset(0x0050)] public FSoftObjectPath DefaultMediaSoundClassName;
    [FieldOffset(0x0068)] public FSoftObjectPath DefaultSoundConcurrencyName;
    [FieldOffset(0x0080)] public FSoftObjectPath DefaultBaseSoundMix;
    [FieldOffset(0x0098)] public FSoftObjectPath VoiPSoundClass;
    [FieldOffset(0x00B0)] public FSoftObjectPath MasterSubmix;
    [FieldOffset(0x00C8)] public FSoftObjectPath BaseDefaultSubmix;
    [FieldOffset(0x00E0)] public FSoftObjectPath ReverbSubmix;
    [FieldOffset(0x00F8)] public FSoftObjectPath EQSubmix;
    [FieldOffset(0x0110)] public EVoiceSampleRate VoiPSampleRate;
    [FieldOffset(0x0114)] public float DefaultReverbSendLevel;
    [FieldOffset(0x0118)] public int MaximumConcurrentStreams;
    [FieldOffset(0x011C)] public float GlobalMinPitchScale;
    [FieldOffset(0x0120)] public float GlobalMaxPitchScale;
    [FieldOffset(0x0128)] public TArray<FAudioQualitySettings> QualityLevels;
    [FieldOffset(0x0138)] public byte bAllowPlayWhenSilent;
    [FieldOffset(0x0138)] public byte bDisableMasterEQ;
    [FieldOffset(0x0138)] public byte bAllowCenterChannel3DPanning;
    [FieldOffset(0x013C)] public uint NumStoppingSources;
    [FieldOffset(0x0140)] public EPanningMethod PanningMethod;
    [FieldOffset(0x0141)] public EMonoChannelUpmixMethod MonoChannelUpmixMethod;
    [FieldOffset(0x0148)] public FString DialogueFilenameFormat;
    [FieldOffset(0x0158)] public TArray<FSoundDebugEntry> DebugSounds;
    [FieldOffset(0x0168)] public TArray<FDefaultAudioBusSettings> DefaultAudioBuses;
    [FieldOffset(0x0178)] public USoundClass* DefaultSoundClass;
    [FieldOffset(0x0180)] public USoundClass* DefaultMediaSoundClass;
    [FieldOffset(0x0188)] public USoundConcurrency* DefaultSoundConcurrency;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FReverbSettings
{
    [FieldOffset(0x0000)] public bool bApplyReverb;
    [FieldOffset(0x0008)] public UReverbEffect* ReverbEffect;
    [FieldOffset(0x0010)] public USoundEffectSubmixPreset* ReverbPluginEffect;
    [FieldOffset(0x0018)] public float Volume;
    [FieldOffset(0x001C)] public float FadeTime;
}

[StructLayout(LayoutKind.Explicit, Size = 0x24)] 
public unsafe struct FInteriorSettings
{
    [FieldOffset(0x0000)] public bool bIsWorldSettings;
    [FieldOffset(0x0004)] public float ExteriorVolume;
    [FieldOffset(0x0008)] public float ExteriorTime;
    [FieldOffset(0x000C)] public float ExteriorLPF;
    [FieldOffset(0x0010)] public float ExteriorLPFTime;
    [FieldOffset(0x0014)] public float InteriorVolume;
    [FieldOffset(0x0018)] public float InteriorTime;
    [FieldOffset(0x001C)] public float InteriorLPF;
    [FieldOffset(0x0020)] public float InteriorLPFTime;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FAudioVolumeSubmixSendSettings
{
    [FieldOffset(0x0000)] public EAudioVolumeLocationState ListenerLocationState;
    [FieldOffset(0x0001)] public EAudioVolumeLocationState SourceLocationState;
    [FieldOffset(0x0008)] public TArray<FSoundSubmixSendInfo> SubmixSends;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FAudioVolumeSubmixOverrideSettings
{
    [FieldOffset(0x0000)] public USoundSubmix* Submix;
    [FieldOffset(0x0008)] public TArray<IntPtr> SubmixEffectChain;
    [FieldOffset(0x0018)] public float CrossfadeTime;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C8)] 
public unsafe struct AAudioVolume
{
    [FieldOffset(0x0000)] public AVolume baseObj;
    [FieldOffset(0x0258)] public float Priority;
    [FieldOffset(0x025C)] public byte bEnabled;
    [FieldOffset(0x0260)] public FReverbSettings Settings;
    [FieldOffset(0x0280)] public FInteriorSettings AmbientZoneSettings;
    [FieldOffset(0x02A8)] public TArray<FAudioVolumeSubmixSendSettings> SubmixSendSettings;
    [FieldOffset(0x02B8)] public TArray<FAudioVolumeSubmixOverrideSettings> SubmixOverrideSettings;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UAutoDestroySubsystem
{
    [FieldOffset(0x0000)] public UTickableWorldSubsystem baseObj;
    [FieldOffset(0x0040)] public TArray<IntPtr> ActorsToPoll;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FEditorMapPerformanceTestDefinition
{
    [FieldOffset(0x0000)] public FSoftObjectPath PerformanceTestmap;
    [FieldOffset(0x0018)] public int TestTimer;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FFilePath
{
    [FieldOffset(0x0000)] public FString FilePath;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FImportFactorySettingValues
{
    [FieldOffset(0x0000)] public FString SettingName;
    [FieldOffset(0x0010)] public FString Value;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FEditorImportWorkflowDefinition
{
    [FieldOffset(0x0000)] public FFilePath ImportFilePath;
    [FieldOffset(0x0010)] public TArray<FImportFactorySettingValues> FactorySettings;
}

[StructLayout(LayoutKind.Explicit, Size = 0x150)] 
public unsafe struct FBuildPromotionImportWorkflowSettings
{
    [FieldOffset(0x0000)] public FEditorImportWorkflowDefinition Diffuse;
    [FieldOffset(0x0020)] public FEditorImportWorkflowDefinition Normal;
    [FieldOffset(0x0040)] public FEditorImportWorkflowDefinition StaticMesh;
    [FieldOffset(0x0060)] public FEditorImportWorkflowDefinition ReimportStaticMesh;
    [FieldOffset(0x0080)] public FEditorImportWorkflowDefinition BlendShapeMesh;
    [FieldOffset(0x00A0)] public FEditorImportWorkflowDefinition MorphMesh;
    [FieldOffset(0x00C0)] public FEditorImportWorkflowDefinition SkeletalMesh;
    [FieldOffset(0x00E0)] public FEditorImportWorkflowDefinition Animation;
    [FieldOffset(0x0100)] public FEditorImportWorkflowDefinition Sound;
    [FieldOffset(0x0120)] public FEditorImportWorkflowDefinition SurroundSound;
    [FieldOffset(0x0140)] public TArray<FEditorImportWorkflowDefinition> OtherAssetsToImport;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct FBuildPromotionOpenAssetSettings
{
    [FieldOffset(0x0000)] public FFilePath BlueprintAsset;
    [FieldOffset(0x0010)] public FFilePath MaterialAsset;
    [FieldOffset(0x0020)] public FFilePath ParticleSystemAsset;
    [FieldOffset(0x0030)] public FFilePath SkeletalMeshAsset;
    [FieldOffset(0x0040)] public FFilePath StaticMeshAsset;
    [FieldOffset(0x0050)] public FFilePath TextureAsset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FBuildPromotionNewProjectSettings
{
    [FieldOffset(0x0000)] public FDirectoryPath NewProjectFolderOverride;
    [FieldOffset(0x0010)] public FString NewProjectNameOverride;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1F0)] 
public unsafe struct FBuildPromotionTestSettings
{
    [FieldOffset(0x0000)] public FFilePath DefaultStaticMeshAsset;
    [FieldOffset(0x0010)] public FBuildPromotionImportWorkflowSettings ImportWorkflow;
    [FieldOffset(0x0160)] public FBuildPromotionOpenAssetSettings OpenAssets;
    [FieldOffset(0x01C0)] public FBuildPromotionNewProjectSettings NewProjectSettings;
    [FieldOffset(0x01E0)] public FFilePath SourceControlMaterial;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FMaterialEditorPromotionSettings
{
    [FieldOffset(0x0000)] public FFilePath DefaultMaterialAsset;
    [FieldOffset(0x0010)] public FFilePath DefaultDiffuseTexture;
    [FieldOffset(0x0020)] public FFilePath DefaultNormalTexture;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FParticleEditorPromotionSettings
{
    [FieldOffset(0x0000)] public FFilePath DefaultParticleAsset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FBlueprintEditorPromotionSettings
{
    [FieldOffset(0x0000)] public FFilePath FirstMeshPath;
    [FieldOffset(0x0010)] public FFilePath SecondMeshPath;
    [FieldOffset(0x0020)] public FFilePath DefaultParticleAsset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct FExternalToolDefinition
{
    [FieldOffset(0x0000)] public FString ToolName;
    [FieldOffset(0x0010)] public FFilePath ExecutablePath;
    [FieldOffset(0x0020)] public FString CommandLineOptions;
    [FieldOffset(0x0030)] public FDirectoryPath WorkingDirectory;
    [FieldOffset(0x0040)] public FString ScriptExtension;
    [FieldOffset(0x0050)] public FDirectoryPath ScriptDirectory;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct FEditorImportExportTestDefinition
{
    [FieldOffset(0x0000)] public FFilePath ImportFilePath;
    [FieldOffset(0x0010)] public FString ExportFileExtension;
    [FieldOffset(0x0020)] public bool bSkipExport;
    [FieldOffset(0x0028)] public TArray<FImportFactorySettingValues> FactorySettings;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FLaunchOnTestSettings
{
    [FieldOffset(0x0000)] public FFilePath LaunchOnTestmap;
    [FieldOffset(0x0010)] public FString DeviceID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x340)] 
public unsafe struct UAutomationTestSettings
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TArray<FString> EngineTestModules;
    [FieldOffset(0x0038)] public TArray<FString> EditorTestModules;
    [FieldOffset(0x0048)] public FSoftObjectPath AutomationTestmap;
    [FieldOffset(0x0060)] public TArray<FEditorMapPerformanceTestDefinition> EditorPerformanceTestMaps;
    [FieldOffset(0x0070)] public TArray<FSoftObjectPath> AssetsToOpen;
    [FieldOffset(0x0080)] public TArray<FString> MapsToPIETest;
    [FieldOffset(0x0090)] public FBuildPromotionTestSettings BuildPromotionTest;
    [FieldOffset(0x0280)] public FMaterialEditorPromotionSettings MaterialEditorPromotionTest;
    [FieldOffset(0x02B0)] public FParticleEditorPromotionSettings ParticleEditorPromotionTest;
    [FieldOffset(0x02C0)] public FBlueprintEditorPromotionSettings BlueprintEditorPromotionTest;
    [FieldOffset(0x02F0)] public TArray<FString> TestLevelFolders;
    [FieldOffset(0x0300)] public TArray<FExternalToolDefinition> ExternalTools;
    [FieldOffset(0x0310)] public TArray<FEditorImportExportTestDefinition> ImportExportTestDefinitions;
    [FieldOffset(0x0320)] public TArray<FLaunchOnTestSettings> LaunchOnSettings;
    [FieldOffset(0x0330)] public FIntPoint DefaultScreenshotResolution;
    [FieldOffset(0x0338)] public float PIETestDuration;
}

[StructLayout(LayoutKind.Explicit, Size = 0xE0)] 
public unsafe struct UAvoidanceManager
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public float DefaultTimeToLive;
    [FieldOffset(0x0034)] public float LockTimeAfterAvoid;
    [FieldOffset(0x0038)] public float LockTimeAfterClean;
    [FieldOffset(0x003C)] public float DeltaTimeToPredict;
    [FieldOffset(0x0040)] public float ArtificialRadiusExpansion;
    [FieldOffset(0x0044)] public float TestHeightDifference;
    [FieldOffset(0x0048)] public float HeightCheckMargin;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FBandwidthTestItem
{
    [FieldOffset(0x0000)] public TArray<byte> Kilobyte;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FBandwidthTestGenerator
{
    [FieldOffset(0x0000)] public TArray<FBandwidthTestItem> ReplicatedBuffers;
}

[StructLayout(LayoutKind.Explicit, Size = 0x240)] 
public unsafe struct ABandwidthTestActor
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public FBandwidthTestGenerator BandwidthGenerator;
}

[StructLayout(LayoutKind.Explicit, Size = 0x470)] 
public unsafe struct UBillboardComponent
{
    [FieldOffset(0x0000)] public UPrimitiveComponent baseObj;
    [FieldOffset(0x0450)] public UTexture2D* Sprite;
    [FieldOffset(0x0458)] public byte bIsScreenSizeScaled;
    [FieldOffset(0x045C)] public float ScreenSize;
    [FieldOffset(0x0460)] public float U;
    [FieldOffset(0x0464)] public float UL;
    [FieldOffset(0x0468)] public float V;
    [FieldOffset(0x046C)] public float VL;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IBlendableInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FBoneNode
{
    [FieldOffset(0x0000)] public FName Name;
    [FieldOffset(0x0008)] public int ParentIndex;
    [FieldOffset(0x000C)] public EBoneTranslationRetargetingMode TranslationRetargetingMode;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FVirtualBone
{
    [FieldOffset(0x0000)] public FName SourceBoneName;
    [FieldOffset(0x0008)] public FName TargetBoneName;
    [FieldOffset(0x0010)] public FName VirtualBoneName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct FSmartNameContainer
{
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FAnimSlotGroup
{
    [FieldOffset(0x0000)] public FName GroupName;
    [FieldOffset(0x0008)] public TArray<FName> SlotNames;
}

[StructLayout(LayoutKind.Explicit, Size = 0x390)] 
public unsafe struct USkeleton
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0038)] public TArray<FBoneNode> BoneTree;
    [FieldOffset(0x0048)] public TArray<FTransform> RefLocalPoses;
    [FieldOffset(0x0170)] public FGuid VirtualBoneGuid;
    [FieldOffset(0x0180)] public TArray<FVirtualBone> VirtualBones;
    [FieldOffset(0x0190)] public TArray<IntPtr> Sockets;
    [FieldOffset(0x01F0)] public FSmartNameContainer SmartNames;
    [FieldOffset(0x0270)] public TArray<IntPtr> BlendProfiles;
    [FieldOffset(0x0280)] public TArray<FAnimSlotGroup> SlotGroups;
    [FieldOffset(0x0380)] public TArray<IntPtr> AssetUserData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FBlendProfileBoneEntry
{
    [FieldOffset(0x0000)] public FBoneReference BoneReference;
    [FieldOffset(0x0010)] public float BlendScale;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UBlendProfile
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public USkeleton* OwningSkeleton;
    [FieldOffset(0x0038)] public TArray<FBlendProfileBoneEntry> ProfileEntries;
}

[StructLayout(LayoutKind.Explicit, Size = 0x258)] 
public unsafe struct ABlockingVolume
{
    [FieldOffset(0x0000)] public AVolume baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBlueprintExtension
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBlueprintMapLibrary
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBlueprintPathsLibrary
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x278)] 
public unsafe struct UPlatformGameInstance
{
    [FieldOffset(0x0000)] public UGameInstance baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBlueprintPlatformLibrary
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBlueprintSetLibrary
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct FKSphereElem
{
    [FieldOffset(0x0000)] public FKShapeElem baseObj;
    [FieldOffset(0x0030)] public FVector Center;
    [FieldOffset(0x003C)] public float Radius;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct FKBoxElem
{
    [FieldOffset(0x0000)] public FKShapeElem baseObj;
    [FieldOffset(0x0030)] public FVector Center;
    [FieldOffset(0x003C)] public FRotator Rotation;
    [FieldOffset(0x0048)] public float X;
    [FieldOffset(0x004C)] public float Y;
    [FieldOffset(0x0050)] public float Z;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct FKSphylElem
{
    [FieldOffset(0x0000)] public FKShapeElem baseObj;
    [FieldOffset(0x0030)] public FVector Center;
    [FieldOffset(0x003C)] public FRotator Rotation;
    [FieldOffset(0x0048)] public float Radius;
    [FieldOffset(0x004C)] public float Length;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct FKTaperedCapsuleElem
{
    [FieldOffset(0x0000)] public FKShapeElem baseObj;
    [FieldOffset(0x0030)] public FVector Center;
    [FieldOffset(0x003C)] public FRotator Rotation;
    [FieldOffset(0x0048)] public float Radius0;
    [FieldOffset(0x004C)] public float Radius1;
    [FieldOffset(0x0050)] public float Length;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct FKAggregateGeom
{
    [FieldOffset(0x0000)] public TArray<FKSphereElem> SphereElems;
    [FieldOffset(0x0010)] public TArray<FKBoxElem> BoxElems;
    [FieldOffset(0x0020)] public TArray<FKSphylElem> SphylElems;
    [FieldOffset(0x0030)] public TArray<FKConvexElem> ConvexElems;
    [FieldOffset(0x0040)] public TArray<FKTaperedCapsuleElem> TaperedCapsuleElems;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct UBodySetup
{
    [FieldOffset(0x0000)] public UBodySetupCore baseObj;
    [FieldOffset(0x0048)] public FKAggregateGeom AggGeom;
    [FieldOffset(0x00A0)] public byte bAlwaysFullAnimWeight;
    [FieldOffset(0x00A0)] public byte bConsiderForBounds;
    [FieldOffset(0x00A0)] public byte bMeshCollideAll;
    [FieldOffset(0x00A0)] public byte bDoubleSidedGeometry;
    [FieldOffset(0x00A0)] public byte bGenerateNonMirroredCollision;
    [FieldOffset(0x00A0)] public byte bSharedCookedData;
    [FieldOffset(0x00A0)] public byte bGenerateMirroredCollision;
    [FieldOffset(0x00A0)] public byte bSupportUVsAndFaceRemap;
    [FieldOffset(0x00A8)] public UPhysicalMaterial* PhysMaterial;
    [FieldOffset(0x00B0)] public FWalkableSlopeOverride WalkableSlopeOverride;
    [FieldOffset(0x0128)] public FBodyInstance DefaultInstance;
    [FieldOffset(0x0288)] public FVector BuildScale3D;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FBranchFilter
{
    [FieldOffset(0x0000)] public FName BoneName;
    [FieldOffset(0x0008)] public int BlendDepth;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FInputBlendPose
{
    [FieldOffset(0x0000)] public TArray<FBranchFilter> BranchFilters;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UBoneMaskFilter
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TArray<FInputBlendPose> BlendPoses;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBookmarkBase
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UBookMark
{
    [FieldOffset(0x0000)] public UBookmarkBase baseObj;
    [FieldOffset(0x0028)] public FVector Location;
    [FieldOffset(0x0034)] public FRotator Rotation;
    [FieldOffset(0x0040)] public TArray<FString> HiddenLevels;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UBookMark2D
{
    [FieldOffset(0x0000)] public UBookmarkBase baseObj;
    [FieldOffset(0x0028)] public float Zoom2D;
    [FieldOffset(0x002C)] public FIntPoint Location;
}

[StructLayout(LayoutKind.Explicit, Size = 0x120)] 
public unsafe struct UBoundsCopyComponent
{
    [FieldOffset(0x0000)] public UActorComponent baseObj;
    [FieldOffset(0x00B0)] public TSoftObjectPtr<AActor> BoundsSourceActor;
    [FieldOffset(0x00D8)] public bool bUseCollidingComponentsForSourceBounds;
    [FieldOffset(0x00D9)] public bool bKeepOwnBoundsScale;
    [FieldOffset(0x00DA)] public bool bUseCollidingComponentsForOwnBounds;
    [FieldOffset(0x00E0)] public FTransform PostTransform;
    [FieldOffset(0x0110)] public bool bCopyXBounds;
    [FieldOffset(0x0111)] public bool bCopyYBounds;
    [FieldOffset(0x0112)] public bool bCopyZBounds;
}

[StructLayout(LayoutKind.Explicit, Size = 0x228)] 
public unsafe struct AReflectionCapture
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public UReflectionCaptureComponent* CaptureComponent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x228)] 
public unsafe struct ABoxReflectionCapture
{
    [FieldOffset(0x0000)] public AReflectionCapture baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x270)] 
public unsafe struct UReflectionCaptureComponent
{
    [FieldOffset(0x0000)] public USceneComponent baseObj;
    [FieldOffset(0x01F8)] public UBillboardComponent* CaptureOffsetComponent;
    [FieldOffset(0x0200)] public EReflectionSourceType ReflectionSourceType;
    [FieldOffset(0x0201)] public EMobileReflectionCompression MobileReflectionCompression;
    [FieldOffset(0x0208)] public UTextureCube* Cubemap;
    [FieldOffset(0x0210)] public float SourceCubemapAngle;
    [FieldOffset(0x0214)] public float Brightness;
    [FieldOffset(0x0218)] public bool bModifyMaxValueRGBM;
    [FieldOffset(0x021C)] public float MaxValueRGBM;
    [FieldOffset(0x0220)] public FVector CaptureOffset;
    [FieldOffset(0x022C)] public FGuid MapBuildDataId;
    [FieldOffset(0x0250)] public UTextureCube* CachedEncodedHDRCubemap;
}

[StructLayout(LayoutKind.Explicit, Size = 0x290)] 
public unsafe struct UBoxReflectionCaptureComponent
{
    [FieldOffset(0x0000)] public UReflectionCaptureComponent baseObj;
    [FieldOffset(0x0270)] public float BoxTransitionDistance;
    [FieldOffset(0x0278)] public UBoxComponent* PreviewInfluenceBox;
    [FieldOffset(0x0280)] public UBoxComponent* PreviewCaptureBox;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UBreakpoint
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public byte bEnabled;
    [FieldOffset(0x0030)] public UEdGraphNode* Node;
    [FieldOffset(0x0038)] public byte bStepOnce;
    [FieldOffset(0x0038)] public byte bStepOnce_WasPreviouslyDisabled;
    [FieldOffset(0x0038)] public byte bStepOnce_RemoveAfterHit;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FBuilderPoly
{
    [FieldOffset(0x0000)] public TArray<int> VertexIndices;
    [FieldOffset(0x0010)] public int Direction;
    [FieldOffset(0x0014)] public FName ItemName;
    [FieldOffset(0x001C)] public int PolyFlags;
}

[StructLayout(LayoutKind.Explicit, Size = 0x80)] 
public unsafe struct UBrushBuilder
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public FString BitmapFilename;
    [FieldOffset(0x0038)] public FString Tooltip;
    [FieldOffset(0x0048)] public byte NotifyBadParams;
    [FieldOffset(0x0050)] public TArray<FVector> Vertices;
    [FieldOffset(0x0060)] public TArray<FBuilderPoly> Polys;
    [FieldOffset(0x0070)] public FName Layer;
    [FieldOffset(0x0078)] public byte MergeCoplanars;
}

[StructLayout(LayoutKind.Explicit, Size = 0x460)] 
public unsafe struct UBrushComponent
{
    [FieldOffset(0x0000)] public UPrimitiveComponent baseObj;
    [FieldOffset(0x0450)] public UModel* Brush;
    [FieldOffset(0x0458)] public UBodySetup* BrushBodySetup;
}

[StructLayout(LayoutKind.Explicit, Size = 0x258)] 
public unsafe struct ABrushShape
{
    [FieldOffset(0x0000)] public ABrush baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct UButtonStyleAsset
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public FButtonStyle ButtonStyle;
}

[StructLayout(LayoutKind.Explicit, Size = 0x5D0)] 
public unsafe struct UCameraAnim
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UInterpGroup* CameraInterpGroup;
    [FieldOffset(0x0030)] public float AnimLength;
    [FieldOffset(0x0034)] public FBox BoundingBox;
    [FieldOffset(0x0050)] public byte bRelativeToInitialTransform;
    [FieldOffset(0x0050)] public byte bRelativeToInitialFOV;
    [FieldOffset(0x0054)] public float BaseFOV;
    [FieldOffset(0x0060)] public FPostProcessSettings BasePostProcessSettings;
    [FieldOffset(0x05C0)] public float BasePostProcessBlendWeight;
}

[StructLayout(LayoutKind.Explicit, Size = 0x110)] 
public unsafe struct UCameraAnimInst
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UCameraAnim* CamAnim;
    [FieldOffset(0x0030)] public UInterpGroupInst* InterpGroupInst;
    [FieldOffset(0x0050)] public float PlayRate;
    [FieldOffset(0x0068)] public UInterpTrackMove* MoveTrack;
    [FieldOffset(0x0070)] public UInterpTrackInstMove* MoveInst;
    [FieldOffset(0x0078)] public ECameraShakePlaySpace PlaySpace;
}

[StructLayout(LayoutKind.Explicit, Size = 0x258)] 
public unsafe struct ACameraBlockingVolume
{
    [FieldOffset(0x0000)] public AVolume baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UCameraModifier
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public byte bDebug;
    [FieldOffset(0x0028)] public byte bExclusive;
    [FieldOffset(0x002C)] public byte Priority;
    [FieldOffset(0x0030)] public APlayerCameraManager* CameraOwner;
    [FieldOffset(0x0038)] public float AlphaInTime;
    [FieldOffset(0x003C)] public float AlphaOutTime;
    [FieldOffset(0x0040)] public float Alpha;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FActiveCameraShakeInfo
{
    [FieldOffset(0x0000)] public UCameraShakeBase* ShakeInstance;
    [FieldOffset(0x0008)] public TWeakObjectPtr<UCameraShakeSourceComponent> ShakeSource;
    [FieldOffset(0x0010)] public bool bIsCustomInitialized;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FPooledCameraShakes
{
    [FieldOffset(0x0000)] public TArray<IntPtr> PooledShakes;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB0)] 
public unsafe struct UCameraModifier_CameraShake
{
    [FieldOffset(0x0000)] public UCameraModifier baseObj;
    [FieldOffset(0x0048)] public TArray<FActiveCameraShakeInfo> ActiveShakes;
    [FieldOffset(0x0058)] public TMap<TSubclassOf<UCameraShakeBase>, FPooledCameraShakes> ExpiredPooledShakesMap;
    [FieldOffset(0x00A8)] public float SplitScreenShakeScale;
}

[StructLayout(LayoutKind.Explicit, Size = 0x228)] 
public unsafe struct ACameraShakeSourceActor
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public UCameraShakeSourceComponent* CameraShakeSourceComponent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x220)] 
public unsafe struct UCameraShakeSourceComponent
{
    [FieldOffset(0x0000)] public USceneComponent baseObj;
    [FieldOffset(0x01F8)] public ECameraShakeAttenuation Attenuation;
    [FieldOffset(0x01FC)] public float InnerAttenuationRadius;
    [FieldOffset(0x0200)] public float OuterAttenuationRadius;
    [FieldOffset(0x0208)] public TSubclassOf<UCameraShakeBase> CameraShake;
    [FieldOffset(0x0210)] public bool bAutoStart;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct FCanvasUVTri
{
    [FieldOffset(0x0000)] public FVector2D V0_Pos;
    [FieldOffset(0x0008)] public FVector2D V0_UV;
    [FieldOffset(0x0010)] public FLinearColor V0_Color;
    [FieldOffset(0x0020)] public FVector2D V1_Pos;
    [FieldOffset(0x0028)] public FVector2D V1_UV;
    [FieldOffset(0x0030)] public FLinearColor V1_Color;
    [FieldOffset(0x0040)] public FVector2D V2_Pos;
    [FieldOffset(0x0048)] public FVector2D V2_UV;
    [FieldOffset(0x0050)] public FLinearColor V2_Color;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2D0)] 
public unsafe struct UCanvas
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public float OrgX;
    [FieldOffset(0x002C)] public float OrgY;
    [FieldOffset(0x0030)] public float ClipX;
    [FieldOffset(0x0034)] public float ClipY;
    [FieldOffset(0x0038)] public FColor DrawColor;
    [FieldOffset(0x003C)] public byte bCenterX;
    [FieldOffset(0x003C)] public byte bCenterY;
    [FieldOffset(0x003C)] public byte bNoSmooth;
    [FieldOffset(0x0040)] public int SizeX;
    [FieldOffset(0x0044)] public int SizeY;
    [FieldOffset(0x0050)] public FPlane ColorModulate;
    [FieldOffset(0x0060)] public UTexture2D* DefaultTexture;
    [FieldOffset(0x0068)] public UTexture2D* GradientTexture0;
    [FieldOffset(0x0070)] public UReporterGraph* ReporterGraph;
}

[StructLayout(LayoutKind.Explicit, Size = 0x180)] 
public unsafe struct UTextureRenderTarget
{
    [FieldOffset(0x0000)] public UTexture baseObj;
    [FieldOffset(0x0178)] public float TargetGamma;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1B0)] 
public unsafe struct UTextureRenderTarget2D
{
    [FieldOffset(0x0000)] public UTextureRenderTarget baseObj;
    [FieldOffset(0x0180)] public int SizeX;
    [FieldOffset(0x0184)] public int SizeY;
    [FieldOffset(0x0188)] public FLinearColor ClearColor;
    [FieldOffset(0x0198)] public TextureAddress AddressX;
    [FieldOffset(0x0199)] public TextureAddress AddressY;
    [FieldOffset(0x019A)] public byte bForceLinearGamma;
    [FieldOffset(0x019A)] public byte bHDR;
    [FieldOffset(0x019A)] public byte bGPUSharedFlag;
    [FieldOffset(0x019B)] public ETextureRenderTargetFormat RenderTargetFormat;
    [FieldOffset(0x019C)] public byte bAutoGenerateMips;
    [FieldOffset(0x019D)] public TextureFilter MipsSamplerFilter;
    [FieldOffset(0x019E)] public TextureAddress MipsAddressU;
    [FieldOffset(0x019F)] public TextureAddress MipsAddressV;
    [FieldOffset(0x01A0)] public EPixelFormat OverrideFormat;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1D0)] 
public unsafe struct UCanvasRenderTarget2D
{
    [FieldOffset(0x0000)] public UTextureRenderTarget2D baseObj;
    [FieldOffset(0x01B8)] public TWeakObjectPtr<UWorld> World;
    [FieldOffset(0x01C0)] public bool bShouldClearRenderTargetOnReceiveUpdate;
}

[StructLayout(LayoutKind.Explicit, Size = 0x470)] 
public unsafe struct UCapsuleComponent
{
    [FieldOffset(0x0000)] public UShapeComponent baseObj;
    [FieldOffset(0x0468)] public float CapsuleHalfHeight;
    [FieldOffset(0x046C)] public float CapsuleRadius;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UCheatManagerExtension
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x5A8)] 
public unsafe struct UCheckBoxStyleAsset
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public FCheckBoxStyle CheckBoxStyle;
}

[StructLayout(LayoutKind.Explicit, Size = 0x230)] 
public unsafe struct UChildActorComponent
{
    [FieldOffset(0x0000)] public USceneComponent baseObj;
    [FieldOffset(0x01F8)] public TSubclassOf<AActor> ChildActorClass;
    [FieldOffset(0x0200)] public AActor* childActor;
    [FieldOffset(0x0208)] public AActor* ChildActorTemplate;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1BB0)] 
public unsafe struct UChildConnection
{
    [FieldOffset(0x0000)] public UNetConnection baseObj;
    [FieldOffset(0x1BA8)] public UNetConnection* Parent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FDelegateArray
{
    //[FieldOffset(0x0000)] public TArray<FDelegateArrayDelegates> Delegates;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UPlatformInterfaceBase
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TArray<FDelegateArray> AllDelegates;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UCloudStorageBase
{
    [FieldOffset(0x0000)] public UPlatformInterfaceBase baseObj;
    [FieldOffset(0x0038)] public TArray<FString> LocalCloudFiles;
    [FieldOffset(0x0048)] public byte bSuppressDelegateCalls;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct FCollisionResponseTemplate
{
    [FieldOffset(0x0000)] public FName Name;
    [FieldOffset(0x0008)] public ECollisionEnabled CollisionEnabled;
    [FieldOffset(0x000A)] public bool bCanModify;
    [FieldOffset(0x002C)] public FName ObjectTypeName;
    [FieldOffset(0x0038)] public TArray<FResponseChannel> CustomResponses;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FCustomChannelSetup
{
    [FieldOffset(0x0000)] public ECollisionChannel Channel;
    [FieldOffset(0x0001)] public ECollisionResponse DefaultResponse;
    [FieldOffset(0x0002)] public bool bTraceType;
    [FieldOffset(0x0003)] public bool bStaticObject;
    [FieldOffset(0x0004)] public FName Name;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FCustomProfile
{
    [FieldOffset(0x0000)] public FName Name;
    [FieldOffset(0x0008)] public TArray<FResponseChannel> CustomResponses;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FRedirector
{
    [FieldOffset(0x0000)] public FName OldName;
    [FieldOffset(0x0008)] public FName NewName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x170)] 
public unsafe struct UCollisionProfile
{
    [FieldOffset(0x0000)] public UDeveloperSettings baseObj;
    [FieldOffset(0x0038)] public TArray<FCollisionResponseTemplate> Profiles;
    [FieldOffset(0x0048)] public TArray<FCustomChannelSetup> DefaultChannelResponses;
    [FieldOffset(0x0058)] public TArray<FCustomProfile> EditProfiles;
    [FieldOffset(0x0068)] public TArray<FRedirector> ProfileRedirects;
    [FieldOffset(0x0078)] public TArray<FRedirector> CollisionChannelRedirects;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FBlueprintComponentDelegateBinding
{
    [FieldOffset(0x0000)] public FName ComponentPropertyName;
    [FieldOffset(0x0008)] public FName DelegatePropertyName;
    [FieldOffset(0x0010)] public FName FunctionNameToBind;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UComponentDelegateBinding
{
    [FieldOffset(0x0000)] public UDynamicBlueprintBinding baseObj;
    [FieldOffset(0x0028)] public TArray<FBlueprintComponentDelegateBinding> ComponentDelegateBindings;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UActorComponentInstanceDataTransientOuter
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA0)] 
public unsafe struct UCurveTable
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC8)] 
public unsafe struct UCompositeCurveTable
{
    [FieldOffset(0x0000)] public UCurveTable baseObj;
    [FieldOffset(0x00A0)] public TArray<IntPtr> ParentTables;
    [FieldOffset(0x00B0)] public TArray<IntPtr> OldParentTables;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB0)] 
public unsafe struct UDataTable
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UScriptStruct* RowStruct;
    [FieldOffset(0x0080)] public byte bStripFromClientBuilds;
    [FieldOffset(0x0080)] public byte bIgnoreExtraFields;
    [FieldOffset(0x0080)] public byte bIgnoreMissingFields;
    [FieldOffset(0x0088)] public FString ImportKeyField;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD8)] 
public unsafe struct UCompositeDataTable
{
    [FieldOffset(0x0000)] public UDataTable baseObj;
    [FieldOffset(0x00B0)] public TArray<IntPtr> ParentTables;
    [FieldOffset(0x00C0)] public TArray<IntPtr> OldParentTables;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FStatColorMapEntry
{
    [FieldOffset(0x0000)] public float In;
    [FieldOffset(0x0004)] public FColor Out;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FStatColorMapping
{
    [FieldOffset(0x0000)] public FString StatName;
    [FieldOffset(0x0010)] public TArray<FStatColorMapEntry> ColorMap;
    [FieldOffset(0x0020)] public byte DisableBlend;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FGameNameRedirect
{
    [FieldOffset(0x0000)] public FName OldGameName;
    [FieldOffset(0x0008)] public FName NewGameName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3C)] 
public unsafe struct FClassRedirect
{
    [FieldOffset(0x0000)] public FName ObjectName;
    [FieldOffset(0x0008)] public FName OldClassName;
    [FieldOffset(0x0010)] public FName NewClassName;
    [FieldOffset(0x0018)] public FName OldSubobjName;
    [FieldOffset(0x0020)] public FName NewSubobjName;
    [FieldOffset(0x0028)] public FName NewClassClass;
    [FieldOffset(0x0030)] public FName NewClassPackage;
    [FieldOffset(0x0038)] public bool InstanceOnly;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FPluginRedirect
{
    [FieldOffset(0x0000)] public FString OldPluginName;
    [FieldOffset(0x0010)] public FString NewPluginName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FStructRedirect
{
    [FieldOffset(0x0000)] public FName OldStructName;
    [FieldOffset(0x0008)] public FName NewStructName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FDropNoteInfo
{
    [FieldOffset(0x0000)] public FVector Location;
    [FieldOffset(0x000C)] public FRotator Rotation;
    [FieldOffset(0x0018)] public FString Comment;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FNetDriverDefinition
{
    [FieldOffset(0x0000)] public FName DefName;
    [FieldOffset(0x0008)] public FName DriverClassName;
    [FieldOffset(0x0010)] public FName DriverClassNameFallback;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD20)] 
public unsafe struct UEngine
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public UFont* TinyFont;
    [FieldOffset(0x0038)] public FSoftObjectPath TinyFontName;
    [FieldOffset(0x0050)] public UFont* SmallFont;
    [FieldOffset(0x0058)] public FSoftObjectPath SmallFontName;
    [FieldOffset(0x0070)] public UFont* MediumFont;
    [FieldOffset(0x0078)] public FSoftObjectPath MediumFontName;
    [FieldOffset(0x0090)] public UFont* LargeFont;
    [FieldOffset(0x0098)] public FSoftObjectPath LargeFontName;
    [FieldOffset(0x00B0)] public UFont* SubtitleFont;
    [FieldOffset(0x00B8)] public FSoftObjectPath SubtitleFontName;
    [FieldOffset(0x00D0)] public TArray<IntPtr> AdditionalFonts;
    [FieldOffset(0x00E0)] public TArray<FString> AdditionalFontNames;
    [FieldOffset(0x00F0)] public TSubclassOf<UConsole> ConsoleClass;
    [FieldOffset(0x00F8)] public FSoftClassPath ConsoleClassName;
    [FieldOffset(0x0110)] public TSubclassOf<UGameViewportClient> GameViewportClientClass;
    [FieldOffset(0x0118)] public FSoftClassPath GameViewportClientClassName;
    [FieldOffset(0x0130)] public TSubclassOf<ULocalPlayer> LocalPlayerClass;
    [FieldOffset(0x0138)] public FSoftClassPath LocalPlayerClassName;
    [FieldOffset(0x0150)] public TSubclassOf<AWorldSettings> WorldSettingsClass;
    [FieldOffset(0x0158)] public FSoftClassPath WorldSettingsClassName;
    [FieldOffset(0x0170)] public FSoftClassPath NavigationSystemClassName;
    [FieldOffset(0x0188)] public TSubclassOf<UNavigationSystemBase> NavigationSystemClass;
    [FieldOffset(0x0190)] public FSoftClassPath NavigationSystemConfigClassName;
    [FieldOffset(0x01A8)] public TSubclassOf<UNavigationSystemConfig> NavigationSystemConfigClass;
    [FieldOffset(0x01B0)] public FSoftClassPath AvoidanceManagerClassName;
    [FieldOffset(0x01C8)] public TSubclassOf<UAvoidanceManager> AvoidanceManagerClass;
    [FieldOffset(0x01D0)] public FSoftClassPath AIControllerClassName;
    [FieldOffset(0x01E8)] public TSubclassOf<UPhysicsCollisionHandler> PhysicsCollisionHandlerClass;
    [FieldOffset(0x01F0)] public FSoftClassPath PhysicsCollisionHandlerClassName;
    [FieldOffset(0x0208)] public FSoftClassPath GameUserSettingsClassName;
    [FieldOffset(0x0220)] public TSubclassOf<UGameUserSettings> GameUserSettingsClass;
    [FieldOffset(0x0228)] public UGameUserSettings* GameUserSettings;
    [FieldOffset(0x0230)] public TSubclassOf<ALevelScriptActor> LevelScriptActorClass;
    [FieldOffset(0x0238)] public FSoftClassPath LevelScriptActorClassName;
    [FieldOffset(0x0250)] public FSoftClassPath DefaultBlueprintBaseClassName;
    [FieldOffset(0x0268)] public FSoftClassPath GameSingletonClassName;
    [FieldOffset(0x0280)] public UObject* GameSingleton;
    [FieldOffset(0x0288)] public FSoftClassPath AssetManagerClassName;
    [FieldOffset(0x02A0)] public UAssetManager* AssetManager;
    [FieldOffset(0x02A8)] public UTexture2D* DefaultTexture;
    [FieldOffset(0x02B0)] public FSoftObjectPath DefaultTextureName;
    [FieldOffset(0x02C8)] public UTexture* DefaultDiffuseTexture;
    [FieldOffset(0x02D0)] public FSoftObjectPath DefaultDiffuseTextureName;
    [FieldOffset(0x02E8)] public UTexture2D* DefaultBSPVertexTexture;
    [FieldOffset(0x02F0)] public FSoftObjectPath DefaultBSPVertexTextureName;
    [FieldOffset(0x0308)] public UTexture2D* HighFrequencyNoiseTexture;
    [FieldOffset(0x0310)] public FSoftObjectPath HighFrequencyNoiseTextureName;
    [FieldOffset(0x0328)] public UTexture2D* DefaultBokehTexture;
    [FieldOffset(0x0330)] public FSoftObjectPath DefaultBokehTextureName;
    [FieldOffset(0x0348)] public UTexture2D* DefaultBloomKernelTexture;
    [FieldOffset(0x0350)] public FSoftObjectPath DefaultBloomKernelTextureName;
    [FieldOffset(0x0368)] public UMaterial* WireframeMaterial;
    [FieldOffset(0x0370)] public FString WireframeMaterialName;
    [FieldOffset(0x0380)] public UMaterial* DebugMeshMaterial;
    [FieldOffset(0x0388)] public FSoftObjectPath DebugMeshMaterialName;
    [FieldOffset(0x03A0)] public UMaterial* EmissiveMeshMaterial;
    [FieldOffset(0x03A8)] public FSoftObjectPath EmissiveMeshMaterialName;
    [FieldOffset(0x03C0)] public UMaterial* LevelColorationLitMaterial;
    [FieldOffset(0x03C8)] public FString LevelColorationLitMaterialName;
    [FieldOffset(0x03D8)] public UMaterial* LevelColorationUnlitMaterial;
    [FieldOffset(0x03E0)] public FString LevelColorationUnlitMaterialName;
    [FieldOffset(0x03F0)] public UMaterial* LightingTexelDensityMaterial;
    [FieldOffset(0x03F8)] public FString LightingTexelDensityName;
    [FieldOffset(0x0408)] public UMaterial* ShadedLevelColorationLitMaterial;
    [FieldOffset(0x0410)] public FString ShadedLevelColorationLitMaterialName;
    [FieldOffset(0x0420)] public UMaterial* ShadedLevelColorationUnlitMaterial;
    [FieldOffset(0x0428)] public FString ShadedLevelColorationUnlitMaterialName;
    [FieldOffset(0x0438)] public UMaterial* RemoveSurfaceMaterial;
    [FieldOffset(0x0440)] public FSoftObjectPath RemoveSurfaceMaterialName;
    [FieldOffset(0x0458)] public UMaterial* VertexColorMaterial;
    [FieldOffset(0x0460)] public FString VertexColorMaterialName;
    [FieldOffset(0x0470)] public UMaterial* VertexColorViewModeMaterial_ColorOnly;
    [FieldOffset(0x0478)] public FString VertexColorViewModeMaterialName_ColorOnly;
    [FieldOffset(0x0488)] public UMaterial* VertexColorViewModeMaterial_AlphaAsColor;
    [FieldOffset(0x0490)] public FString VertexColorViewModeMaterialName_AlphaAsColor;
    [FieldOffset(0x04A0)] public UMaterial* VertexColorViewModeMaterial_RedOnly;
    [FieldOffset(0x04A8)] public FString VertexColorViewModeMaterialName_RedOnly;
    [FieldOffset(0x04B8)] public UMaterial* VertexColorViewModeMaterial_GreenOnly;
    [FieldOffset(0x04C0)] public FString VertexColorViewModeMaterialName_GreenOnly;
    [FieldOffset(0x04D0)] public UMaterial* VertexColorViewModeMaterial_BlueOnly;
    [FieldOffset(0x04D8)] public FString VertexColorViewModeMaterialName_BlueOnly;
    [FieldOffset(0x04E8)] public FSoftObjectPath DebugEditorMaterialName;
    [FieldOffset(0x0500)] public UMaterial* ConstraintLimitMaterial;
    [FieldOffset(0x0508)] public UMaterialInstanceDynamic* ConstraintLimitMaterialX;
    [FieldOffset(0x0510)] public UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis;
    [FieldOffset(0x0518)] public UMaterialInstanceDynamic* ConstraintLimitMaterialY;
    [FieldOffset(0x0520)] public UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis;
    [FieldOffset(0x0528)] public UMaterialInstanceDynamic* ConstraintLimitMaterialZ;
    [FieldOffset(0x0530)] public UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis;
    [FieldOffset(0x0538)] public UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic;
    [FieldOffset(0x0540)] public UMaterial* InvalidLightmapSettingsMaterial;
    [FieldOffset(0x0548)] public FSoftObjectPath InvalidLightmapSettingsMaterialName;
    [FieldOffset(0x0560)] public UMaterial* PreviewShadowsIndicatorMaterial;
    [FieldOffset(0x0568)] public FSoftObjectPath PreviewShadowsIndicatorMaterialName;
    [FieldOffset(0x0580)] public UMaterial* ArrowMaterial;
    [FieldOffset(0x0588)] public UMaterialInstanceDynamic* ArrowMaterialYellow;
    [FieldOffset(0x0590)] public FSoftObjectPath ArrowMaterialName;
    [FieldOffset(0x05A8)] public FLinearColor LightingOnlyBrightness;
    [FieldOffset(0x05B8)] public TArray<FLinearColor> ShaderComplexityColors;
    [FieldOffset(0x05C8)] public TArray<FLinearColor> QuadComplexityColors;
    [FieldOffset(0x05D8)] public TArray<FLinearColor> LightComplexityColors;
    [FieldOffset(0x05E8)] public TArray<FLinearColor> StationaryLightOverlapColors;
    [FieldOffset(0x05F8)] public TArray<FLinearColor> LODColorationColors;
    [FieldOffset(0x0608)] public TArray<FLinearColor> HLODColorationColors;
    [FieldOffset(0x0618)] public TArray<FLinearColor> StreamingAccuracyColors;
    [FieldOffset(0x0628)] public float MaxPixelShaderAdditiveComplexityCount;
    [FieldOffset(0x062C)] public float MaxES3PixelShaderAdditiveComplexityCount;
    [FieldOffset(0x0630)] public float MinLightMapDensity;
    [FieldOffset(0x0634)] public float IdealLightMapDensity;
    [FieldOffset(0x0638)] public float MaxLightMapDensity;
    [FieldOffset(0x063C)] public byte bRenderLightMapDensityGrayscale;
    [FieldOffset(0x0640)] public float RenderLightMapDensityGrayscaleScale;
    [FieldOffset(0x0644)] public float RenderLightMapDensityColorScale;
    [FieldOffset(0x0648)] public FLinearColor LightMapDensityVertexMappedColor;
    [FieldOffset(0x0658)] public FLinearColor LightMapDensitySelectedColor;
    [FieldOffset(0x0668)] public TArray<FStatColorMapping> StatColorMappings;
    [FieldOffset(0x0678)] public UPhysicalMaterial* DefaultPhysMaterial;
    [FieldOffset(0x0680)] public FSoftObjectPath DefaultPhysMaterialName;
    [FieldOffset(0x0698)] public TArray<FGameNameRedirect> ActiveGameNameRedirects;
    [FieldOffset(0x06A8)] public TArray<FClassRedirect> ActiveClassRedirects;
    [FieldOffset(0x06B8)] public TArray<FPluginRedirect> ActivePluginRedirects;
    [FieldOffset(0x06C8)] public TArray<FStructRedirect> ActiveStructRedirects;
    [FieldOffset(0x06D8)] public UTexture2D* PreIntegratedSkinBRDFTexture;
    [FieldOffset(0x06E0)] public FSoftObjectPath PreIntegratedSkinBRDFTextureName;
    [FieldOffset(0x06F8)] public UTexture2D* BlueNoiseTexture;
    [FieldOffset(0x0700)] public FSoftObjectPath BlueNoiseTextureName;
    [FieldOffset(0x0718)] public UTexture2D* MiniFontTexture;
    [FieldOffset(0x0720)] public FSoftObjectPath MiniFontTextureName;
    [FieldOffset(0x0738)] public UTexture* WeightMapPlaceholderTexture;
    [FieldOffset(0x0740)] public FSoftObjectPath WeightMapPlaceholderTextureName;
    [FieldOffset(0x0758)] public UTexture2D* LightMapDensityTexture;
    [FieldOffset(0x0760)] public FSoftObjectPath LightMapDensityTextureName;
    [FieldOffset(0x0780)] public UGameViewportClient* GameViewport;
    [FieldOffset(0x0788)] public TArray<FString> DeferredCommands;
    [FieldOffset(0x0798)] public float NearClipPlane;
    [FieldOffset(0x079C)] public byte bSubtitlesEnabled;
    [FieldOffset(0x079C)] public byte bSubtitlesForcedOff;
    [FieldOffset(0x07A0)] public int MaximumLoopIterationCount;
    [FieldOffset(0x07A4)] public byte bCanBlueprintsTickByDefault;
    [FieldOffset(0x07A4)] public byte bOptimizeAnimBlueprintMemberVariableAccess;
    [FieldOffset(0x07A4)] public byte bAllowMultiThreadedAnimationUpdate;
    [FieldOffset(0x07A4)] public byte bEnableEditorPSysRealtimeLOD;
    [FieldOffset(0x07A4)] public byte bSmoothFrameRate;
    [FieldOffset(0x07A4)] public byte bUseFixedFrameRate;
    [FieldOffset(0x07A8)] public float FixedFrameRate;
    [FieldOffset(0x07AC)] public FFloatRange SmoothedFrameRateRange;
    [FieldOffset(0x07C0)] public UEngineCustomTimeStep* CustomTimeStep;
    [FieldOffset(0x07E8)] public FSoftClassPath CustomTimeStepClassName;
    [FieldOffset(0x0800)] public UTimecodeProvider* TimecodeProvider;
    [FieldOffset(0x0828)] public FSoftClassPath TimecodeProviderClassName;
    [FieldOffset(0x0840)] public bool bGenerateDefaultTimecode;
    [FieldOffset(0x0844)] public FFrameRate GenerateDefaultTimecodeFrameRate;
    [FieldOffset(0x084C)] public float GenerateDefaultTimecodeFrameDelay;
    [FieldOffset(0x0850)] public byte bCheckForMultiplePawnsSpawnedInAFrame;
    [FieldOffset(0x0854)] public int NumPawnsAllowedToBeSpawnedInAFrame;
    [FieldOffset(0x0858)] public byte bShouldGenerateLowQualityLightmaps;
    [FieldOffset(0x085C)] public FColor C_WorldBox;
    [FieldOffset(0x0860)] public FColor C_BrushWire;
    [FieldOffset(0x0864)] public FColor C_AddWire;
    [FieldOffset(0x0868)] public FColor C_SubtractWire;
    [FieldOffset(0x086C)] public FColor C_SemiSolidWire;
    [FieldOffset(0x0870)] public FColor C_NonSolidWire;
    [FieldOffset(0x0874)] public FColor C_WireBackground;
    [FieldOffset(0x0878)] public FColor C_ScaleBoxHi;
    [FieldOffset(0x087C)] public FColor C_VolumeCollision;
    [FieldOffset(0x0880)] public FColor C_BSPCollision;
    [FieldOffset(0x0884)] public FColor C_OrthoBackground;
    [FieldOffset(0x0888)] public FColor C_Volume;
    [FieldOffset(0x088C)] public FColor C_BrushShape;
    [FieldOffset(0x0890)] public float StreamingDistanceFactor;
    [FieldOffset(0x0898)] public FDirectoryPath GameScreenshotSaveDirectory;
    [FieldOffset(0x08A8)] public ETransitionType TransitionType;
    [FieldOffset(0x08B0)] public FString TransitionDescription;
    [FieldOffset(0x08C0)] public FString TransitionGameMode;
    [FieldOffset(0x08D0)] public byte bAllowMatureLanguage;
    [FieldOffset(0x08D4)] public float CameraRotationThreshold;
    [FieldOffset(0x08D8)] public float CameraTranslationThreshold;
    [FieldOffset(0x08DC)] public float PrimitiveProbablyVisibleTime;
    [FieldOffset(0x08E0)] public float MaxOcclusionPixelsFraction;
    [FieldOffset(0x08E4)] public byte bPauseOnLossOfFocus;
    [FieldOffset(0x08E8)] public int MaxParticleResize;
    [FieldOffset(0x08EC)] public int MaxParticleResizeWarn;
    [FieldOffset(0x08F0)] public TArray<FDropNoteInfo> PendingDroppedNotes;
    [FieldOffset(0x0900)] public float NetClientTicksPerSecond;
    [FieldOffset(0x0904)] public float DisplayGamma;
    [FieldOffset(0x0908)] public float MinDesiredFrameRate;
    [FieldOffset(0x090C)] public FLinearColor DefaultSelectedMaterialColor;
    [FieldOffset(0x091C)] public FLinearColor SelectedMaterialColor;
    [FieldOffset(0x092C)] public FLinearColor SelectionOutlineColor;
    [FieldOffset(0x093C)] public FLinearColor SubduedSelectionOutlineColor;
    [FieldOffset(0x094C)] public FLinearColor SelectedMaterialColorOverride;
    [FieldOffset(0x095C)] public bool bIsOverridingSelectedColor;
    [FieldOffset(0x0960)] public byte bEnableOnScreenDebugMessages;
    [FieldOffset(0x0960)] public byte bEnableOnScreenDebugMessagesDisplay;
    [FieldOffset(0x0960)] public byte bSuppressMapWarnings;
    [FieldOffset(0x0960)] public byte bDisableAILogging;
    [FieldOffset(0x0964)] public uint bEnableVisualLogRecordingOnStart;
    [FieldOffset(0x0968)] public int ScreenSaverInhibitorSemaphore;
    [FieldOffset(0x096C)] public byte bLockReadOnlyLevels;
    [FieldOffset(0x0970)] public FString ParticleEventManagerClassPath;
    [FieldOffset(0x0980)] public float SelectionHighlightIntensity;
    [FieldOffset(0x0984)] public float BSPSelectionHighlightIntensity;
    [FieldOffset(0x0988)] public float SelectionHighlightIntensityBillboards;
    [FieldOffset(0x0BF8)] public TArray<FNetDriverDefinition> NetDriverDefinitions;
    [FieldOffset(0x0C08)] public TArray<FString> ServerActors;
    [FieldOffset(0x0C18)] public TArray<FString> RuntimeServerActors;
    [FieldOffset(0x0C28)] public float NetErrorLogInterval;
    [FieldOffset(0x0C2C)] public byte bStartedLoadMapMovie;
    [FieldOffset(0x0C48)] public int NextWorldContextHandle;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UScriptViewportClient
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FDebugDisplayProperty
{
    [FieldOffset(0x0000)] public UObject* Obj;
    [FieldOffset(0x0008)] public UClass* WithinClass;
}

[StructLayout(LayoutKind.Explicit, Size = 0x360)] 
public unsafe struct UGameViewportClient
{
    [FieldOffset(0x0000)] public UScriptViewportClient baseObj;
    [FieldOffset(0x0040)] public UConsole* ViewportConsole;
    [FieldOffset(0x0048)] public TArray<FDebugDisplayProperty> DebugProperties;
    [FieldOffset(0x0068)] public int MaxSplitscreenPlayers;
    [FieldOffset(0x0078)] public UWorld* World;
    [FieldOffset(0x0080)] public UGameInstance* GameInstance;
}

[StructLayout(LayoutKind.Explicit, Size = 0x130)] 
public unsafe struct UConsole
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0038)] public ULocalPlayer* ConsoleTargetPlayer;
    [FieldOffset(0x0040)] public UTexture2D* DefaultTexture_Black;
    [FieldOffset(0x0048)] public UTexture2D* DefaultTexture_White;
    [FieldOffset(0x0068)] public TArray<FString> HistoryBuffer;
}

[StructLayout(LayoutKind.Explicit, Size = 0x80)] 
public unsafe struct UControlChannel
{
    [FieldOffset(0x0000)] public UChannel baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct UStreamingSettings
{
    [FieldOffset(0x0000)] public UDeveloperSettings baseObj;
    [FieldOffset(0x0038)] public byte AsyncLoadingThreadEnabled;
    [FieldOffset(0x0038)] public byte WarnIfTimeLimitExceeded;
    [FieldOffset(0x003C)] public float TimeLimitExceededMultiplier;
    [FieldOffset(0x0040)] public float TimeLimitExceededMinTime;
    [FieldOffset(0x0044)] public int MinBulkDataSizeForAsyncLoading;
    [FieldOffset(0x0048)] public byte UseBackgroundLevelStreaming;
    [FieldOffset(0x0048)] public byte AsyncLoadingUseFullTimeLimit;
    [FieldOffset(0x004C)] public float AsyncLoadingTimeLimit;
    [FieldOffset(0x0050)] public float PriorityAsyncLoadingExtraTime;
    [FieldOffset(0x0054)] public float LevelStreamingActorsUpdateTimeLimit;
    [FieldOffset(0x0058)] public float PriorityLevelStreamingActorsUpdateExtraTime;
    [FieldOffset(0x005C)] public int LevelStreamingComponentsRegistrationGranularity;
    [FieldOffset(0x0060)] public float LevelStreamingUnregisterComponentsTimeLimit;
    [FieldOffset(0x0064)] public int LevelStreamingComponentsUnregistrationGranularity;
    [FieldOffset(0x0068)] public byte FlushStreamingOnExit;
    [FieldOffset(0x0068)] public byte EventDrivenLoaderEnabled;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UGarbageCollectionSettings
{
    [FieldOffset(0x0000)] public UDeveloperSettings baseObj;
    [FieldOffset(0x0038)] public float TimeBetweenPurgingPendingKillObjects;
    [FieldOffset(0x003C)] public byte FlushStreamingOnGC;
    [FieldOffset(0x003C)] public byte AllowParallelGC;
    [FieldOffset(0x003C)] public byte IncrementalBeginDestroyEnabled;
    [FieldOffset(0x003C)] public byte MultithreadedDestructionEnabled;
    [FieldOffset(0x003C)] public byte CreateGCClusters;
    [FieldOffset(0x003C)] public byte AssetClusteringEnabled;
    [FieldOffset(0x003C)] public byte ActorClusteringEnabled;
    [FieldOffset(0x003C)] public byte BlueprintClusteringEnabled;
    [FieldOffset(0x003D)] public byte UseDisregardForGCOnDedicatedServers;
    [FieldOffset(0x0040)] public int MinGCClusterSize;
    [FieldOffset(0x0044)] public int NumRetriesBeforeForcingGC;
    [FieldOffset(0x0048)] public int MaxObjectsNotConsideredByGC;
    [FieldOffset(0x004C)] public int SizeOfPermanentObjectPool;
    [FieldOffset(0x0050)] public int MaxObjectsInGame;
    [FieldOffset(0x0054)] public int MaxObjectsInEditor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FCullDistanceSizePair
{
    [FieldOffset(0x0000)] public float Size;
    [FieldOffset(0x0004)] public float CullDistance;
}

[StructLayout(LayoutKind.Explicit, Size = 0x270)] 
public unsafe struct ACullDistanceVolume
{
    [FieldOffset(0x0000)] public AVolume baseObj;
    [FieldOffset(0x0258)] public TArray<FCullDistanceSizePair> CullDistances;
    [FieldOffset(0x0268)] public byte bEnabled;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UCurveBase
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UDEPRECATED_CurveEdPresetCurve
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB8)] 
public unsafe struct UCurveFloat
{
    [FieldOffset(0x0000)] public UCurveBase baseObj;
    [FieldOffset(0x0030)] public FRichCurve FloatCurve;
    [FieldOffset(0x00B0)] public bool bIsEventCurve;
}

[StructLayout(LayoutKind.Explicit, Size = 0x250)] 
public unsafe struct UCurveLinearColor
{
    [FieldOffset(0x0000)] public UCurveBase baseObj;
    [FieldOffset(0x0030)] public FRichCurve FloatCurves;
    [FieldOffset(0x0230)] public float AdjustHue;
    [FieldOffset(0x0234)] public float AdjustSaturation;
    [FieldOffset(0x0238)] public float AdjustBrightness;
    [FieldOffset(0x023C)] public float AdjustBrightnessCurve;
    [FieldOffset(0x0240)] public float AdjustVibrance;
    [FieldOffset(0x0244)] public float AdjustMinAlpha;
    [FieldOffset(0x0248)] public float AdjustMaxAlpha;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1A0)] 
public unsafe struct UTexture2D
{
    [FieldOffset(0x0000)] public UTexture baseObj;
    [FieldOffset(0x0178)] public int LevelIndex;
    [FieldOffset(0x017C)] public int FirstResourceMemMip;
    [FieldOffset(0x0180)] public byte bTemporarilyDisableStreaming;
    [FieldOffset(0x0181)] public TextureAddress AddressX;
    [FieldOffset(0x0182)] public TextureAddress AddressY;
    [FieldOffset(0x0184)] public FIntPoint ImportedSize;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C0)] 
public unsafe struct UCurveLinearColorAtlas
{
    [FieldOffset(0x0000)] public UTexture2D baseObj;
    [FieldOffset(0x01A0)] public uint TextureSize;
    [FieldOffset(0x01A4)] public byte bSquareResolution;
    [FieldOffset(0x01A8)] public uint TextureHeight;
    [FieldOffset(0x01B0)] public TArray<IntPtr> GradientCurves;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FNamedCurveValue
{
    [FieldOffset(0x0000)] public FName Name;
    [FieldOffset(0x0008)] public float Value;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct ICurveSourceInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1B0)] 
public unsafe struct UCurveVector
{
    [FieldOffset(0x0000)] public UCurveBase baseObj;
    [FieldOffset(0x0030)] public FRichCurve FloatCurves;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDamageType
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public byte bCausedByWorld;
    [FieldOffset(0x0028)] public byte bScaleMomentumByMass;
    [FieldOffset(0x0028)] public byte bRadialDamageVelChange;
    [FieldOffset(0x002C)] public float DamageImpulse;
    [FieldOffset(0x0030)] public float DestructibleImpulse;
    [FieldOffset(0x0034)] public float DestructibleDamageSpreadScale;
    [FieldOffset(0x0038)] public float DamageFalloff;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDataDrivenCVarEngineSubsystem
{
    [FieldOffset(0x0000)] public UEngineSubsystem baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct FDataDrivenConsoleVariable
{
    [FieldOffset(0x0000)] public FDataDrivenCVarType Type;
    [FieldOffset(0x0008)] public FString Name;
    [FieldOffset(0x0018)] public FString Tooltip;
    [FieldOffset(0x0028)] public float DefaultValueFloat;
    [FieldOffset(0x002C)] public int DefaultValueInt;
    [FieldOffset(0x0030)] public bool DefaultValueBool;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct UDataDrivenConsoleVariableSettings
{
    [FieldOffset(0x0000)] public UDeveloperSettings baseObj;
    [FieldOffset(0x0050)] public TArray<FDataDrivenConsoleVariable> CVarsArray;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UDataTableFunctionLibrary
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x680)] 
public unsafe struct ADebugCameraController
{
    [FieldOffset(0x0000)] public APlayerController baseObj;
    [FieldOffset(0x0580)] public byte bShowSelectedInfo;
    [FieldOffset(0x0580)] public byte bIsFrozenRendering;
    [FieldOffset(0x0580)] public byte bIsOrbitingSelectedActor;
    [FieldOffset(0x0580)] public byte bOrbitPivotUseCenter;
    [FieldOffset(0x0580)] public byte bEnableBufferVisualization;
    [FieldOffset(0x0580)] public byte bEnableBufferVisualizationFullMode;
    [FieldOffset(0x0580)] public byte bIsBufferVisualizationInputSetup;
    [FieldOffset(0x0580)] public byte bLastDisplayEnabled;
    [FieldOffset(0x0588)] public UDrawFrustumComponent* DrawFrustum;
    [FieldOffset(0x0590)] public AActor* SelectedActor;
    [FieldOffset(0x0598)] public UPrimitiveComponent* SelectedComponent;
    [FieldOffset(0x05A0)] public FHitResult SelectedHitPoint;
    [FieldOffset(0x0628)] public APlayerController* OriginalControllerRef;
    [FieldOffset(0x0630)] public UPlayer* OriginalPlayer;
    [FieldOffset(0x0638)] public float SpeedScale;
    [FieldOffset(0x063C)] public float InitialMaxSpeed;
    [FieldOffset(0x0640)] public float InitialAccel;
    [FieldOffset(0x0644)] public float InitialDecel;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FDebugCameraControllerSettingsViewModeIndex
{
    [FieldOffset(0x0008)] public EViewModeIndex ViewModeIndex;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UDebugCameraControllerSettings
{
    [FieldOffset(0x0000)] public UDeveloperSettings baseObj;
    [FieldOffset(0x0038)] public TArray<FDebugCameraControllerSettingsViewModeIndex> CycleViewModes;
}

[StructLayout(LayoutKind.Explicit, Size = 0x310)] 
public unsafe struct ADebugCameraHUD
{
    [FieldOffset(0x0000)] public AHUD baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UDebugDrawService
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x228)] 
public unsafe struct ADecalActor
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public UDecalComponent* Decal;
}

[StructLayout(LayoutKind.Explicit, Size = 0x240)] 
public unsafe struct UDecalComponent
{
    [FieldOffset(0x0000)] public USceneComponent baseObj;
    [FieldOffset(0x01F8)] public UMaterialInterface* DecalMaterial;
    [FieldOffset(0x0200)] public int SortOrder;
    [FieldOffset(0x0204)] public float FadeScreenSize;
    [FieldOffset(0x0208)] public float FadeStartDelay;
    [FieldOffset(0x020C)] public float FadeDuration;
    [FieldOffset(0x0210)] public float FadeInDuration;
    [FieldOffset(0x0214)] public float FadeInStartDelay;
    [FieldOffset(0x0218)] public byte bDestroyOwnerAfterFade;
    [FieldOffset(0x021C)] public FVector DecalSize;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A8)] 
public unsafe struct ADefaultPawn
{
    [FieldOffset(0x0000)] public APawn baseObj;
    [FieldOffset(0x0280)] public float BaseTurnRate;
    [FieldOffset(0x0284)] public float BaseLookUpRate;
    [FieldOffset(0x0288)] public UPawnMovementComponent* MovementComponent;
    [FieldOffset(0x0290)] public USphereComponent* CollisionComponent;
    [FieldOffset(0x0298)] public UStaticMeshComponent* MeshComponent;
    [FieldOffset(0x02A0)] public byte bAddDefaultMovementBindings;
}

[StructLayout(LayoutKind.Explicit, Size = 0x268)] 
public unsafe struct APhysicsVolume
{
    [FieldOffset(0x0000)] public AVolume baseObj;
    [FieldOffset(0x0258)] public float TerminalVelocity;
    [FieldOffset(0x025C)] public int Priority;
    [FieldOffset(0x0260)] public float FluidFriction;
    [FieldOffset(0x0264)] public byte bWaterVolume;
    [FieldOffset(0x0264)] public byte bPhysicsOnContact;
}

[StructLayout(LayoutKind.Explicit, Size = 0x268)] 
public unsafe struct ADefaultPhysicsVolume
{
    [FieldOffset(0x0000)] public APhysicsVolume baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C18)] 
public unsafe struct UDemoNetConnection
{
    [FieldOffset(0x0000)] public UNetConnection baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB0)] 
public unsafe struct FRollbackNetStartupActorInfo
{
    [FieldOffset(0x0008)] public UObject* Archetype;
    [FieldOffset(0x0038)] public ULevel* Level;
    [FieldOffset(0x00A0)] public TArray<IntPtr> ObjReferences;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FMulticastRecordOptions
{
    [FieldOffset(0x0000)] public FString FuncPathName;
    [FieldOffset(0x0010)] public bool bServerSkip;
    [FieldOffset(0x0011)] public bool bClientSkip;
}

[StructLayout(LayoutKind.Explicit, Size = 0x12D8)] 
public unsafe struct UDemoNetDriver
{
    [FieldOffset(0x0000)] public UNetDriver baseObj;
    [FieldOffset(0x0858)] public TMap<FString, FRollbackNetStartupActorInfo> RollbackNetStartupActors;
    [FieldOffset(0x0A04)] public float CheckpointSaveMaxMSPerFrame;
    [FieldOffset(0x0A28)] public TArray<FMulticastRecordOptions> MulticastRecordOptions;
    [FieldOffset(0x0A38)] public bool bIsLocalReplay;
    [FieldOffset(0x0A40)] public TArray<IntPtr> SpectatorControllers;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC0)] 
public unsafe struct UPendingNetGame
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public UNetDriver* NetDriver;
    [FieldOffset(0x0038)] public UDemoNetDriver* DemoNetDriver;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC0)] 
public unsafe struct UDemoPendingNetGame
{
    [FieldOffset(0x0000)] public UPendingNetGame baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IDestructibleInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct FTextureLODGroup
{
    [FieldOffset(0x0000)] public TextureGroup Group;
    [FieldOffset(0x000C)] public int LODBias;
    [FieldOffset(0x0010)] public int LODBias_Smaller;
    [FieldOffset(0x0014)] public int LODBias_Smallest;
    [FieldOffset(0x001C)] public int NumStreamedMips;
    [FieldOffset(0x0020)] public TextureMipGenSettings MipGenSettings;
    [FieldOffset(0x0024)] public int MinLODSize;
    [FieldOffset(0x0028)] public int MaxLODSize;
    [FieldOffset(0x002C)] public int MaxLODSize_Smaller;
    [FieldOffset(0x0030)] public int MaxLODSize_Smallest;
    [FieldOffset(0x0034)] public int OptionalLODBias;
    [FieldOffset(0x0038)] public int OptionalMaxLODSize;
    [FieldOffset(0x0040)] public FName MinMagFilter;
    [FieldOffset(0x0048)] public FName MipFilter;
    [FieldOffset(0x0050)] public ETextureMipLoadOptions MipLoadOptions;
    [FieldOffset(0x0051)] public bool HighPriorityLoad;
    [FieldOffset(0x0052)] public bool DuplicateNonOptionalMips;
    [FieldOffset(0x0054)] public float Downscale;
    [FieldOffset(0x0058)] public ETextureDownscaleOptions DownscaleOptions;
    [FieldOffset(0x005C)] public int VirtualTextureTileCountBias;
    [FieldOffset(0x0060)] public int VirtualTextureTileSizeBias;
    [FieldOffset(0x0064)] public ETextureLossyCompressionAmount LossyCompressionAmount;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UTextureLODSettings
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TArray<FTextureLODGroup> TextureLODGroups;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA8)] 
public unsafe struct UDeviceProfile
{
    [FieldOffset(0x0000)] public UTextureLODSettings baseObj;
    [FieldOffset(0x0038)] public FString DeviceType;
    [FieldOffset(0x0048)] public FString BaseProfileName;
    [FieldOffset(0x0058)] public UObject* Parent;
    [FieldOffset(0x0088)] public TArray<FString> CVars;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UDeviceProfileFragment
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC8)] 
public unsafe struct UDeviceProfileManager
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TArray<IntPtr> Profiles;
}

[StructLayout(LayoutKind.Explicit, Size = 0x188)] 
public unsafe struct UDialogueSoundWaveProxy
{
    [FieldOffset(0x0000)] public USoundBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDialogueVoice
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public EGrammaticalGender Gender;
    [FieldOffset(0x0029)] public EGrammaticalNumber Plurality;
    [FieldOffset(0x002C)] public FGuid LocalizationGUID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FDialogueContext
{
    [FieldOffset(0x0000)] public UDialogueVoice* Speaker;
    [FieldOffset(0x0008)] public TArray<IntPtr> Targets;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct FDialogueContextMapping
{
    [FieldOffset(0x0000)] public FDialogueContext Context;
    [FieldOffset(0x0018)] public USoundWave* SoundWave;
    [FieldOffset(0x0020)] public FString LocalizationKeyFormat;
    [FieldOffset(0x0030)] public UDialogueSoundWaveProxy* Proxy;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct UDialogueWave
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public byte bMature;
    [FieldOffset(0x0028)] public byte bOverride_SubtitleOverride;
    [FieldOffset(0x0030)] public FString SpokenText;
    [FieldOffset(0x0040)] public FString SubtitleOverride;
    [FieldOffset(0x0050)] public TArray<FDialogueContextMapping> ContextMappings;
    [FieldOffset(0x0060)] public FGuid LocalizationGUID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x230)] 
public unsafe struct ALight
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public ULightComponent* LightComponent;
    [FieldOffset(0x0228)] public byte bEnabled;
}

[StructLayout(LayoutKind.Explicit, Size = 0x230)] 
public unsafe struct ADirectionalLight
{
    [FieldOffset(0x0000)] public ALight baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x230)] 
public unsafe struct ULightComponentBase
{
    [FieldOffset(0x0000)] public USceneComponent baseObj;
    [FieldOffset(0x01F8)] public FGuid LightGuid;
    [FieldOffset(0x0208)] public float Brightness;
    [FieldOffset(0x020C)] public float Intensity;
    [FieldOffset(0x0210)] public FColor LightColor;
    [FieldOffset(0x0214)] public byte bAffectsWorld;
    [FieldOffset(0x0214)] public byte CastShadows;
    [FieldOffset(0x0214)] public byte CastStaticShadows;
    [FieldOffset(0x0214)] public byte CastDynamicShadows;
    [FieldOffset(0x0214)] public byte bAffectTranslucentLighting;
    [FieldOffset(0x0214)] public byte bTransmission;
    [FieldOffset(0x0214)] public byte bCastVolumetricShadow;
    [FieldOffset(0x0214)] public byte bCastDeepShadow;
    [FieldOffset(0x0215)] public byte bCastRaytracedShadow;
    [FieldOffset(0x0215)] public byte bAffectReflection;
    [FieldOffset(0x0215)] public byte bAffectGlobalIllumination;
    [FieldOffset(0x0218)] public float DeepShadowLayerDistribution;
    [FieldOffset(0x021C)] public float IndirectLightingIntensity;
    [FieldOffset(0x0220)] public float VolumetricScatteringIntensity;
    [FieldOffset(0x0224)] public int SamplesPerPixel;
}

[StructLayout(LayoutKind.Explicit, Size = 0x330)] 
public unsafe struct ULightComponent
{
    [FieldOffset(0x0000)] public ULightComponentBase baseObj;
    [FieldOffset(0x0228)] public float Temperature;
    [FieldOffset(0x022C)] public float MaxDrawDistance;
    [FieldOffset(0x0230)] public float MaxDistanceFadeRange;
    [FieldOffset(0x0234)] public byte bUseTemperature;
    [FieldOffset(0x0238)] public int ShadowMapChannel;
    [FieldOffset(0x0240)] public float MinRoughness;
    [FieldOffset(0x0244)] public float SpecularScale;
    [FieldOffset(0x0248)] public float ShadowResolutionScale;
    [FieldOffset(0x024C)] public float ShadowBias;
    [FieldOffset(0x0250)] public float ShadowSlopeBias;
    [FieldOffset(0x0254)] public float ShadowSharpen;
    [FieldOffset(0x0258)] public float ContactShadowLength;
    [FieldOffset(0x025C)] public byte ContactShadowLengthInWS;
    [FieldOffset(0x025C)] public byte InverseSquaredFalloff;
    [FieldOffset(0x025C)] public byte CastTranslucentShadows;
    [FieldOffset(0x025C)] public byte bCastShadowsFromCinematicObjectsOnly;
    [FieldOffset(0x025C)] public byte bAffectDynamicIndirectLighting;
    [FieldOffset(0x025C)] public byte bForceCachedShadowsForMovablePrimitives;
    [FieldOffset(0x0260)] public FLightingChannels LightingChannels;
    [FieldOffset(0x0268)] public UMaterialInterface* LightFunctionMaterial;
    [FieldOffset(0x0270)] public FVector LightFunctionScale;
    [FieldOffset(0x0280)] public UTextureLightProfile* IESTexture;
    [FieldOffset(0x0288)] public byte bUseIESBrightness;
    [FieldOffset(0x028C)] public float IESBrightnessScale;
    [FieldOffset(0x0290)] public float LightFunctionFadeDistance;
    [FieldOffset(0x0294)] public float DisabledBrightness;
    [FieldOffset(0x0298)] public byte bEnableLightShaftBloom;
    [FieldOffset(0x029C)] public float BloomScale;
    [FieldOffset(0x02A0)] public float BloomThreshold;
    [FieldOffset(0x02A4)] public float BloomMaxBrightness;
    [FieldOffset(0x02A8)] public FColor BloomTint;
    [FieldOffset(0x02AC)] public bool bUseRayTracedDistanceFieldShadows;
    [FieldOffset(0x02B0)] public float RayStartOffsetDepthScale;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FLightmassLightSettings
{
    [FieldOffset(0x0000)] public float IndirectLightingSaturation;
    [FieldOffset(0x0004)] public float ShadowExponent;
    [FieldOffset(0x0008)] public bool bUseAreaShadowsForStationaryLight;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FLightmassDirectionalLightSettings
{
    [FieldOffset(0x0000)] public FLightmassLightSettings baseObj;
    [FieldOffset(0x000C)] public float LightSourceAngle;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3F0)] 
public unsafe struct UDirectionalLightComponent
{
    [FieldOffset(0x0000)] public ULightComponent baseObj;
    [FieldOffset(0x0328)] public float ShadowCascadeBiasDistribution;
    [FieldOffset(0x032C)] public byte bEnableLightShaftOcclusion;
    [FieldOffset(0x0330)] public float OcclusionMaskDarkness;
    [FieldOffset(0x0334)] public float OcclusionDepthRange;
    [FieldOffset(0x0338)] public FVector LightShaftOverrideDirection;
    [FieldOffset(0x0344)] public float WholeSceneDynamicShadowRadius;
    [FieldOffset(0x0348)] public float DynamicShadowDistanceMovableLight;
    [FieldOffset(0x034C)] public float DynamicShadowDistanceStationaryLight;
    [FieldOffset(0x0350)] public int DynamicShadowCascades;
    [FieldOffset(0x0354)] public float CascadeDistributionExponent;
    [FieldOffset(0x0358)] public float CascadeTransitionFraction;
    [FieldOffset(0x035C)] public float ShadowDistanceFadeoutFraction;
    [FieldOffset(0x0360)] public byte bUseInsetShadowsForMovableObjects;
    [FieldOffset(0x0364)] public int FarShadowCascadeCount;
    [FieldOffset(0x0368)] public float FarShadowDistance;
    [FieldOffset(0x036C)] public float DistanceFieldShadowDistance;
    [FieldOffset(0x0370)] public float LightSourceAngle;
    [FieldOffset(0x0374)] public float LightSourceSoftAngle;
    [FieldOffset(0x0378)] public float ShadowSourceAngleFactor;
    [FieldOffset(0x037C)] public float TraceDistance;
    [FieldOffset(0x0380)] public byte bUsedAsAtmosphereSunLight;
    [FieldOffset(0x0384)] public int AtmosphereSunLightIndex;
    [FieldOffset(0x0388)] public FLinearColor AtmosphereSunDiskColorScale;
    [FieldOffset(0x0398)] public byte bPerPixelAtmosphereTransmittance;
    [FieldOffset(0x0398)] public byte bCastShadowsOnClouds;
    [FieldOffset(0x0398)] public byte bCastShadowsOnAtmosphere;
    [FieldOffset(0x0398)] public byte bCastCloudShadows;
    [FieldOffset(0x039C)] public float CloudShadowStrength;
    [FieldOffset(0x03A0)] public float CloudShadowOnAtmosphereStrength;
    [FieldOffset(0x03A4)] public float CloudShadowOnSurfaceStrength;
    [FieldOffset(0x03A8)] public float CloudShadowDepthBias;
    [FieldOffset(0x03AC)] public float CloudShadowExtent;
    [FieldOffset(0x03B0)] public float CloudShadowMapResolutionScale;
    [FieldOffset(0x03B4)] public float CloudShadowRaySampleCountScale;
    [FieldOffset(0x03B8)] public FLinearColor CloudScatteredLuminanceScale;
    [FieldOffset(0x03C8)] public FLightmassDirectionalLightSettings LightmassSettings;
    [FieldOffset(0x03D8)] public byte bCastModulatedShadows;
    [FieldOffset(0x03DC)] public FColor ModulatedShadowColor;
    [FieldOffset(0x03E0)] public float ShadowAmount;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UDistribution
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UDistributionFloat
{
    [FieldOffset(0x0000)] public UDistribution baseObj;
    [FieldOffset(0x0030)] public byte bCanBeBaked;
    [FieldOffset(0x0030)] public byte bBakedDataSuccesfully;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDistributionFloatConstant
{
    [FieldOffset(0x0000)] public UDistributionFloat baseObj;
    [FieldOffset(0x0038)] public float Constant;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UDistributionFloatConstantCurve
{
    [FieldOffset(0x0000)] public UDistributionFloat baseObj;
    [FieldOffset(0x0038)] public FInterpCurveFloat ConstantCurve;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UDistributionFloatParameterBase
{
    [FieldOffset(0x0000)] public UDistributionFloatConstant baseObj;
    [FieldOffset(0x0040)] public FName ParameterName;
    [FieldOffset(0x0048)] public float MinInput;
    [FieldOffset(0x004C)] public float MaxInput;
    [FieldOffset(0x0050)] public float MinOutput;
    [FieldOffset(0x0054)] public float MaxOutput;
    [FieldOffset(0x0058)] public DistributionParamMode ParamMode;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UDistributionFloatParticleParameter
{
    [FieldOffset(0x0000)] public UDistributionFloatParameterBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDistributionFloatUniform
{
    [FieldOffset(0x0000)] public UDistributionFloat baseObj;
    [FieldOffset(0x0038)] public float Min;
    [FieldOffset(0x003C)] public float Max;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UDistributionFloatUniformCurve
{
    [FieldOffset(0x0000)] public UDistributionFloat baseObj;
    [FieldOffset(0x0038)] public FInterpCurveVector2D ConstantCurve;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UDistributionVector
{
    [FieldOffset(0x0000)] public UDistribution baseObj;
    [FieldOffset(0x0030)] public byte bCanBeBaked;
    [FieldOffset(0x0030)] public byte bIsDirty;
    [FieldOffset(0x0030)] public byte bBakedDataSuccesfully;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UDistributionVectorConstant
{
    [FieldOffset(0x0000)] public UDistributionVector baseObj;
    [FieldOffset(0x0038)] public FVector Constant;
    [FieldOffset(0x0044)] public byte bLockAxes;
    [FieldOffset(0x0048)] public EDistributionVectorLockFlags LockedAxes;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UDistributionVectorConstantCurve
{
    [FieldOffset(0x0000)] public UDistributionVector baseObj;
    [FieldOffset(0x0038)] public FInterpCurveVector ConstantCurve;
    [FieldOffset(0x0050)] public byte bLockAxes;
    [FieldOffset(0x0054)] public EDistributionVectorLockFlags LockedAxes;
}

[StructLayout(LayoutKind.Explicit, Size = 0x90)] 
public unsafe struct UDistributionVectorParameterBase
{
    [FieldOffset(0x0000)] public UDistributionVectorConstant baseObj;
    [FieldOffset(0x0050)] public FName ParameterName;
    [FieldOffset(0x0058)] public FVector MinInput;
    [FieldOffset(0x0064)] public FVector MaxInput;
    [FieldOffset(0x0070)] public FVector MinOutput;
    [FieldOffset(0x007C)] public FVector MaxOutput;
    [FieldOffset(0x0088)] public DistributionParamMode ParamModes;
}

[StructLayout(LayoutKind.Explicit, Size = 0x90)] 
public unsafe struct UDistributionVectorParticleParameter
{
    [FieldOffset(0x0000)] public UDistributionVectorParameterBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UDistributionVectorUniform
{
    [FieldOffset(0x0000)] public UDistributionVector baseObj;
    [FieldOffset(0x0038)] public FVector Max;
    [FieldOffset(0x0044)] public FVector Min;
    [FieldOffset(0x0050)] public byte bLockAxes;
    [FieldOffset(0x0054)] public EDistributionVectorLockFlags LockedAxes;
    [FieldOffset(0x0055)] public EDistributionVectorMirrorFlags MirrorFlags;
    [FieldOffset(0x0058)] public byte bUseExtremes;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UDistributionVectorUniformCurve
{
    [FieldOffset(0x0000)] public UDistributionVector baseObj;
    [FieldOffset(0x0038)] public FInterpCurveTwoVectors ConstantCurve;
    [FieldOffset(0x0050)] public byte bLockAxes1;
    [FieldOffset(0x0050)] public byte bLockAxes2;
    [FieldOffset(0x0054)] public EDistributionVectorLockFlags LockedAxes;
    [FieldOffset(0x0056)] public EDistributionVectorMirrorFlags MirrorFlags;
    [FieldOffset(0x005C)] public byte bUseExtremes;
}

[StructLayout(LayoutKind.Explicit, Size = 0x228)] 
public unsafe struct ADocumentationActor
{
    [FieldOffset(0x0000)] public AActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UDPICustomScalingRule
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x470)] 
public unsafe struct UDrawFrustumComponent
{
    [FieldOffset(0x0000)] public UPrimitiveComponent baseObj;
    [FieldOffset(0x0450)] public FColor FrustumColor;
    [FieldOffset(0x0454)] public float FrustumAngle;
    [FieldOffset(0x0458)] public float FrustumAspectRatio;
    [FieldOffset(0x045C)] public float FrustumStartDist;
    [FieldOffset(0x0460)] public float FrustumEndDist;
    [FieldOffset(0x0468)] public UTexture* Texture;
}

[StructLayout(LayoutKind.Explicit, Size = 0x470)] 
public unsafe struct UDrawSphereComponent
{
    [FieldOffset(0x0000)] public USphereComponent baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UEdGraph
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TSubclassOf<UEdGraphSchema> Schema;
    [FieldOffset(0x0030)] public TArray<IntPtr> Nodes;
    [FieldOffset(0x0040)] public byte bEditable;
    [FieldOffset(0x0040)] public byte bAllowDeletion;
    [FieldOffset(0x0040)] public byte bAllowRenaming;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UGraphNodeContextMenuContext
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UBlueprint* Blueprint;
    [FieldOffset(0x0030)] public UEdGraph* Graph;
    [FieldOffset(0x0038)] public UEdGraphNode* Node;
    [FieldOffset(0x0048)] public bool bIsDebugging;
}

[StructLayout(LayoutKind.Explicit, Size = 0x98)] 
public unsafe struct UEdGraphNode
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0038)] public TArray<IntPtr> DeprecatedPins;
    [FieldOffset(0x0048)] public int NodePosX;
    [FieldOffset(0x004C)] public int NodePosY;
    [FieldOffset(0x0050)] public int NodeWidth;
    [FieldOffset(0x0054)] public int NodeHeight;
    [FieldOffset(0x0058)] public ENodeAdvancedPins AdvancedPinDisplay;
    [FieldOffset(0x0059)] public ENodeEnabledState EnabledState;
    [FieldOffset(0x005B)] public byte bDisplayAsDisabled;
    [FieldOffset(0x005B)] public byte bUserSetEnabledState;
    [FieldOffset(0x005B)] public byte bIsNodeEnabled;
    [FieldOffset(0x005B)] public byte bHasCompilerMessage;
    [FieldOffset(0x0060)] public FString NodeComment;
    [FieldOffset(0x0070)] public int ErrorType;
    [FieldOffset(0x0078)] public FString ErrorMsg;
    [FieldOffset(0x0088)] public FGuid NodeGuid;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB8)] 
public unsafe struct UEdGraphNode_Documentation
{
    [FieldOffset(0x0000)] public UEdGraphNode baseObj;
    [FieldOffset(0x0098)] public FString Link;
    [FieldOffset(0x00A8)] public FString Excerpt;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C)] 
public unsafe struct FEdGraphTerminalType
{
    [FieldOffset(0x0000)] public FName TerminalCategory;
    [FieldOffset(0x0008)] public FName TerminalSubCategory;
    [FieldOffset(0x0010)] public TWeakObjectPtr<UObject> TerminalSubCategoryObject;
    [FieldOffset(0x0018)] public bool bTerminalIsConst;
    [FieldOffset(0x0019)] public bool bTerminalIsWeakPointer;
    [FieldOffset(0x001A)] public bool bTerminalIsUObjectWrapper;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct FEdGraphPinType
{
    [FieldOffset(0x0000)] public FName PinCategory;
    [FieldOffset(0x0008)] public FName PinSubCategory;
    [FieldOffset(0x0010)] public TWeakObjectPtr<UObject> PinSubCategoryObject;
    [FieldOffset(0x0018)] public FSimpleMemberReference PinSubCategoryMemberReference;
    [FieldOffset(0x0038)] public FEdGraphTerminalType PinValueType;
    [FieldOffset(0x0054)] public EPinContainerType ContainerType;
    [FieldOffset(0x0055)] public byte bIsArray;
    [FieldOffset(0x0055)] public byte bIsReference;
    [FieldOffset(0x0055)] public byte bIsConst;
    [FieldOffset(0x0055)] public byte bIsWeakPointer;
    [FieldOffset(0x0055)] public byte bIsUObjectWrapper;
}

[StructLayout(LayoutKind.Explicit, Size = 0x118)] 
public unsafe struct UEdGraphPin_Deprecated
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public FString PinName;
    [FieldOffset(0x0038)] public FString PinToolTip;
    [FieldOffset(0x0048)] public EEdGraphPinDirection Direction;
    [FieldOffset(0x0050)] public FEdGraphPinType PinType;
    [FieldOffset(0x00A8)] public FString DefaultValue;
    [FieldOffset(0x00B8)] public FString AutogeneratedDefaultValue;
    [FieldOffset(0x00C8)] public UObject* DefaultObject;
    [FieldOffset(0x00D0)] public FText DefaultTextValue;
    [FieldOffset(0x00E8)] public TArray<IntPtr> LinkedTo;
    [FieldOffset(0x00F8)] public TArray<IntPtr> SubPins;
    [FieldOffset(0x0108)] public UEdGraphPin_Deprecated* ParentPin;
    [FieldOffset(0x0110)] public UEdGraphPin_Deprecated* ReferencePassThroughConnection;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UEdGraphSchema
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x270)] 
public unsafe struct AEmitter
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public UParticleSystemComponent* ParticleSystemComponent;
    [FieldOffset(0x0228)] public byte bDestroyOnSystemFinish;
    [FieldOffset(0x0228)] public byte bPostUpdateTickGroup;
    [FieldOffset(0x0228)] public byte bCurrentlyActive;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2E0)] 
public unsafe struct AEmitterCameraLensEffectBase
{
    [FieldOffset(0x0000)] public AEmitter baseObj;
    [FieldOffset(0x0270)] public UParticleSystem* PS_CameraEffect;
    [FieldOffset(0x0278)] public UParticleSystem* PS_CameraEffectNonExtremeContent;
    [FieldOffset(0x0280)] public APlayerCameraManager* BaseCamera;
    [FieldOffset(0x0290)] public FTransform RelativeTransform;
    [FieldOffset(0x02C0)] public float BaseFOV;
    [FieldOffset(0x02C4)] public byte bAllowMultipleInstances;
    [FieldOffset(0x02C4)] public byte bResetWhenRetriggered;
    [FieldOffset(0x02C8)] public TArray<TSubclassOf<AEmitterCameraLensEffectBase>> EmittersToTreatAsSame;
    [FieldOffset(0x02D8)] public float DistFromCamera;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UViewModeUtils
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UEngineBaseTypes
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UEngineHandlerComponentFactory
{
    [FieldOffset(0x0000)] public UHandlerComponentFactory baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct ULocalMessage
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA8)] 
public unsafe struct UEngineMessage
{
    [FieldOffset(0x0000)] public ULocalMessage baseObj;
    [FieldOffset(0x0028)] public FString FailedPlaceMessage;
    [FieldOffset(0x0038)] public FString MaxedOutMessage;
    [FieldOffset(0x0048)] public FString EnteredMessage;
    [FieldOffset(0x0058)] public FString LeftMessage;
    [FieldOffset(0x0068)] public FString GlobalNameChange;
    [FieldOffset(0x0078)] public FString SpecEnteredMessage;
    [FieldOffset(0x0088)] public FString NewPlayerMessage;
    [FieldOffset(0x0098)] public FString NewSpecMessage;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UEngineTypes
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x230)] 
public unsafe struct AExponentialHeightFog
{
    [FieldOffset(0x0000)] public AInfo baseObj;
    [FieldOffset(0x0220)] public UExponentialHeightFogComponent* Component;
    [FieldOffset(0x0228)] public byte bEnabled;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FExponentialHeightFogData
{
    [FieldOffset(0x0000)] public float FogDensity;
    [FieldOffset(0x0004)] public float FogHeightFalloff;
    [FieldOffset(0x0008)] public float FogHeightOffset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct UExponentialHeightFogComponent
{
    [FieldOffset(0x0000)] public USceneComponent baseObj;
    [FieldOffset(0x01F8)] public float FogDensity;
    [FieldOffset(0x01FC)] public float FogHeightFalloff;
    [FieldOffset(0x0200)] public FExponentialHeightFogData SecondFogData;
    [FieldOffset(0x020C)] public FLinearColor FogInscatteringColor;
    [FieldOffset(0x0220)] public UTextureCube* InscatteringColorCubemap;
    [FieldOffset(0x0228)] public float InscatteringColorCubemapAngle;
    [FieldOffset(0x022C)] public FLinearColor InscatteringTextureTint;
    [FieldOffset(0x023C)] public float FullyDirectionalInscatteringColorDistance;
    [FieldOffset(0x0240)] public float NonDirectionalInscatteringColorDistance;
    [FieldOffset(0x0244)] public float DirectionalInscatteringExponent;
    [FieldOffset(0x0248)] public float DirectionalInscatteringStartDistance;
    [FieldOffset(0x024C)] public FLinearColor DirectionalInscatteringColor;
    [FieldOffset(0x025C)] public float FogMaxOpacity;
    [FieldOffset(0x0260)] public float StartDistance;
    [FieldOffset(0x0264)] public float FogCutoffDistance;
    [FieldOffset(0x0268)] public bool bEnableVolumetricFog;
    [FieldOffset(0x026C)] public float VolumetricFogScatteringDistribution;
    [FieldOffset(0x0270)] public FColor VolumetricFogAlbedo;
    [FieldOffset(0x0274)] public FLinearColor VolumetricFogEmissive;
    [FieldOffset(0x0284)] public float VolumetricFogExtinctionScale;
    [FieldOffset(0x0288)] public float VolumetricFogDistance;
    [FieldOffset(0x028C)] public float VolumetricFogStaticLightingScatteringIntensity;
    [FieldOffset(0x0290)] public bool bOverrideLightColorsWithFogInscatteringColors;
}

[StructLayout(LayoutKind.Explicit, Size = 0x78)] 
public unsafe struct UExporter
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UClass* SupportedClass;
    [FieldOffset(0x0030)] public UObject* ExportRootScope;
    [FieldOffset(0x0038)] public TArray<FString> FormatExtension;
    [FieldOffset(0x0048)] public TArray<FString> FormatDescription;
    [FieldOffset(0x0058)] public int PreferredFormatIndex;
    [FieldOffset(0x005C)] public int TextIndent;
    [FieldOffset(0x0060)] public byte bText;
    [FieldOffset(0x0060)] public byte bSelectedOnly;
    [FieldOffset(0x0060)] public byte bForceFileOperations;
    [FieldOffset(0x0068)] public UAssetExportTask* ExportTask;
}

[StructLayout(LayoutKind.Explicit, Size = 0x150)] 
public unsafe struct UFloatingPawnMovement
{
    [FieldOffset(0x0000)] public UPawnMovementComponent baseObj;
    [FieldOffset(0x0138)] public float MaxSpeed;
    [FieldOffset(0x013C)] public float Acceleration;
    [FieldOffset(0x0140)] public float Deceleration;
    [FieldOffset(0x0144)] public float TurningBoost;
    [FieldOffset(0x0148)] public byte bPositionCorrected;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FFontCharacter
{
    [FieldOffset(0x0000)] public int StartU;
    [FieldOffset(0x0004)] public int StartV;
    [FieldOffset(0x0008)] public int USize;
    [FieldOffset(0x000C)] public int VSize;
    [FieldOffset(0x0010)] public byte TextureIndex;
    [FieldOffset(0x0014)] public int VerticalOffset;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB0)] 
public unsafe struct FFontImportOptionsData
{
    [FieldOffset(0x0000)] public FString FontName;
    [FieldOffset(0x0010)] public float Height;
    [FieldOffset(0x0014)] public byte bEnableAntialiasing;
    [FieldOffset(0x0014)] public byte bEnableBold;
    [FieldOffset(0x0014)] public byte bEnableItalic;
    [FieldOffset(0x0014)] public byte bEnableUnderline;
    [FieldOffset(0x0014)] public byte bAlphaOnly;
    [FieldOffset(0x0018)] public EFontImportCharacterSet CharacterSet;
    [FieldOffset(0x0020)] public FString Chars;
    [FieldOffset(0x0030)] public FString UnicodeRange;
    [FieldOffset(0x0040)] public FString CharsFilePath;
    [FieldOffset(0x0050)] public FString CharsFileWildcard;
    [FieldOffset(0x0060)] public byte bCreatePrintableOnly;
    [FieldOffset(0x0060)] public byte bIncludeASCIIRange;
    [FieldOffset(0x0064)] public FLinearColor ForegroundColor;
    [FieldOffset(0x0074)] public byte bEnableDropShadow;
    [FieldOffset(0x0078)] public int TexturePageWidth;
    [FieldOffset(0x007C)] public int TexturePageMaxHeight;
    [FieldOffset(0x0080)] public int XPadding;
    [FieldOffset(0x0084)] public int YPadding;
    [FieldOffset(0x0088)] public int ExtendBoxTop;
    [FieldOffset(0x008C)] public int ExtendBoxBottom;
    [FieldOffset(0x0090)] public int ExtendBoxRight;
    [FieldOffset(0x0094)] public int ExtendBoxLeft;
    [FieldOffset(0x0098)] public byte bEnableLegacyMode;
    [FieldOffset(0x009C)] public int Kerning;
    [FieldOffset(0x00A0)] public byte bUseDistanceFieldAlpha;
    [FieldOffset(0x00A4)] public int DistanceFieldScaleFactor;
    [FieldOffset(0x00A8)] public float DistanceFieldScanRadiusScale;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1D0)] 
public unsafe struct UFont
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public EFontCacheType FontCacheType;
    [FieldOffset(0x0038)] public TArray<FFontCharacter> Characters;
    [FieldOffset(0x0048)] public TArray<IntPtr> Textures;
    [FieldOffset(0x0058)] public int IsRemapped;
    [FieldOffset(0x005C)] public float EmScale;
    [FieldOffset(0x0060)] public float Ascent;
    [FieldOffset(0x0064)] public float Descent;
    [FieldOffset(0x0068)] public float Leading;
    [FieldOffset(0x006C)] public int Kerning;
    [FieldOffset(0x0070)] public FFontImportOptionsData ImportOptions;
    [FieldOffset(0x0120)] public int NumCharacters;
    [FieldOffset(0x0128)] public TArray<int> MaxCharHeight;
    [FieldOffset(0x0138)] public float ScalingFactor;
    [FieldOffset(0x013C)] public int LegacyFontSize;
    [FieldOffset(0x0140)] public FName LegacyFontName;
    [FieldOffset(0x0148)] public FCompositeFont CompositeFont;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UFontFace
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public FString SourceFilename;
    [FieldOffset(0x0040)] public EFontHinting Hinting;
    [FieldOffset(0x0041)] public EFontLoadingPolicy LoadingPolicy;
    [FieldOffset(0x0042)] public EFontLayoutMethod LayoutMethod;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD8)] 
public unsafe struct UFontImportOptions
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public FFontImportOptionsData Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB0)] 
public unsafe struct FForceFeedbackAttenuationSettings
{
    [FieldOffset(0x0000)] public FBaseAttenuationSettings baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD8)] 
public unsafe struct UForceFeedbackAttenuation
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public FForceFeedbackAttenuationSettings Attenuation;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2E0)] 
public unsafe struct UForceFeedbackComponent
{
    [FieldOffset(0x0000)] public USceneComponent baseObj;
    [FieldOffset(0x01F8)] public UForceFeedbackEffect* ForceFeedbackEffect;
    [FieldOffset(0x0200)] public byte bAutoDestroy;
    [FieldOffset(0x0200)] public byte bStopWhenOwnerDestroyed;
    [FieldOffset(0x0200)] public byte bLooping;
    [FieldOffset(0x0200)] public byte bIgnoreTimeDilation;
    [FieldOffset(0x0200)] public byte bOverrideAttenuation;
    [FieldOffset(0x0204)] public float IntensityMultiplier;
    [FieldOffset(0x0208)] public UForceFeedbackAttenuation* AttenuationSettings;
    [FieldOffset(0x0210)] public FForceFeedbackAttenuationSettings AttenuationOverrides;
}

[StructLayout(LayoutKind.Explicit, Size = 0x90)] 
public unsafe struct FForceFeedbackChannelDetails
{
    [FieldOffset(0x0000)] public byte bAffectsLeftLarge;
    [FieldOffset(0x0000)] public byte bAffectsLeftSmall;
    [FieldOffset(0x0000)] public byte bAffectsRightLarge;
    [FieldOffset(0x0000)] public byte bAffectsRightSmall;
    [FieldOffset(0x0008)] public FRuntimeFloatCurve Curve;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UForceFeedbackEffect
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TArray<FForceFeedbackChannelDetails> ChannelDetails;
    [FieldOffset(0x0038)] public float Duration;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD70)] 
public unsafe struct UGameEngine
{
    [FieldOffset(0x0000)] public UEngine baseObj;
    [FieldOffset(0x0D20)] public float MaxDeltaTime;
    [FieldOffset(0x0D24)] public float ServerFlushLogInterval;
    [FieldOffset(0x0D28)] public UGameInstance* GameInstance;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2D0)] 
public unsafe struct AGameNetworkManager
{
    [FieldOffset(0x0000)] public AInfo baseObj;
    [FieldOffset(0x0220)] public float BadPacketLossThreshold;
    [FieldOffset(0x0224)] public float SeverePacketLossThreshold;
    [FieldOffset(0x0228)] public int BadPingThreshold;
    [FieldOffset(0x022C)] public int SeverePingThreshold;
    [FieldOffset(0x0230)] public int AdjustedNetSpeed;
    [FieldOffset(0x0234)] public float LastNetSpeedUpdateTime;
    [FieldOffset(0x0238)] public int TotalNetBandwidth;
    [FieldOffset(0x023C)] public int MinDynamicBandwidth;
    [FieldOffset(0x0240)] public int MaxDynamicBandwidth;
    [FieldOffset(0x0244)] public byte bIsStandbyCheckingEnabled;
    [FieldOffset(0x0244)] public byte bHasStandbyCheatTriggered;
    [FieldOffset(0x0248)] public float StandbyRxCheatTime;
    [FieldOffset(0x024C)] public float StandbyTxCheatTime;
    [FieldOffset(0x0250)] public float PercentMissingForRxStandby;
    [FieldOffset(0x0254)] public float PercentMissingForTxStandby;
    [FieldOffset(0x0258)] public float PercentForBadPing;
    [FieldOffset(0x025C)] public float JoinInProgressStandbyWaitTime;
    [FieldOffset(0x0260)] public float MoveRepSize;
    [FieldOffset(0x0264)] public float MAXPOSITIONERRORSQUARED;
    [FieldOffset(0x0268)] public float MAXNEARZEROVELOCITYSQUARED;
    [FieldOffset(0x026C)] public float CLIENTADJUSTUPDATECOST;
    [FieldOffset(0x0270)] public float MAXCLIENTUPDATEINTERVAL;
    [FieldOffset(0x0274)] public float MaxClientForcedUpdateDuration;
    [FieldOffset(0x0278)] public float ServerForcedUpdateHitchThreshold;
    [FieldOffset(0x027C)] public float ServerForcedUpdateHitchCooldown;
    [FieldOffset(0x0280)] public float MaxMoveDeltaTime;
    [FieldOffset(0x0284)] public float MaxClientSmoothingDeltaTime;
    [FieldOffset(0x0288)] public float ClientNetSendMoveDeltaTime;
    [FieldOffset(0x028C)] public float ClientNetSendMoveDeltaTimeThrottled;
    [FieldOffset(0x0290)] public float ClientNetSendMoveDeltaTimeStationary;
    [FieldOffset(0x0294)] public int ClientNetSendMoveThrottleAtNetSpeed;
    [FieldOffset(0x0298)] public int ClientNetSendMoveThrottleOverPlayerCount;
    [FieldOffset(0x029C)] public bool ClientAuthorativePosition;
    [FieldOffset(0x02A0)] public float ClientErrorUpdateRateLimit;
    [FieldOffset(0x02A4)] public float ClientNetCamUpdateDeltaTime;
    [FieldOffset(0x02A8)] public float ClientNetCamUpdatePositionLimit;
    [FieldOffset(0x02AC)] public bool bMovementTimeDiscrepancyDetection;
    [FieldOffset(0x02AD)] public bool bMovementTimeDiscrepancyResolution;
    [FieldOffset(0x02B0)] public float MovementTimeDiscrepancyMaxTimeMargin;
    [FieldOffset(0x02B4)] public float MovementTimeDiscrepancyMinTimeMargin;
    [FieldOffset(0x02B8)] public float MovementTimeDiscrepancyResolutionRate;
    [FieldOffset(0x02BC)] public float MovementTimeDiscrepancyDriftAllowance;
    [FieldOffset(0x02C0)] public bool bMovementTimeDiscrepancyForceCorrectionsDuringResolution;
    [FieldOffset(0x02C1)] public bool bUseDistanceBasedRelevancy;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct FPredictProjectilePathParams
{
    [FieldOffset(0x0000)] public FVector StartLocation;
    [FieldOffset(0x000C)] public FVector LaunchVelocity;
    [FieldOffset(0x0018)] public bool bTraceWithCollision;
    [FieldOffset(0x001C)] public float ProjectileRadius;
    [FieldOffset(0x0020)] public float MaxSimTime;
    [FieldOffset(0x0024)] public bool bTraceWithChannel;
    [FieldOffset(0x0025)] public ECollisionChannel TraceChannel;
    [FieldOffset(0x0028)] public TArray<EObjectTypeQuery> ObjectTypes;
    [FieldOffset(0x0038)] public TArray<IntPtr> ActorsToIgnore;
    [FieldOffset(0x0048)] public float SimFrequency;
    [FieldOffset(0x004C)] public float OverrideGravityZ;
    [FieldOffset(0x0050)] public EDrawDebugTrace DrawDebugType;
    [FieldOffset(0x0054)] public float DrawDebugTime;
    [FieldOffset(0x0058)] public bool bTraceComplex;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C)] 
public unsafe struct FPredictProjectilePathPointData
{
