using System.Runtime.InteropServices;

namespace P3R.ModLib.Native;

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UAppDataAsset
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FActivityTaskData
{
    [FieldOffset(0x0000)] public FName EndFlag;
    [FieldOffset(0x0008)] public int EndFloorNo;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FActivityData
{
    [FieldOffset(0x0000)] public byte StartMonth;
    [FieldOffset(0x0001)] public byte StartDay;
    [FieldOffset(0x0002)] public ushort MinFloorNo;
    [FieldOffset(0x0004)] public ushort MaxFloorNo;
    [FieldOffset(0x0008)] public FName StartFlag;
    [FieldOffset(0x0010)] public FName EndFlag;
    [FieldOffset(0x0018)] public TArray<FActivityTaskData> TaskIds;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UActivityDataAsset
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FActivityData> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x278)] 
public unsafe struct AAppActor
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0230)] public EAppPauseObjectFlag AppPauseFlags;
}

[StructLayout(LayoutKind.Explicit, Size = 0x288)] 
public unsafe struct AActivityTest
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UDebugMenu* DebugMenu_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UAddContent
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0038)] public ADLCManager* mDlcManager;
    [FieldOffset(0x0040)] public AAddContentDialog* mAdcDialog;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3E8)] 
public unsafe struct AAddContentDialog
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x03D8)] public ADLCManager* mDlcManager;
    [FieldOffset(0x03E0)] public AUIProgressBarDraw* mProgressBar;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct FAddContentEntitlement
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public bool Enabled;
    [FieldOffset(0x0009)] public EAddContentEntitlementCategory Categories;
    [FieldOffset(0x0010)] public int Items;
    [FieldOffset(0x0028)] public FString PsEntitlementLabel;
    [FieldOffset(0x0038)] public FString MsStoreId;
    [FieldOffset(0x0048)] public uint SteamAppId;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UAddContentEntitlementDataAsset
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FAddContentEntitlement> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FBaseCurveAnimation
{
    [FieldOffset(0x0018)] public UAssetLoader* m_pAssetLoader;
    [FieldOffset(0x0020)] public UCurveBase* m_pCurve;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FCurveVectorAnimation
{
    [FieldOffset(0x0000)] public FBaseCurveAnimation baseObj;
    [FieldOffset(0x0028)] public UCurveVector* m_pCurveVector;
}

[StructLayout(LayoutKind.Explicit, Size = 0x370)] 
public unsafe struct UAgePanel
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0038)] public USprAsset* _readSpr;
    [FieldOffset(0x0040)] public UMaterial* _readMat;
    [FieldOffset(0x0050)] public UMaterialInstanceDynamic* _readMatInst;
    [FieldOffset(0x0060)] public FCurveVectorAnimation _fadeCurve;
    [FieldOffset(0x02E8)] public UAssetLoader* Loader_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UAnimController
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TArray<FName> mAnimNameArray;
    [FieldOffset(0x0038)] public TArray<IntPtr> mSkMeshCompArray;
    [FieldOffset(0x0048)] public TArray<IntPtr> mMontageArray;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UAnimNotify_BtlPlayMontageNotify
{
    [FieldOffset(0x0000)] public UAnimNotify_PlayMontageNotify baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FAtlSlotMultiAnimationParam
{
    [FieldOffset(0x0000)] public UAnimSequenceBase* Animation;
    [FieldOffset(0x0008)] public float StartOffset;
    [FieldOffset(0x000C)] public float EndOffset;
    [FieldOffset(0x0010)] public float BlendIn;
    [FieldOffset(0x0014)] public float BlendOut;
    [FieldOffset(0x0018)] public float PlayRate;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UAnimNotify_PlayEvtMultiMontage
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
    [FieldOffset(0x0038)] public TArray<FAtlSlotMultiAnimationParam> MontageArray;
    [FieldOffset(0x0048)] public FName SlotNodeName;
    [FieldOffset(0x0050)] public EEvtCharaAnimationType AnimationType;
    [FieldOffset(0x0051)] public bool bStop;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC0)] 
public unsafe struct UAppActivity
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
    [FieldOffset(0x0048)] public UAssetLoader* Loader_;
    [FieldOffset(0x0050)] public UActivityDataAsset* DataAsset_;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC8)] 
public unsafe struct UAppActorComponent
{
    [FieldOffset(0x0000)] public UActorComponent baseObj;
    [FieldOffset(0x00C0)] public EAppPauseObjectFlag AppPauseFlags;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FAppAnimSequence
{
    [FieldOffset(0x0000)] public UAnimSequence* pAnimSequence;
}

[StructLayout(LayoutKind.Explicit, Size = 0x98)] 
public unsafe struct UAppAnimCtrl
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public TSubclassOf<ACharacter> pCharacterClass;
    [FieldOffset(0x0038)] public ACharacter* pCharacter;
    [FieldOffset(0x0040)] public USkeletalMesh* pSkeletalMesh;
    [FieldOffset(0x0048)] public ASkeletalMeshActor* pSkelMeshAct;
    [FieldOffset(0x0050)] public USkeletalMeshComponent* pSkMeshCompo;
    [FieldOffset(0x0058)] public TArray<FAppAnimSequence> animSeqAry;
    [FieldOffset(0x0068)] public TArray<IntPtr> mMontageAry;
    [FieldOffset(0x0078)] public TArray<float> mSeqLengthAry;
    [FieldOffset(0x0090)] public UAssetLoader* pAssetLoader;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FAppCharTransparency
{
    [FieldOffset(0x0000)] public float Opacity;
    [FieldOffset(0x0004)] public float MaxOpacity;
    [FieldOffset(0x0008)] public bool bLarge;
}

[StructLayout(LayoutKind.Explicit, Size = 0x300)] 
public unsafe struct UAppCharBaseComp
{
    [FieldOffset(0x0000)] public UActorComponent baseObj;
    [FieldOffset(0x00E0)] public AActor* mMotionAttached_;
    [FieldOffset(0x00E8)] public FName mMotionAttachedSocketName_;
    [FieldOffset(0x00F0)] public FTransform mMotionAttachedTransform;
    [FieldOffset(0x0120)] public bool mMotionDetachPrepared_;
    [FieldOffset(0x0121)] public bool bMotionDetachPreparedTransKeep_;
    [FieldOffset(0x0122)] public bool bMotionDetachPreparedRelativeTrans_;
    [FieldOffset(0x0124)] public FRotator mMotionDetachPreparedRelativeRotator_;
    [FieldOffset(0x0130)] public FVector mMotionDetachPreparedRelativeLocation_;
    [FieldOffset(0x0150)] public int mFadeType_;
    [FieldOffset(0x0154)] public int mFadeFrame_;
    [FieldOffset(0x0158)] public int mFadePattern_;
    [FieldOffset(0x0190)] public bool mDelayPauseAnimReq_;
    [FieldOffset(0x0191)] public bool mDelayPauseAnimFlag_;
    [FieldOffset(0x0194)] public float mDelayPauseAnimSpeedRate_;
    [FieldOffset(0x0198)] public TSoftClassPtr<AAppPropsCore> mBagClassPtr_;
    [FieldOffset(0x01C0)] public FName mBagAttachSocketName;
    [FieldOffset(0x01C8)] public FName mBagAnimSlotName_;
    [FieldOffset(0x01D0)] public TMap<EAppCharBagAnimType, IntPtr> mBagAnims_;
    [FieldOffset(0x0220)] public AAppPropsCore* mBagActor_;
    [FieldOffset(0x0228)] public bool bIsLockedLookAt_;
    [FieldOffset(0x0229)] public byte mLockedLookAtType_;
    [FieldOffset(0x022C)] public float mLockedLookAtSpeed_;
    [FieldOffset(0x0230)] public USkeletalMeshComponent* CostumeMesh;
    [FieldOffset(0x0238)] public USkeletalMeshComponent* HairMesh;
    [FieldOffset(0x0240)] public USkeletalMeshComponent* FaceMesh;
    [FieldOffset(0x0248)] public UAppCharFootstepsAtom* FootstepsAtom;
    [FieldOffset(0x0250)] public UAnimMontage* AnimMontage_DefaultSlot;
    [FieldOffset(0x0258)] public UAnimMontage* AnimMontage_FacialSlot;
    [FieldOffset(0x0260)] public UAnimMontage* AnimMontage_NeckSlot;
    [FieldOffset(0x0268)] public UAnimMontage* AnimMontage_TurnSlot;
    [FieldOffset(0x0278)] public UAnimMontage* AnimMontage_HavBagSlot;
    [FieldOffset(0x0280)] public EAppCharCategoryType CategoryID;
    [FieldOffset(0x0284)] public int IndexID;
    [FieldOffset(0x0288)] public int CostumeID;
    [FieldOffset(0x028C)] public EAnimPackID AnimPackID;
    [FieldOffset(0x0290)] public UAppCharAnimDataAsset* AnimPack;
    [FieldOffset(0x0298)] public UAppCharFaceAnimDataAsset* FaceAnimPack;
    [FieldOffset(0x02A0)] public EAppCharWeaponType WeaponType;
    [FieldOffset(0x02A4)] public int WeaponId;
    [FieldOffset(0x02A8)] public TArray<IntPtr> Weapons;
    [FieldOffset(0x02B8)] public bool bBagEnable;
    [FieldOffset(0x02BC)] public int ShoesID;
    [FieldOffset(0x02C0)] public EAppCharState State;
    [FieldOffset(0x02C4)] public FVector MoveLocation;
    [FieldOffset(0x02D0)] public float MoveSpeed;
    [FieldOffset(0x02D4)] public bool bTransparencyEnable;
    [FieldOffset(0x02D8)] public FAppCharTransparency Transparency;
}

[StructLayout(LayoutKind.Explicit, Size = 0x370)] 
public unsafe struct UAppCharacterComp
{
    [FieldOffset(0x0000)] public UAppCharBaseComp baseObj;
    [FieldOffset(0x02F8)] public float mBagMotionBlendTime_StandToRun_;
    [FieldOffset(0x02FC)] public float mBagMotionBlendTime_RunToStand_;
    [FieldOffset(0x0300)] public bool bIsBagSetting_;
    [FieldOffset(0x0301)] public bool bIsBagRun_;
    [FieldOffset(0x0304)] public int mBagKeyID_;
    [FieldOffset(0x0308)] public int mOverwirteBagKeyID_;
    [FieldOffset(0x030C)] public bool bIsBagInvalidIK_;
    [FieldOffset(0x0310)] public ACharacterBaseCore* Character;
    [FieldOffset(0x0318)] public bool bNeedInitialize;
    [FieldOffset(0x0320)] public UAppCharLoader* Loader;
    [FieldOffset(0x0328)] public TArray<IntPtr> EffectWeapons;
    [FieldOffset(0x0338)] public TArray<int> HideMaterialIDs;
    [FieldOffset(0x0358)] public int mSetCostumeID;
    [FieldOffset(0x035C)] public int mSetWeaponType;
    [FieldOffset(0x0360)] public int mSetWeaponModelID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UAppCharacterPoolManager
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAppCharLoader* Loader;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UAppCharAnimAttachNotify
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
    [FieldOffset(0x0038)] public FName mSocketName_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x80)] 
public unsafe struct UAppCharAnimDetachNotify
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
    [FieldOffset(0x0038)] public bool bDetachTrans_;
    [FieldOffset(0x0040)] public FTransform mRelativeTrans_;
    [FieldOffset(0x0070)] public bool bRelativeTrans_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x80)] 
public unsafe struct UAppCharAnimDetachPrepareNotify
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
    [FieldOffset(0x0038)] public bool bDetachTrans_;
    [FieldOffset(0x0040)] public FTransform mRelativeTrans_;
    [FieldOffset(0x0070)] public bool bRelativeTrans_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UAppCharAttachedPropsAnimNotify
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
    [FieldOffset(0x0038)] public int mAnimePackIndex_;
    [FieldOffset(0x003C)] public int mPlayType_;
}

[StructLayout(LayoutKind.Explicit, Size = 0xE0)] 
public unsafe struct UAppCharAnimDataAsset
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
    [FieldOffset(0x0030)] public EAnimPackID PackId;
    [FieldOffset(0x0031)] public EAppCharCategoryType Category;
    [FieldOffset(0x0034)] public int CharId;
    [FieldOffset(0x0038)] public UClass* AnimInstance;
    [FieldOffset(0x0040)] public TMap<int, IntPtr> SpecialAnimInstance;
    [FieldOffset(0x0090)] public TMap<int, IntPtr> Anims;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UAppCharAnimFadeNotify
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UAppCharAnimLockLookAtNotify
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
    [FieldOffset(0x0038)] public float mInterpSpeed_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UAppCharAnimUnlockLookAtNotify
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UAppCharAnimStopTimingNotify
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
    [FieldOffset(0x0038)] public bool mLookAtFlag_;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA0)] 
public unsafe struct FAppNpcCostumePartsData
{
    [FieldOffset(0x0000)] public TSoftObjectPtr<USkeletalMesh> Mesh;
    [FieldOffset(0x0028)] public TSoftClassPtr<UObject> Anim;
    [FieldOffset(0x0050)] public TMap<int, TSoftObjectPtr<UTexture2D>> Texture;
}

[StructLayout(LayoutKind.Explicit, Size = 0x230)] 
public unsafe struct FAppNpcUniqueCostumeData
{
    [FieldOffset(0x0000)] public TMap<EAnimPackID, TSoftObjectPtr<UAppCharAnimDataAsset>> Anims;
    [FieldOffset(0x0050)] public FAppNpcCostumePartsData Costume;
    [FieldOffset(0x00F0)] public FAppNpcCostumePartsData Hair;
    [FieldOffset(0x0190)] public FAppNpcCostumePartsData Face;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C0)] 
public unsafe struct UAppNpcCostume_DA
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
    [FieldOffset(0x0030)] public int Type;
    [FieldOffset(0x0034)] public FVector MeshLocation;
    [FieldOffset(0x0040)] public TMap<EAnimPackID, TSoftObjectPtr<UAppCharAnimDataAsset>> Anims;
    [FieldOffset(0x0090)] public FAppNpcCostumePartsData Base;
    [FieldOffset(0x0130)] public TMap<int, FAppNpcCostumePartsData> CostumeSummer;
    [FieldOffset(0x0180)] public TMap<int, FAppNpcCostumePartsData> CostumeWinter;
    [FieldOffset(0x01D0)] public TMap<int, FAppNpcCostumePartsData> Hair;
    [FieldOffset(0x0220)] public TMap<int, FAppNpcCostumePartsData> Face;
    [FieldOffset(0x0270)] public TMap<int, FAppNpcUniqueCostumeData> Unique;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct UAppCharFaceAnimDataAsset
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
    [FieldOffset(0x0030)] public EAppCharCategoryType Category;
    [FieldOffset(0x0034)] public int CharId;
    [FieldOffset(0x0038)] public TMap<int, IntPtr> Anims;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FUAppCharFootstepsLabel
{
    [FieldOffset(0x0000)] public FString Walk;
    [FieldOffset(0x0010)] public FString Run;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FAppCharFootstepsOverwrite
{
    [FieldOffset(0x0000)] public AActor* mOverwriteActor;
    [FieldOffset(0x0008)] public FUAppCharFootstepsLabel mLable;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1100)] 
public unsafe struct UAppCharFootstepsAtom
{
    [FieldOffset(0x0000)] public UAtomComponent baseObj;
    [FieldOffset(0x1098)] public FUAppCharFootstepsLabel Lable;
    [FieldOffset(0x10B8)] public FUAppCharFootstepsLabel DefaultLable;
    [FieldOffset(0x10D8)] public AActor* OverwriteActor;
    [FieldOffset(0x10E0)] public TArray<FAppCharFootstepsOverwrite> mKeepOverwrites_;
    [FieldOffset(0x10F0)] public bool bEnable;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct FUAppCharFootstepsMajor
{
    [FieldOffset(0x0000)] public TMap<int, FUAppCharFootstepsLabel> Minor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct FUAppCharFootstepsCue
{
    [FieldOffset(0x0000)] public USoundAtomCue* Common;
    [FieldOffset(0x0008)] public TMap<int, IntPtr> Costume;
}

[StructLayout(LayoutKind.Explicit, Size = 0x130)] 
public unsafe struct UAppCharFootstepsDataAsset
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
    [FieldOffset(0x0030)] public TMap<int, FUAppCharFootstepsMajor> Field;
    [FieldOffset(0x0080)] public TMap<int, FUAppCharFootstepsMajor> Battle;
    [FieldOffset(0x00D0)] public USoundAtomCue* CommonCue;
    [FieldOffset(0x00D8)] public USoundAtomCue* NpcCue;
    [FieldOffset(0x00E0)] public TMap<int, FUAppCharFootstepsCue> CharCue;
}

[StructLayout(LayoutKind.Explicit, Size = 0x148)] 
public unsafe struct UAppCharFootstepsTable
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TSoftObjectPtr<UAppCharFootstepsDataAsset> Path;
    [FieldOffset(0x0050)] public UAppCharFootstepsDataAsset* Data;
    [FieldOffset(0x0058)] public bool bLoaded;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UAppCharFootstepsNotify
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
    [FieldOffset(0x0038)] public EAppCharFootstepsType Type;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4A0)] 
public unsafe struct UAppCharFootstepsTriggerComp_BOX
{
    [FieldOffset(0x0000)] public UBoxComponent baseObj;
    [FieldOffset(0x0478)] public FUAppCharFootstepsLabel mLabel_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x490)] 
public unsafe struct UAppCharFootstepsTriggerComp_CIRCLE
{
    [FieldOffset(0x0000)] public USphereComponent baseObj;
    [FieldOffset(0x0470)] public FUAppCharFootstepsLabel mLabel_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct AAppCharFootstepsTriggerVolume
{
    [FieldOffset(0x0000)] public ATriggerVolume baseObj;
    [FieldOffset(0x0258)] public FUAppCharFootstepsLabel mLabel_;
    [FieldOffset(0x0278)] public bool mTimeNoon_;
    [FieldOffset(0x0279)] public bool mTimeAfternoon_;
    [FieldOffset(0x027A)] public bool mTimeNight_;
    [FieldOffset(0x027B)] public bool mTimeShadow_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UAppCharLib
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x90)] 
public unsafe struct UAppCharLoader
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0078)] public TArray<IntPtr> Assets;
}

[StructLayout(LayoutKind.Explicit, Size = 0x240)] 
public unsafe struct AAppCharTransparencyArea
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public UCapsuleComponent* CapsuleComp;
    [FieldOffset(0x0228)] public float Opacity;
    [FieldOffset(0x022C)] public float Speed;
    [FieldOffset(0x0230)] public float Distance;
    [FieldOffset(0x0234)] public float MobDistance;
    [FieldOffset(0x0238)] public float LargeDistance;
    [FieldOffset(0x023C)] public int Priority;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct UAppCharWeaponAnimDataAsset
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
    [FieldOffset(0x0030)] public int WaitAnimNo;
    [FieldOffset(0x0038)] public TMap<int, IntPtr> Anims;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FAppCharWeaponMeshData
{
    [FieldOffset(0x0000)] public TSoftObjectPtr<USkeletalMesh> Mesh;
    [FieldOffset(0x0028)] public bool MultiEquip;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FAppCharWeapoAnimAssetTypeData
{
    [FieldOffset(0x0000)] public AppCharWeaponUsageEnv UsageEnv;
    [FieldOffset(0x0008)] public TSoftObjectPtr<UAppCharWeaponAnimDataAsset> Asset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x90)] 
public unsafe struct FAppCharWeaponTableRow
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public TMap<int, FAppCharWeaponMeshData> Data;
    [FieldOffset(0x0058)] public TSoftClassPtr<UObject> Anim;
    [FieldOffset(0x0080)] public TArray<FAppCharWeapoAnimAssetTypeData> AnimAsset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x448)] 
public unsafe struct AAppCharWeaponBase
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public int PlayerId;
    [FieldOffset(0x0280)] public USceneComponent* Root;
    [FieldOffset(0x0288)] public USkeletalMeshComponent* Mesh;
    [FieldOffset(0x0290)] public FAppCharWeaponTableRow WeaponTbl;
    [FieldOffset(0x0320)] public FName AttachSocketName;
    [FieldOffset(0x0328)] public int HideMaterialID;
    [FieldOffset(0x0330)] public UAppCharWeaponAnimDataAsset* AnimPack;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct UAppCheatManager
{
    [FieldOffset(0x0000)] public UCheatManager baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UAppChunkInstall
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UAppMultiDataAsset
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x370)] 
public unsafe struct UAppKoromaruComp
{
    [FieldOffset(0x0000)] public UAppCharacterComp baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x238)] 
public unsafe struct AAppLvMngUnloadMonitorActor
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public int mUniqueId_;
    [FieldOffset(0x0224)] public FName mLevelName_;
    [FieldOffset(0x0230)] public UAppLevelManager* mManager_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FAppLevelData
{
    [FieldOffset(0x0000)] public EAppLevelType mType;
    [FieldOffset(0x0004)] public int mReferenceCounter;
}

[StructLayout(LayoutKind.Explicit, Size = 0x98)] 
public unsafe struct UAppLevelManager
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
    [FieldOffset(0x0030)] public TMap<FName, FAppLevelData> mLevelTable_;
    [FieldOffset(0x0080)] public TArray<IntPtr> mMonitors_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x250)] 
public unsafe struct AApplicationWindowState
{
    [FieldOffset(0x0000)] public AActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x340)] 
public unsafe struct UAppNpcComp
{
    [FieldOffset(0x0000)] public UAppCharBaseComp baseObj;
    [FieldOffset(0x02F8)] public ANpcBaseCore* mBaseCore_;
    [FieldOffset(0x0330)] public UAppCharLoader* Loader;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IAppPauseableListener
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FPauseDebugItem
{
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UAppPauseList
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TArray<TScriptInterface<IAppPauseableListener>> List;
    [FieldOffset(0x0038)] public TArray<FPauseDebugItem> DebugList;
    [FieldOffset(0x0048)] public TArray<FName> WarningObjectNames;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct UAppPauseManagerSubsystem
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
    [FieldOffset(0x0030)] public TArray<EAppPauseType> PauseFlow;
    [FieldOffset(0x0040)] public UAppPauseList* AppPauseables;
    [FieldOffset(0x0048)] public UAppPauseList* AppPaused;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct UAppPropsAnimPackAsset
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
    [FieldOffset(0x0030)] public EAppPropsAnimPackType PackType;
    [FieldOffset(0x0038)] public TMap<int, IntPtr> Anims;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FAppPropsCardParam
{
    [FieldOffset(0x0000)] public EAppPropsCardType Type;
    [FieldOffset(0x0004)] public int ID;
    [FieldOffset(0x0008)] public int Rank;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IAppPropsCardInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FAppPropsCardData
{
    [FieldOffset(0x0000)] public FAppPropsCardParam Param;
    [FieldOffset(0x0010)] public AAppPropsCore* Card;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B0)] 
public unsafe struct AAppPropsCardContainer
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UAssetLoader* Loader;
    [FieldOffset(0x0288)] public TArray<FAppPropsCardData> CardList;
    [FieldOffset(0x0298)] public TSubclassOf<AAppPropsCore> PersonaCardClass;
    [FieldOffset(0x02A0)] public TSubclassOf<AAppPropsCore> MajorCardClass;
    [FieldOffset(0x02A8)] public TSubclassOf<AAppPropsCore> MinorCardClass;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct AAppPropsCore
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public FName mOnFlagName_;
    [FieldOffset(0x0280)] public FName mOffFlagName_;
    [FieldOffset(0x0288)] public USceneComponent* Root;
    [FieldOffset(0x0290)] public USkeletalMeshComponent* SkeletalMesh;
    [FieldOffset(0x0298)] public UAppPropsAnimPackAsset* mAnimePackAsset_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x98)] 
public unsafe struct UAssetHolder
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TArray<FSoftObjectPath> HoldAssets;
    [FieldOffset(0x0070)] public TArray<IntPtr> loadedAssets;
    [FieldOffset(0x0080)] public TArray<IntPtr> ChildHolders;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct UAssetLoader
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x288)] 
public unsafe struct AAssistTest
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UAssetLoader* Loader_;
    [FieldOffset(0x0280)] public UBmdAsset* BmdAsset_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x288)] 
public unsafe struct AAssistViewTest
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UAssetLoader* Loader_;
    [FieldOffset(0x0280)] public UBmdAsset* BmdAsset_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct FAtlEvtNiagaraSystemPool
{
    [FieldOffset(0x0010)] public ACharacter* AttachToCharacter;
}

[StructLayout(LayoutKind.Explicit, Size = 0x268)] 
public unsafe struct UAtlEvtActorComponent
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x00C8)] public AActor* AttachPropActor;
    [FieldOffset(0x00D0)] public EAtlEvtLocomotionTeleportVelocityType LocomotionTeleportVelocityType;
    [FieldOffset(0x00D4)] public float LocomotionTeleportDistanceThreshold;
    [FieldOffset(0x00D8)] public FVector LocomotionTeleportVelocityConstant;
    [FieldOffset(0x00E4)] public FVector2D LocomotionTeleportVelocityClampMinMax;
    [FieldOffset(0x00EC)] public int LipUniqueID;
    [FieldOffset(0x00F0)] public TWeakObjectPtr<UNiagaraComponent> HandwritingComp;
    [FieldOffset(0x00F8)] public TWeakObjectPtr<AHandwritingSpawner> HandwritingSpawner;
    [FieldOffset(0x0100)] public ACharacter* OwnerCharacter;
    [FieldOffset(0x0108)] public ANpcBaseCore* OwnerNpc;
    [FieldOffset(0x0110)] public UAppCharBaseComp* AppCharaBaseComp;
    [FieldOffset(0x0118)] public FAtlEvtNiagaraSystemPool EvtNiagaraSystemPool;
    [FieldOffset(0x0260)] public bool bUseAnimPack;
    [FieldOffset(0x0261)] public EAnimPackID OverrideAnimPackID;
    [FieldOffset(0x0262)] public bool bEnableAtlEvtLocomotionVelocitySimulation;
    [FieldOffset(0x0263)] public bool bEnableAtlEvtBag;
    [FieldOffset(0x0264)] public EAppCharShoesID ShoesID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x288)] 
public unsafe struct AAtlEvtAnswerActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0280)] public AAppActor* mNetAnswer_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UAtlEvtHelperSettings
{
    [FieldOffset(0x0000)] public UDeveloperSettings baseObj;
    [FieldOffset(0x0038)] public bool bLoadSublevelsInAEvent;
    [FieldOffset(0x0039)] public bool bUseSimulateDate;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B8)] 
public unsafe struct AAtlEvtEventEditHelper
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public bool bLoadAllSublevels;
    [FieldOffset(0x0280)] public FString EventSublevelName;
    [FieldOffset(0x0290)] public EAtlEvtEventCategoryType EventCategoryType;
    [FieldOffset(0x0291)] public bool bFieldEventInterpFieldCamera;
    [FieldOffset(0x0292)] public ECldTimeZone PreviewTimeZone;
    [FieldOffset(0x0293)] public ECldSeason PreviewSeason;
    [FieldOffset(0x0294)] public bool bPreviewCrowd;
    [FieldOffset(0x0298)] public int PreviewCrowdMonth;
    [FieldOffset(0x029C)] public int PreviewCrowdDay;
    [FieldOffset(0x02A0)] public ECldTimeZone PreviewCrowdTimeZone;
    [FieldOffset(0x02AC)] public TWeakObjectPtr<AInitReadActor> InitReadActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FAtlEvtEventManagerMovieSceneOperator
{
}

[StructLayout(LayoutKind.Explicit, Size = 0x370)] 
public unsafe struct AAtlEvtEventManager
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public AActor* FieldCameraActor;
    [FieldOffset(0x0280)] public AActor* MovieSceneCameraActor;
    [FieldOffset(0x0289)] public EEventManagerEventRank EventRank;
    [FieldOffset(0x0298)] public UEventSkipWidgetDelegate* EventSkipWidget;
    [FieldOffset(0x02A0)] public TSubclassOf<UEventSkipWidgetDelegate> EventSkipWidgetClass;
    [FieldOffset(0x02AC)] public FAtlEvtEventManagerMovieSceneOperator MovieSceneOperator;
    [FieldOffset(0x02B8)] public UBmdAsset* mpBmdAsset;
    [FieldOffset(0x02C8)] public TArray<uint> MsgUniqIDList;
    [FieldOffset(0x02D8)] public int BmdAssetMsgID;
    [FieldOffset(0x02DC)] public int ExecutingMessageNo;
    [FieldOffset(0x02E5)] public EEventManagerMessageState MessageState;
    [FieldOffset(0x0300)] public AScrActor* ScrActor;
    [FieldOffset(0x0308)] public AUIBackLog* UIBackLogActor;
    [FieldOffset(0x0318)] public AUIVoiceAnswer* UINetAnswerActor;
    [FieldOffset(0x0330)] public UMovieSceneSequencePlayer* EventSequencePlayer;
    [FieldOffset(0x0340)] public int RequestedSeqClosedEventMessageID;
    [FieldOffset(0x0344)] public EEventManagerSeqControllerState SeqControllerState;
    [FieldOffset(0x0350)] public AAtlEvtEventManager_PauseActor* PauseControllerActor;
    [FieldOffset(0x0360)] public UAtlEvtMoviePlayManager* MoviePlayManager;
}

[StructLayout(LayoutKind.Explicit, Size = 0x308)] 
public unsafe struct AAtlEvtEventManager_PauseActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public AAtlEvtEventManager* OwnerManagerActor;
    [FieldOffset(0x0288)] public UEvtManagerStateBase* CurrentAtlEventState;
    [FieldOffset(0x0290)] public TMap<EEvtManagerState, IntPtr> AtlEventStates;
    [FieldOffset(0x02E0)] public AUIBackLog* UIBackLogActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct FAtlEvtHandwritingData
{
    [FieldOffset(0x0000)] public EAtlEvtHandwritingType HandwritingType;
    [FieldOffset(0x0004)] public FVector Location;
    [FieldOffset(0x0010)] public FVector Scale;
    [FieldOffset(0x0020)] public FString BoneName;
    [FieldOffset(0x0030)] public int LoopCount;
    [FieldOffset(0x0034)] public float CameraOffset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct UAtlEvtHandwritingDataAsset
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
    [FieldOffset(0x0030)] public FAtlEvtHandwritingData EvtHandwritingData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x98)] 
public unsafe struct UAtlEvtHandwritingSubsystem
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
    [FieldOffset(0x0030)] public UAtlEvtHandwritingDataAsset* EvtHandwritingAsset;
    [FieldOffset(0x0038)] public TArray<FAtlEvtHandwritingData> EvtHandwritingDefaultDatas;
    [FieldOffset(0x0048)] public TMap<uint, FAtlEvtHandwritingData> EvtHandwritingDataMap;
}

[StructLayout(LayoutKind.Explicit, Size = 0x288)] 
public unsafe struct AAtlEvtHighStreamingLocator
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public int HighStreamingLocatorID;
    [FieldOffset(0x027C)] public float BoostFactor;
    [FieldOffset(0x0280)] public bool bOverrideLocation;
    [FieldOffset(0x0284)] public float Duration;
}

[StructLayout(LayoutKind.Explicit, Size = 0x228)] 
public unsafe struct AAtlEvtLevelSequenceLoadingActor
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public AAtlEvtLevelSequenceActor* OwnerEvtLevelSequenceActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct FAtlEvtLevelSequenceSound
{
    [FieldOffset(0x0000)] public TSoftObjectPtr<USoundAtomCueSheet> AtomCueAssetPath;
    [FieldOffset(0x0028)] public int PlayerMajorID;
    [FieldOffset(0x002C)] public int PlayerMinorID;
    [FieldOffset(0x0030)] public EPlayerType SoundPlayerType;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FAtlEvtLevelSequenceEventVoice
{
    [FieldOffset(0x0000)] public TSoftObjectPtr<USoundAtomCueSheet> AtomCueAssetPath;
    [FieldOffset(0x0028)] public int BankNum;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FAtlEvtLevelSequenceEventSE
{
    [FieldOffset(0x0000)] public TSoftObjectPtr<USoundAtomCueSheet> AtomCueAssetPath;
    [FieldOffset(0x0028)] public int BankNum;
}

[StructLayout(LayoutKind.Explicit, Size = 0x340)] 
public unsafe struct AAtlEvtLevelSequenceActor
{
    [FieldOffset(0x0000)] public ALevelSequenceActor baseObj;
    [FieldOffset(0x02A8)] public EAtlLevelSequenceActorType AtlSequenceType;
    [FieldOffset(0x02B0)] public TArray<FFrameNumber> EvtDialogueTimeArray;
    [FieldOffset(0x02C8)] public TArray<FAtlEvtLevelSequenceSound> SoundAssetArray;
    [FieldOffset(0x02D8)] public TArray<int> BankIDArray;
    [FieldOffset(0x02E8)] public TArray<FAtlEvtLevelSequenceEventVoice> EventVoiceAssetArray;
    [FieldOffset(0x02F8)] public TArray<FAtlEvtLevelSequenceEventSE> EventSEAssetArray;
    [FieldOffset(0x030C)] public int AtlFieldEventIndex;
    [FieldOffset(0x0318)] public bool bUseDOFInCamera;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FAtlEvtLightScenarioSublevel
{
    [FieldOffset(0x0000)] public FName FieldLevelName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FAtlEvtAdditionBGSublevel
{
    [FieldOffset(0x0000)] public FName FieldLevelName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UAtlEvtLightScenarioSublevelsDataAsset
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FAtlEvtLightScenarioSublevel> LightingIndexArray;
    [FieldOffset(0x0040)] public TArray<FAtlEvtAdditionBGSublevel> AdditionBGSublevelArray;
    [FieldOffset(0x0050)] public bool bDisableAutoLoadFirstLightingScenarioLevel;
    [FieldOffset(0x0051)] public bool bForceDisableUseCurrentTimeZone;
    [FieldOffset(0x0054)] public int ForceMonth;
    [FieldOffset(0x0058)] public int ForceDay;
}

[StructLayout(LayoutKind.Explicit, Size = 0x288)] 
public unsafe struct AAtlEvtLightScenarioLoader
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x288)] 
public unsafe struct AAtlEvtLightScenarioUnloader
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FAtlEvtLightScenarioSublevelParam
{
    [FieldOffset(0x0000)] public UObject* Level;
    [FieldOffset(0x0008)] public FName LevelName;
    [FieldOffset(0x0010)] public FPrimaryAssetId PrimaryAssetId;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2E8)] 
public unsafe struct AAtlEvtLightScenarioTransitionController
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0290)] public TArray<FAtlEvtLightScenarioSublevelParam> LightScenarioSublevelParamArray;
    [FieldOffset(0x02C0)] public AAtlEvtLightScenarioLoader* LoaderActor;
    [FieldOffset(0x02C8)] public AAtlEvtLightScenarioUnloader* UnloaderActor;
    [FieldOffset(0x02D0)] public UAssetLoader* pAssetLoader;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct UAtlEvtMoviePlayManager
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UEvtTextureForOnePicture
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UTexture2D* Texture;
    [FieldOffset(0x0030)] public UAssetLoader* AssetLoader;
}

[StructLayout(LayoutKind.Explicit, Size = 0x250)] 
public unsafe struct AAtlEvtOnePicture
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public TArray<IntPtr> TextureArray;
    [FieldOffset(0x0230)] public UMaterial* Material;
    [FieldOffset(0x0238)] public UMaterialInstanceDynamic* DynamicMaterial;
    [FieldOffset(0x0240)] public UAssetLoader* AssetLoader;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct FAtlEvtPreSublevelData
{
    [FieldOffset(0x0000)] public TArray<FString> EventBGLevels;
    [FieldOffset(0x0010)] public int BGFieldMajorID;
    [FieldOffset(0x0014)] public int BGFieldMinorID;
    [FieldOffset(0x0018)] public FString BGFieldSeasonSubLevel;
    [FieldOffset(0x0028)] public FString BGFieldSoundSubLevel;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FAtlEvtPreDungeonSublevelData
{
    [FieldOffset(0x0000)] public FName EventBGFloorLevel;
    [FieldOffset(0x0008)] public FName BGEnvironmentSubLevel;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct FAtlEvtPreData
{
    [FieldOffset(0x0000)] public int EventMajorID;
    [FieldOffset(0x0004)] public int EventMinorID;
    [FieldOffset(0x0008)] public int EventCategoryTypeID;
    [FieldOffset(0x000C)] public FName EventRank;
    [FieldOffset(0x0014)] public FName EventCategory;
    [FieldOffset(0x0020)] public FString EventLevel;
    [FieldOffset(0x0030)] public TArray<FAtlEvtPreSublevelData> EventSublevels;
    [FieldOffset(0x0040)] public TArray<FName> LightScenarioSublevels;
    [FieldOffset(0x0050)] public FAtlEvtPreDungeonSublevelData DungeonSublevel;
    [FieldOffset(0x0060)] public bool bDisableAutoLoadFirstLightingScenarioLevel;
    [FieldOffset(0x0061)] public bool bForceDisableUseCurrentTimeZone;
    [FieldOffset(0x0062)] public byte ForcedCldTimeZoneValue;
    [FieldOffset(0x0064)] public int ForceMonth;
    [FieldOffset(0x0068)] public int ForceDay;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UAtlEvtPreDataAsset
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FAtlEvtPreData> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x278)] 
public unsafe struct AAtlEvtPropDetachLocator
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FAtlEvtPlayingCharacterInfo
{
    [FieldOffset(0x0000)] public TArray<TWeakObjectPtr<AActor>> AppEventCharacters;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FAtlEvtSoundSEInfo
{
    [FieldOffset(0x0000)] public int bankID;
    [FieldOffset(0x0004)] public bool bStopWhileHighSpeed;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FEvtLocalData
{
    [FieldOffset(0x0000)] public TArray<int> LocalDatas;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FAtlEvtPlayLoadSublevelInfo
{
    [FieldOffset(0x0000)] public FName SublevelPackageName;
    [FieldOffset(0x0008)] public EAtlEvtPlayLoadSublevelType SublevelType;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FAtlEvtPlayBindingTagParameter
{
    [FieldOffset(0x0000)] public AActor* BindingActor;
    [FieldOffset(0x0008)] public FString BindingTag;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FAtlEvtAssetOverrideParameter
{
    [FieldOffset(0x0000)] public FAtlEvtPlayBindingTagParameter BindingTagParameter;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FFieldEventInfo
{
    [FieldOffset(0x0000)] public AActor* FieldCameraActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct FAtlEvtPlayParameter
{
    [FieldOffset(0x0000)] public FString EventAssetName;
    [FieldOffset(0x0010)] public bool bEnableBinding;
    [FieldOffset(0x0018)] public TArray<FAtlEvtPlayBindingTagParameter> BindingTagActors;
    [FieldOffset(0x0028)] public bool bDisableTimeZone;
    [FieldOffset(0x0030)] public FFieldEventInfo FieldEventInfo;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct FAtlEvtVisibleEventInfo
{
    [FieldOffset(0x0000)] public bool bExsistVisibleField;
    [FieldOffset(0x0008)] public FString EventLevelName;
    [FieldOffset(0x0018)] public int EventCategoryTypeID;
    [FieldOffset(0x001C)] public int EventMajorID;
    [FieldOffset(0x0020)] public int EventMinorID;
    [FieldOffset(0x0028)] public TSoftObjectPtr<ULevelStreaming> VisibleLevelStreaming;
    [FieldOffset(0x0050)] public int FieldMajorID;
    [FieldOffset(0x0054)] public int FieldMinorID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2F0)] 
public unsafe struct UAtlEvtSubsystem
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
    [FieldOffset(0x0030)] public TMap<uint, FAtlEvtPlayingCharacterInfo> AppEvtCharactersMap;
    [FieldOffset(0x0080)] public TMap<int, FAtlEvtPlayingCharacterInfo> AppEvtLipUniqueIDCharactersMap;
    [FieldOffset(0x00D0)] public TArray<FAtlEvtSoundSEInfo> EventSEInfoArray;
    [FieldOffset(0x00E0)] public AAtlEvtLightScenarioTransitionController* LightScenarioTransitionController;
    [FieldOffset(0x00E8)] public FEvtLocalData EvtLocalData;
    [FieldOffset(0x00F8)] public UAssetLoader* pLSAssetLoader;
    [FieldOffset(0x0100)] public UObject* LevelSequenceObject;
    [FieldOffset(0x0148)] public UAtlEvtPreDataAsset* EvtPreDataAsset;
    [FieldOffset(0x0150)] public TMap<uint, FAtlEvtPreData> EvtPreDataMap;
    [FieldOffset(0x01A0)] public TWeakObjectPtr<UWorld> EventSublevelWorldObjPtr;
    [FieldOffset(0x01B8)] public TArray<FAtlEvtPlayLoadSublevelInfo> LoadedEventSublevelInfos;
    [FieldOffset(0x0270)] public TArray<FName> CurrentLoadedEventSublevels;
    [FieldOffset(0x0280)] public TArray<FAtlEvtAssetOverrideParameter> ReserveAssetOverrideParameter;
    [FieldOffset(0x0298)] public UAssetLoader* AssetOverrideLoader;
    [FieldOffset(0x02A0)] public TSubclassOf<ACharacter> AssetOverrideSubClass;
    [FieldOffset(0x02C8)] public AActor* BagActor;
    [FieldOffset(0x02D0)] public AAtlEvtOnePicture* OnePicture;
}

[StructLayout(LayoutKind.Explicit, Size = 0x300)] 
public unsafe struct AAtlEvtPlayObject
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public FString LevelName;
    [FieldOffset(0x0288)] public FAtlEvtPlayParameter EvtPlayParam;
    [FieldOffset(0x02C0)] public FString EventRank;
    [FieldOffset(0x02E8)] public ALevelSequenceActor* LevelSequenceActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A8)] 
public unsafe struct AAtlEvtPlayUnstreamObject
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public FString LevelName;
    [FieldOffset(0x0298)] public ALevelSequenceActor* LevelSequenceActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UDEPRECATED_AtlEvtSubsystemDraft
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
    [FieldOffset(0x0040)] public int GlobalCount;
}

[StructLayout(LayoutKind.Explicit, Size = 0x80)] 
public unsafe struct UAtlHandwritingDataAsset
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
    [FieldOffset(0x0030)] public TMap<EAtlEvtHandwritingType, TSoftClassPtr<AHandwritingEffectBase>> HandwritingEffectSoftObjMap;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct AAtlNiagaraActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UNiagaraComponent* NiagaraComponent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x208)] 
public unsafe struct UAtlUIPlg
{
    [FieldOffset(0x0000)] public UWidget baseObj;
    [FieldOffset(0x0108)] public FSlateBrush Brush;
    [FieldOffset(0x01A0)] public FLinearColor ColorAndOpacity;
    [FieldOffset(0x01C0)] public UPlgAsset* PlgAsset;
    [FieldOffset(0x01C8)] public int PrimitiveNo;
    [FieldOffset(0x01CC)] public float PlgScale;
}

[StructLayout(LayoutKind.Explicit, Size = 0x218)] 
public unsafe struct UAtlUIPrimitive
{
    [FieldOffset(0x0000)] public UWidget baseObj;
    [FieldOffset(0x0108)] public FSlateBrush Brush;
    [FieldOffset(0x01A0)] public FLinearColor ColorAndOpacity;
    [FieldOffset(0x01C0)] public TArray<FVector2D> Vertexes;
    [FieldOffset(0x01D0)] public TArray<int> Indexes;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C8)] 
public unsafe struct UAtlUITextBlock
{
    [FieldOffset(0x0000)] public UTextLayoutWidget baseObj;
    [FieldOffset(0x0128)] public FText Text;
    [FieldOffset(0x0150)] public EAtlUIFontStyle fontStyle;
    [FieldOffset(0x0154)] public float TextScale;
    [FieldOffset(0x0158)] public UFontAdjustmentListTable* FontAdjustmentListTable;
    [FieldOffset(0x0170)] public FSlateColor ColorAndOpacity;
    [FieldOffset(0x01A8)] public FSlateFontInfo Font;
    [FieldOffset(0x0200)] public FSlateBrush StrikeBrush;
    [FieldOffset(0x0288)] public FVector2D ShadowOffset;
    [FieldOffset(0x0290)] public FLinearColor ShadowColorAndOpacity;
    [FieldOffset(0x02B0)] public float MinDesiredWidth;
    [FieldOffset(0x02B4)] public bool bWrapWithInvalidationPanel;
    [FieldOffset(0x02B5)] public bool bAutoWrapText;
    [FieldOffset(0x02B6)] public ETextTransformPolicy TextTransformPolicy;
}

[StructLayout(LayoutKind.Explicit, Size = 0x218)] 
public unsafe struct UAtlUITriangle
{
    [FieldOffset(0x0000)] public UWidget baseObj;
    [FieldOffset(0x0108)] public FSlateBrush Brush;
    [FieldOffset(0x01A0)] public FLinearColor ColorAndOpacity;
    [FieldOffset(0x01C0)] public FVector2D Vertexe01;
    [FieldOffset(0x01C8)] public FVector2D Vertexe02;
    [FieldOffset(0x01D0)] public FVector2D Vertexe03;
    [FieldOffset(0x01D8)] public int Antialiasing;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct AUIBaseActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B8)] 
public unsafe struct ABasePartyPanel
{
    [FieldOffset(0x0000)] public AUIBaseActor baseObj;
    [FieldOffset(0x02A8)] public UDataTable* LayoutData;
    [FieldOffset(0x02B0)] public UUILayoutDataTable* LayoutDataTable;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBFL_UIPaint
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBFLAtlEvtCharacter
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBFLAtlEvtHandwriting
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x310)] 
public unsafe struct AAtlEvtPlayOnBindingActorObject
{
    [FieldOffset(0x0000)] public AAtlEvtPlayObject baseObj;
    [FieldOffset(0x0300)] public FString EvtName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBFLAtlEvtTest
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBFLBtlAnimation
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBFLBtlManager
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBFLEventMovieScene
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBPExtensionsFunctionLibrary
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xF0)] 
public unsafe struct UBtlActionManagerComponent
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x00C8)] public ABtlActor* ActionCommander;
    [FieldOffset(0x00D0)] public EBtlCommandType ActionType;
    [FieldOffset(0x00D4)] public int ActionID;
    [FieldOffset(0x00D8)] public TArray<IntPtr> ActionTargets;
    [FieldOffset(0x00E8)] public UBtlTargetsManagerComponent* TargetsManager;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FBtlEventCustomEquipment
{
    [FieldOffset(0x0000)] public bool UseCustomEquipSettings;
    [FieldOffset(0x0004)] public int CostumeID;
    [FieldOffset(0x0008)] public bool UseWeapon;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FBtlEffectItem
{
    [FieldOffset(0x0000)] public AActor* ParentEmpActor;
    [FieldOffset(0x0008)] public UNiagaraComponent* ObjectReference;
    [FieldOffset(0x0010)] public FName Tag;
    [FieldOffset(0x0018)] public EBtlBadStatusIcon Type;
    [FieldOffset(0x0019)] public bool BadStatus;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FBtlBossAnimRequestParam
{
    [FieldOffset(0x0000)] public EBtlAnimationType Type;
    [FieldOffset(0x0001)] public bool UseCustomFade;
    [FieldOffset(0x0004)] public float CustomFadeIn;
    [FieldOffset(0x0008)] public float CustomFadeOut;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10A50)] 
public unsafe struct ABtlActor
{
    [FieldOffset(0x0000)] public APawn baseObj;
    [FieldOffset(0x02F0)] public FBtlEventCustomEquipment CustomEquipments;
    [FieldOffset(0x0320)] public EBtlAttackType AttackBaseType;
    [FieldOffset(0x0338)] public FVector HomePosition;
    [FieldOffset(0x0344)] public FRotator HomeRotation;
    [FieldOffset(0x0350)] public FVector Position;
    [FieldOffset(0x035C)] public FRotator Rotation;
    [FieldOffset(0x0368)] public int HomePositionID;
    [FieldOffset(0x036C)] public int InitialLocationIndexFromLeft;
    [FieldOffset(0x0370)] public bool EnemyFlag;
    [FieldOffset(0x0371)] public bool PersonaFlag;
    [FieldOffset(0x0372)] public bool PersonaHideEmergeEffect;
    [FieldOffset(0x03D0)] public ABtlAI* AI;
    [FieldOffset(0x03D8)] public UBtlVoice* Voice;
    [FieldOffset(0x03E0)] public UBtlCoreComponent* BtlCore;
    [FieldOffset(0x03E8)] public TArray<IntPtr> PersonaList;
    [FieldOffset(0x03F8)] public int RequestedPersonaNum;
    [FieldOffset(0x0400)] public TArray<FBtlEffectItem> EffectList;
    [FieldOffset(0x0410)] public TArray<EBtlBadStatusIcon> EffectRequestList;
    [FieldOffset(0x0420)] public EBtlBadStatusIcon CurrentBadStatusType;
    [FieldOffset(0x0421)] public EBtlAlloutAttackResult AlloutAttackResult;
    [FieldOffset(0x0422)] public EBtlAttackPerformanceType AttackPerformanceType;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IBtlPersonaInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IBtlAegisInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x298)] 
public unsafe struct ABtlAiScriptWatcher
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0280)] public ABtlAI* AI;
    [FieldOffset(0x0288)] public UBtlActionManagerComponent* ActionManager;
    [FieldOffset(0x0290)] public ABtlActor* Character;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB58)] 
public unsafe struct ABtlAI
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0AE0)] public ABtlActor* Character;
    [FieldOffset(0x0AE8)] public UBtlCoreComponent* Core;
    [FieldOffset(0x0AF0)] public EBtlCommandType ActionType;
    [FieldOffset(0x0AF1)] public EBtlCommandType PrevActionType;
    [FieldOffset(0x0AF4)] public uint ActionID;
    [FieldOffset(0x0AF8)] public uint ActionSkillID;
    [FieldOffset(0x0AFC)] public uint ActionItemID;
    [FieldOffset(0x0B00)] public uint PrevActionID;
    [FieldOffset(0x0B04)] public ushort MinorParam;
    [FieldOffset(0x0B06)] public EBtlDataAttr ReceiveSkillAttr;
    [FieldOffset(0x0B08)] public TArray<IntPtr> ActionTargets;
    [FieldOffset(0x0B18)] public TArray<IntPtr> PrevActionTargets;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB58)] 
public unsafe struct ABtlManualAI
{
    [FieldOffset(0x0000)] public ABtlAI baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB78)] 
public unsafe struct ABtlScriptAI
{
    [FieldOffset(0x0000)] public ABtlAI baseObj;
    [FieldOffset(0x0B58)] public UAssetLoader* pLoader;
    [FieldOffset(0x0B60)] public UBfAsset* pBfAsset;
    [FieldOffset(0x0B68)] public bool bAssetLoaded;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB0)] 
public unsafe struct UBtlAIManagerComponent
{
    [FieldOffset(0x0000)] public UActorComponent baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD8)] 
public unsafe struct UBtlBCDCharaCameraComponent
{
    [FieldOffset(0x0000)] public UActorComponent baseObj;
    [FieldOffset(0x00B0)] public float RadiumRation;
    [FieldOffset(0x00B4)] public float HeightRation;
    [FieldOffset(0x00B8)] public float RotateDegree;
    [FieldOffset(0x00BC)] public float Pan;
    [FieldOffset(0x00C0)] public float Roll;
    [FieldOffset(0x00C4)] public bool bUseCommonCylinder;
    [FieldOffset(0x00C5)] public EBtlEventAreaType TargetAreaType;
    [FieldOffset(0x00C8)] public FString SocketName;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB8)] 
public unsafe struct UBtlBCDMoveCameraComponent
{
    [FieldOffset(0x0000)] public UActorComponent baseObj;
    [FieldOffset(0x00B0)] public float BlendAlpha;
    [FieldOffset(0x00B4)] public EBtlCutsceneMoveMode MoveMode;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UBtlBoss
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UDataTable* CameraTable;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UBtlBossChariot
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UBtlBossElizabeth
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UBtlBossEmperor
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IBtlBossEmperorInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UBtlBossFortune
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
    [FieldOffset(0x0038)] public UBtlCoreComponent* pSavedCore;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IBtlBossFortuneInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UBtlBossHangedMan
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IBtlBossHangedManInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UBtlBossHermit
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IBtlBossHermitInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UBtlBossHierophant
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UBtlBossLovers
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UBtlBossMagician
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UBtlBossNyxAvatar
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IBtlBossNyxAvatarInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x288)] 
public unsafe struct UBtlBossNyxCore
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IBtlBossNyxCoreInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UBtlBossPriestess
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UBtlBossStregaBase
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UBtlBossStregaJin
{
    [FieldOffset(0x0000)] public UBtlBossStregaBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UBtlBossStregaTakaya
{
    [FieldOffset(0x0000)] public UBtlBossStregaBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UBtlBossStregaTakayaJin
{
    [FieldOffset(0x0000)] public UBtlBossStregaBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UBtlBossStregaChidori
{
    [FieldOffset(0x0000)] public UBtlBossStregaBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IBtlBossStregaInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UBtlBossStregaTakayaJoined
{
    [FieldOffset(0x0000)] public UBtlBossStregaBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x488)] 
public unsafe struct ABtlCalcBase
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public int DamageMax;
    [FieldOffset(0x027C)] public int CriticalMin;
    [FieldOffset(0x0280)] public int CriticalMax;
    [FieldOffset(0x0284)] public float CriticalPlayerDamageRate;
    [FieldOffset(0x0288)] public float CriticalEnemyDamageRate;
    [FieldOffset(0x028C)] public float KnockdownRateAttackingDownCharacter;
    [FieldOffset(0x0290)] public int AccuracyMin;
    [FieldOffset(0x0294)] public int AccuracyMax;
    [FieldOffset(0x0298)] public int BadStatusAccuracyMin;
    [FieldOffset(0x029C)] public int BadStatusAccuracyMax;
    [FieldOffset(0x02A0)] public int EscapeSuccessRateMin;
    [FieldOffset(0x02A4)] public int EscapeSuccessRateMax;
    [FieldOffset(0x02A8)] public int EscapeTurn;
    [FieldOffset(0x02AC)] public int DyingHPRatio;
    [FieldOffset(0x02B0)] public float PhysicsChargePowerRate;
    [FieldOffset(0x02B4)] public float MagicChargePowerRate;
    [FieldOffset(0x02B8)] public float PhysicsChargePowerRateTheurgia;
    [FieldOffset(0x02BC)] public float MagicChargePowerRateTheurgia;
    [FieldOffset(0x02C0)] public int BadStatusRecoveryPlayerRate;
    [FieldOffset(0x02C4)] public int BadStatusRecoveryEnemyRate;
    [FieldOffset(0x02C8)] public float GuardProtectRatio;
    [FieldOffset(0x02CC)] public float DamageRatioToDown;
    [FieldOffset(0x02D0)] public float SupportTurnMax;
    [FieldOffset(0x02D4)] public float CharmBoosterDamageRatioToCharm;
    [FieldOffset(0x02D8)] public float SkillDamageBonusToDown;
    [FieldOffset(0x02DC)] public float BadHitRatioBonus;
    [FieldOffset(0x02E0)] public float AutoMikiri;
    [FieldOffset(0x02E4)] public float AutoShinMikiri;
    [FieldOffset(0x02E8)] public float AutoBooster;
    [FieldOffset(0x02EC)] public float AutoHighBooster;
    [FieldOffset(0x02F0)] public float AutoMegaBooster;
    [FieldOffset(0x02F4)] public float AutoBoosterMax;
    [FieldOffset(0x02F8)] public float AutoAlloutBooster;
    [FieldOffset(0x02FC)] public float AutoBadStatusBooster;
    [FieldOffset(0x0300)] public float AutoBadStatusSwoonBooster;
    [FieldOffset(0x0304)] public int AutoCounterOccur;
    [FieldOffset(0x0308)] public int AutoHeavyCounterOccur;
    [FieldOffset(0x030C)] public int AutoHyperCounterOccur;
    [FieldOffset(0x0310)] public float AutoGrowthLowExpRatio;
    [FieldOffset(0x0314)] public float AutoGrowthMiddleExpRatio;
    [FieldOffset(0x0318)] public float AutoGrowthhightExpRatio;
    [FieldOffset(0x031C)] public float AutoHPRecoveryRatio_1;
    [FieldOffset(0x0320)] public float AutoHPRecoveryRatio_2;
    [FieldOffset(0x0324)] public float AutoHPRecoveryRatio_3;
    [FieldOffset(0x0328)] public float AutoSPRecoveryValue_1;
    [FieldOffset(0x032C)] public float AutoSPRecoveryValue_2;
    [FieldOffset(0x0330)] public float AutoSPRecoveryValue_3;
    [FieldOffset(0x0334)] public float AutoSPRecoveryValue_AddEffect_1;
    [FieldOffset(0x0338)] public float AutoSPRecoveryValue_AddEffect_2;
    [FieldOffset(0x033C)] public float AutoAddExp_Ration_1;
    [FieldOffset(0x0340)] public float AutoAddExp_Ration_2;
    [FieldOffset(0x0344)] public float AutoTakeoverBooster;
    [FieldOffset(0x0348)] public float AutoTakeoverHighBooster;
    [FieldOffset(0x034C)] public float AutoSingleTargetBooster;
    [FieldOffset(0x0350)] public float AutoMultiTargetBooster;
    [FieldOffset(0x0354)] public int AutoAddCritical;
    [FieldOffset(0x0358)] public int AutoAddCriticalHigh;
    [FieldOffset(0x035C)] public float AutoTGRWeakBooster;
    [FieldOffset(0x0360)] public float AutoTGRWeakHighBooster;
    [FieldOffset(0x0364)] public float AutoTGRCriticalBooster;
    [FieldOffset(0x0368)] public float AutoTGRCriticalHighBooster;
    [FieldOffset(0x036C)] public int AutoTGRAddCritical;
    [FieldOffset(0x0370)] public int AutoTGRAddCriticalHigh;
    [FieldOffset(0x0374)] public float AutoTGRPowerBoostAmplify;
    [FieldOffset(0x0378)] public float AutoTGRPowerBoostHighAmplify;
    [FieldOffset(0x037C)] public float AutoTGRAddCriticalToBadStatus;
    [FieldOffset(0x0380)] public float AutoTGRAddCriticalHighToBadStatus;
    [FieldOffset(0x0384)] public float AutoTGRWeakProtecter;
    [FieldOffset(0x0388)] public float AutoTGRWeakHighProtecter;
    [FieldOffset(0x038C)] public float AutoTGRPhisicsBooster;
    [FieldOffset(0x0390)] public float AutoTGRPhisicsHighBooster;
    [FieldOffset(0x0394)] public float AutoTGRSPHeal;
    [FieldOffset(0x0398)] public float AutoTGRSPHighHeal;
    [FieldOffset(0x039C)] public float TGRGaugeLowHPRatio;
    [FieldOffset(0x03A0)] public float TGRGaugeLowSPRatio;
    [FieldOffset(0x03A4)] public float TGRExpBonusRatio;
    [FieldOffset(0x03A8)] public float TGRGaugeBonusRatio;
    [FieldOffset(0x03AC)] public float TGRGaugeBonusHighRatio;
    [FieldOffset(0x03B0)] public int MaxTurnSWOON;
    [FieldOffset(0x03B4)] public int MaxTurnCHARM;
    [FieldOffset(0x03B8)] public int MinTurnCHARM;
    [FieldOffset(0x03BC)] public int MaxTurnUPSET;
    [FieldOffset(0x03C0)] public int MinTurnUPSET;
    [FieldOffset(0x03C4)] public int MaxTurnPANIC;
    [FieldOffset(0x03C8)] public int MinTurnPANIC;
    [FieldOffset(0x03CC)] public int MaxTurnFEAR;
    [FieldOffset(0x03D0)] public int MinTurnFEAR;
    [FieldOffset(0x03D4)] public int MaxTurnANGER;
    [FieldOffset(0x03D8)] public int MinTurnANGER;
    [FieldOffset(0x03DC)] public int MaxTurnFREEZE;
    [FieldOffset(0x03E0)] public int MinTurnFREEZE;
    [FieldOffset(0x03E4)] public int MaxTurnSHOCK;
    [FieldOffset(0x03E8)] public int MinTurnSHOCK;
    [FieldOffset(0x03EC)] public int DefaultTurnOVERLIMIT;
    [FieldOffset(0x03F0)] public int DefaultTurnOVERHEAT;
    [FieldOffset(0x03F4)] public int AddCriticalByUPSET;
    [FieldOffset(0x03F8)] public int AddCriticalByPANIC;
    [FieldOffset(0x03FC)] public int AddCriticalByFEAR;
    [FieldOffset(0x0400)] public int AddCriticalBySHOCK;
    [FieldOffset(0x0404)] public int AddCriticalByFREEZE;
    [FieldOffset(0x0408)] public int AddCriticalBySWOON;
    [FieldOffset(0x040C)] public int PoisonMaxDamage;
    [FieldOffset(0x0410)] public float PoisonDamageRatio;
    [FieldOffset(0x0414)] public float AccuracyRatioByANGER;
    [FieldOffset(0x0418)] public int AttackSwoonDownRatio;
    [FieldOffset(0x041C)] public int PhysicalSkillSwoonDownRatio;
    [FieldOffset(0x0420)] public int MagicalSkillSwoonDownRatio;
    [FieldOffset(0x0424)] public int TheurgiaSkillSwoonDownRatio;
    [FieldOffset(0x0428)] public int DoNothingRatioByFEAR;
    [FieldOffset(0x042C)] public float MajorArcanaRationByStrong;
    [FieldOffset(0x0430)] public float MajorArcanaRationByRare;
    [FieldOffset(0x0434)] public int MustAppearMajorEncount;
    [FieldOffset(0x0438)] public float ShufflePersonaBonusExpRation;
    [FieldOffset(0x043C)] public float MajorArcanaBasicRation;
    [FieldOffset(0x0440)] public int MinorArcanaBasicRation;
    [FieldOffset(0x0444)] public int PersonaArcanaBasicRation;
    [FieldOffset(0x0448)] public float ShuffleTimeAlloutBooster;
    [FieldOffset(0x044C)] public int ShuffleTimeChariotIncreaseHeroHp;
    [FieldOffset(0x0450)] public int ShuffleTimeHermitIncreaseHeroSP;
    [FieldOffset(0x0454)] public int ShuffleTimeFortuneIncreasePartyHp;
    [FieldOffset(0x0458)] public int ShuffleTimeStrengthIncreasePartySp;
    [FieldOffset(0x045C)] public int MaxBattleNumNotContinualPlayingFukaCutin;
    [FieldOffset(0x0460)] public int OneMoreCount;
    [FieldOffset(0x0464)] public int OneMoreCountEnemy;
}

[StructLayout(LayoutKind.Explicit, Size = 0x298)] 
public unsafe struct ABtlFormula
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UAssetLoader* Loader;
    [FieldOffset(0x0288)] public ABtlCalcBase* Calc;
    [FieldOffset(0x0290)] public TSubclassOf<ABtlCalcBase> CalcAsset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x240)] 
public unsafe struct ABtlCamera
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public ABtlActor* cameraMainCharacter;
    [FieldOffset(0x0228)] public TArray<IntPtr> CameraTargets;
    [FieldOffset(0x0238)] public ACineCameraActor* MainCamera;
}

[StructLayout(LayoutKind.Explicit, Size = 0x78)] 
public unsafe struct UBtlCompensation
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FBtlEncountParam
{
    [FieldOffset(0x0000)] public int EncountID;
    [FieldOffset(0x0004)] public EBtlEncountPreemptive Preemptive;
    [FieldOffset(0x0005)] public EBtlEncountPreemptive PreemptiveOriginal;
    [FieldOffset(0x0010)] public int StageMajor;
    [FieldOffset(0x0014)] public int StageMinor;
    [FieldOffset(0x0018)] public int EnemyBadStatus;
    [FieldOffset(0x001C)] public bool CalledFromScript;
    [FieldOffset(0x001D)] public bool IsEventResult;
}

[StructLayout(LayoutKind.Explicit, Size = 0x568)] 
public unsafe struct UBtlCoreComponent
{
    [FieldOffset(0x0000)] public UActorComponent baseObj;
    [FieldOffset(0x0190)] public TWeakObjectPtr<AInitReadActor> InitReadActor;
    [FieldOffset(0x0198)] public FSoftObjectPath FormationData;
    [FieldOffset(0x01B0)] public UDataTable* FormationTable;
    [FieldOffset(0x01B8)] public UBtlEventCutsceneController* BtlCutscene;
    [FieldOffset(0x01C0)] public UBtlBoss* Boss;
    [FieldOffset(0x01C8)] public ABtlCountdown* Countdown;
    [FieldOffset(0x01D0)] public UBtlEventController* BtlEventController;
    [FieldOffset(0x01D8)] public UBtlResidentDataBase* ResidentData;
    [FieldOffset(0x01E0)] public AActor* PlayerLocationRoot;
    [FieldOffset(0x01E8)] public AActor* EnemyLocationRoot;
    [FieldOffset(0x01F0)] public AActor* EnemyAttachRoot;
    [FieldOffset(0x01F8)] public ABtlActor* EnemyTurnTableRotationTargetCharacter;
    [FieldOffset(0x0200)] public UBtlEnvironmentBase* BtlEnvironmentComponent;
    [FieldOffset(0x0208)] public ABtlFadeManager* FadeManager;
    [FieldOffset(0x0210)] public ABtlShakeManager* ShakeManager;
    [FieldOffset(0x025C)] public uint SummonEnemyCount;
    [FieldOffset(0x0290)] public float BattleElapsedTime;
    [FieldOffset(0x0294)] public float BattleDeltaTime;
    [FieldOffset(0x0298)] public FBtlEncountParam EncountParameter;
    [FieldOffset(0x02B8)] public int EncountIndex;
    [FieldOffset(0x02BC)] public EBtlFinishResult BattleResult;
    [FieldOffset(0x02C0)] public ABtlActor* CurrentAction;
    [FieldOffset(0x02C8)] public ABtlActor* EventMainAction;
    [FieldOffset(0x02D0)] public ABtlActor* LatestAction;
    [FieldOffset(0x02D8)] public ABtlActor* ActionRequestedEscape;
    [FieldOffset(0x02E0)] public TArray<IntPtr> ActionList;
    [FieldOffset(0x02F0)] public TArray<IntPtr> PlayerList;
    [FieldOffset(0x0300)] public TArray<IntPtr> EnemyList;
    [FieldOffset(0x0310)] public TArray<TSubclassOf<ABtlActor>> PlayerDataStockList;
    [FieldOffset(0x0330)] public TArray<TSubclassOf<ABtlActor>> PlayerDataAddedStockList;
    [FieldOffset(0x0340)] public TSubclassOf<AAppActor> DebugMonitorData;
    [FieldOffset(0x0348)] public TArray<short> PlayerDataAddedIDList;
    [FieldOffset(0x0360)] public TArray<TSubclassOf<ABtlActor>> EnemyDataStockList;
    [FieldOffset(0x0380)] public TArray<TSubclassOf<ABtlActor>> EnemyDataSummonStockList;
    [FieldOffset(0x0390)] public TArray<short> EnemyDataSummonIDList;
    [FieldOffset(0x03A8)] public TArray<TSubclassOf<ABtlActor>> PersonaDataStockList;
    [FieldOffset(0x03C0)] public UBtlCompensation* Compensation;
    [FieldOffset(0x03C8)] public UBtlOrder* Order;
    [FieldOffset(0x03D0)] public ABtlPhase* CurrentPhase;
    [FieldOffset(0x03D8)] public bool RequestChangePhase;
    [FieldOffset(0x03E0)] public ABtlPhase* RequestedNextPhase;
    [FieldOffset(0x03E8)] public TArray<IntPtr> UtensilEffectList;
    [FieldOffset(0x03F8)] public FString HomeFormation;
    [FieldOffset(0x0408)] public ABtlResultResourceManager* ResultResource;
    [FieldOffset(0x0410)] public bool LoadedResidentData;
    [FieldOffset(0x0411)] public bool LoadedBattleData;
    [FieldOffset(0x0412)] public bool LoadedAllyData;
    [FieldOffset(0x0413)] public bool LoadedEnemyData;
    [FieldOffset(0x0414)] public bool LoadedPersonaData;
    [FieldOffset(0x0415)] public bool LoadedSummonEnemyData;
    [FieldOffset(0x0416)] public bool LoadedAddedPlayerData;
    [FieldOffset(0x0417)] public bool LoadedEncSerial;
    [FieldOffset(0x0418)] public bool LoadedDebugMonitor;
    [FieldOffset(0x0420)] public UAssetLoader* Loader;
    [FieldOffset(0x0428)] public UAssetLoader* LoaderEnemy;
    [FieldOffset(0x0430)] public UAssetLoader* LoaderPersona;
    [FieldOffset(0x0438)] public UAssetLoader* LoaderSummonEnemy;
    [FieldOffset(0x0440)] public UAssetLoader* LoaderAddedPlayer;
    [FieldOffset(0x0448)] public UAssetLoader* LoaderSerialEncount;
    [FieldOffset(0x0450)] public UAssetLoader* LoaderDebugMonitor;
    [FieldOffset(0x0458)] public UBtlSupportInfoBase* SupportInfo;
    [FieldOffset(0x0460)] public ushort InitialEquipedPersonaID;
    [FieldOffset(0x0508)] public TArray<int> TutorialRequestList;
    [FieldOffset(0x0518)] public AAppActor* DebugWindow;
    [FieldOffset(0x0520)] public AAppActor* DebugMonitor;
    [FieldOffset(0x0528)] public AAppActor* DebugSkillSelect;
    [FieldOffset(0x0530)] public FString ModeName;
    [FieldOffset(0x0540)] public FString DebugStateString;
    [FieldOffset(0x0550)] public FString DebugLatestCamera;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct IBtlManagerInterface
{
    [FieldOffset(0x0000)] public IInterface baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x290)] 
public unsafe struct ABtlCountdown
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public float Timer;
    [FieldOffset(0x027C)] public float Speed;
    [FieldOffset(0x0280)] public bool IsPlay;
    [FieldOffset(0x0281)] public bool IsVisible;
    [FieldOffset(0x0282)] public bool IsAnimation;
    [FieldOffset(0x0284)] public float AnimationLerp;
    [FieldOffset(0x0288)] public float AnimationStartTime;
    [FieldOffset(0x028C)] public float AnimationEndTime;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBtlDataAssets
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FDatPlayerMaxHPSP
{
    [FieldOffset(0x0000)] public ushort MaxHp;
    [FieldOffset(0x0002)] public ushort MaxSp;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C)] 
public unsafe struct FDatPlayerMaxHPSPBunch
{
    [FieldOffset(0x0000)] public FDatPlayerMaxHPSP EachPlayerData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatPlayerMaxHPSPTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatPlayerMaxHPSPBunch> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FDatPlayerLevelUpDataRecord
{
    [FieldOffset(0x0000)] public uint Exp;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatPlayerLevelUpTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatPlayerLevelUpDataRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C)] 
public unsafe struct FDatEncountDataRecord
{
    [FieldOffset(0x0000)] public uint flags;
    [FieldOffset(0x0004)] public ushort party_item;
    [FieldOffset(0x0006)] public ushort party_item_num;
    [FieldOffset(0x0008)] public ushort ID;
    [FieldOffset(0x0012)] public ushort major;
    [FieldOffset(0x0014)] public ushort Minor;
    [FieldOffset(0x0016)] public ushort Sound;
    [FieldOffset(0x0018)] public ushort shuffleLevel;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatEncountTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatEncountDataRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FDatEnemyItemTable
{
    [FieldOffset(0x0000)] public ushort ID;
    [FieldOffset(0x0002)] public ushort prob;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FDatEnemyEventItemTable
{
    [FieldOffset(0x0000)] public uint Event;
    [FieldOffset(0x0004)] public ushort ID;
    [FieldOffset(0x0006)] public ushort prob;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FDatEnemyAttackTable
{
    [FieldOffset(0x0000)] public byte attr;
    [FieldOffset(0x0001)] public byte Hit;
    [FieldOffset(0x0002)] public ushort power;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4C)] 
public unsafe struct FDatEnemyDataRecord
{
    [FieldOffset(0x0000)] public uint flags;
    [FieldOffset(0x0004)] public byte Race;
    [FieldOffset(0x0006)] public short Level;
    [FieldOffset(0x0008)] public int MaxHp;
    [FieldOffset(0x000C)] public int MaxSp;
    [FieldOffset(0x0010)] public byte Params;
    [FieldOffset(0x0016)] public ushort Skill;
    [FieldOffset(0x0028)] public uint Exp;
    [FieldOffset(0x002C)] public uint money;
    [FieldOffset(0x0030)] public FDatEnemyItemTable Item;
    [FieldOffset(0x0040)] public FDatEnemyEventItemTable eventitem;
    [FieldOffset(0x0048)] public FDatEnemyAttackTable attack;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatEnemyTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatEnemyDataRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FDatEnemyAnalyzeSyncDataRecord
{
    [FieldOffset(0x0000)] public ushort enemyID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatEnemyAnalyzeSyncTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatEnemyAnalyzeSyncDataRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FDatEnemyName
{
    [FieldOffset(0x0000)] public FText Name;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatEnemyNameTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatEnemyName> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0xE)] 
public unsafe struct FDatPersonaDataRecord
{
    [FieldOffset(0x0000)] public ushort flag;
    [FieldOffset(0x0002)] public byte Race;
    [FieldOffset(0x0003)] public byte Level;
    [FieldOffset(0x0004)] public byte Params;
    [FieldOffset(0x0009)] public byte breakage;
    [FieldOffset(0x000A)] public ushort succession;
    [FieldOffset(0x000C)] public byte conception;
    [FieldOffset(0x000D)] public byte Message;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatPersonaTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatPersonaDataRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FDatPersonaName
{
    [FieldOffset(0x0000)] public FText Name;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatPersonaNameTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatPersonaName> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatSkillNameTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FText> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3)] 
public unsafe struct FDatSkillTableRecord
{
    [FieldOffset(0x0000)] public sbyte attr;
    [FieldOffset(0x0001)] public sbyte Type;
    [FieldOffset(0x0002)] public sbyte targetLv;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatSkillTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatSkillTableRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C)] 
public unsafe struct FDatNormalSkillTableRecord
{
    [FieldOffset(0x0000)] public uint flag;
    [FieldOffset(0x0004)] public ushort use;
    [FieldOffset(0x0006)] public byte koukatype;
    [FieldOffset(0x0007)] public byte costtype;
    [FieldOffset(0x0008)] public ushort cost;
    [FieldOffset(0x000A)] public ushort costbase;
    [FieldOffset(0x000C)] public byte TargetType;
    [FieldOffset(0x000D)] public byte targetarea;
    [FieldOffset(0x000E)] public byte targetrule;
    [FieldOffset(0x0010)] public uint untargetbadstat;
    [FieldOffset(0x0014)] public byte hitratio;
    [FieldOffset(0x0015)] public byte targetcntmin;
    [FieldOffset(0x0016)] public byte targetcntmax;
    [FieldOffset(0x0017)] public byte hptype;
    [FieldOffset(0x0018)] public short hpn;
    [FieldOffset(0x001A)] public byte sptype;
    [FieldOffset(0x001C)] public short spn;
    [FieldOffset(0x001E)] public byte badtype;
    [FieldOffset(0x001F)] public byte badratio;
    [FieldOffset(0x0020)] public uint BadStatus;
    [FieldOffset(0x0024)] public uint support;
    [FieldOffset(0x0028)] public byte program;
    [FieldOffset(0x0029)] public byte criticalratio;
    [FieldOffset(0x002A)] public byte swoonratio;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatSkillNormalTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatNormalSkillTableRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x26)] 
public unsafe struct FDatAffinityDataRecord
{
    [FieldOffset(0x0000)] public ushort attr;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatAffinityTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatAffinityDataRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatAttrNameTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FText> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x6)] 
public unsafe struct FDatPersonaGrowthEventTable
{
    [FieldOffset(0x0000)] public byte Level;
    [FieldOffset(0x0002)] public ushort eventId;
    [FieldOffset(0x0004)] public ushort skillId;
}

[StructLayout(LayoutKind.Explicit, Size = 0x66)] 
public unsafe struct FDatPersonaGrowthDataRecord
{
    [FieldOffset(0x0000)] public byte paramsUp;
    [FieldOffset(0x0006)] public FDatPersonaGrowthEventTable skillEvent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatPersonaGrowthTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatPersonaGrowthDataRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x5)] 
public unsafe struct FDatLevelupParam
{
    [FieldOffset(0x0000)] public byte ATK;
    [FieldOffset(0x0001)] public byte MAT;
    [FieldOffset(0x0002)] public byte DEF;
    [FieldOffset(0x0003)] public byte SPD;
    [FieldOffset(0x0004)] public byte LUK;
}

[StructLayout(LayoutKind.Explicit, Size = 0x434)] 
public unsafe struct FDatAllyPersonaGrowthDataRecord
{
    [FieldOffset(0x0000)] public byte PlayerId;
    [FieldOffset(0x0001)] public byte levelMax;
    [FieldOffset(0x0002)] public FDatPersonaGrowthEventTable skillEvent;
    [FieldOffset(0x00C2)] public FDatLevelupParam paramsUp;
    [FieldOffset(0x02AC)] public uint Exp;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatAllyPersonaGrowthTable
{
    [FieldOffset(0x0000)] public UAppMultiDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatAllyPersonaGrowthDataRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FDatSupportInfoTableRecord
{
    [FieldOffset(0x0000)] public uint defineId;
    [FieldOffset(0x0004)] public uint majorId;
    [FieldOffset(0x0008)] public uint minorId;
    [FieldOffset(0x000C)] public uint characterId;
    [FieldOffset(0x0010)] public byte show;
    [FieldOffset(0x0011)] public byte Face;
    [FieldOffset(0x0012)] public byte Window;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatSupportInfoTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatSupportInfoTableRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct FDatRaceTableRecord
{
    [FieldOffset(0x0000)] public FText Race;
    [FieldOffset(0x0018)] public FText Community;
    [FieldOffset(0x0030)] public FText Comment;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatRaceTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatRaceTableRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct FDatShuffleChoiceMinorArcanaRecord
{
    [FieldOffset(0x0000)] public byte AreaId;
    [FieldOffset(0x0004)] public int LowPersonaRankId;
    [FieldOffset(0x0008)] public int HightPersonaRankId;
    [FieldOffset(0x000C)] public int LowWandRankId;
    [FieldOffset(0x0010)] public int HightWandRankId;
    [FieldOffset(0x0014)] public int LowCoinRankId;
    [FieldOffset(0x0018)] public int HightCoinRankId;
    [FieldOffset(0x001C)] public int LowCupRankId;
    [FieldOffset(0x0020)] public int HightCupRankId;
    [FieldOffset(0x0024)] public int LowSwordRankId;
    [FieldOffset(0x0028)] public int HightSwordRankId;
    [FieldOffset(0x002C)] public int CardNumProb;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatShuffleChoiceMinorArcanaTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatShuffleChoiceMinorArcanaRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x9)] 
public unsafe struct FDatShuffleChoiceMajorArcanaRecord
{
    [FieldOffset(0x0000)] public byte ArcanaID;
    [FieldOffset(0x0001)] public byte RankInPhase;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatShuffleChoiceMajorArcanaTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatShuffleChoiceMajorArcanaRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3)] 
public unsafe struct FDatShufflePersonaArcanaRecord
{
    [FieldOffset(0x0000)] public byte RankID;
    [FieldOffset(0x0001)] public byte PersonaID;
    [FieldOffset(0x0002)] public byte prob;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatShufflePersonaArcanaTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatShufflePersonaArcanaRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FDatShuffleCoinArcanaRecord
{
    [FieldOffset(0x0000)] public uint Max;
    [FieldOffset(0x0004)] public uint Min;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatShuffleCoinArcanaTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatShuffleCoinArcanaRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FDatShuffleCupArcanaRecord
{
    [FieldOffset(0x0000)] public byte RankID;
    [FieldOffset(0x0001)] public byte EffectID;
    [FieldOffset(0x0004)] public uint prob;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatShuffleCupArcanaTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatShuffleCupArcanaRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FDatShuffleLoversArcanaRecord
{
    [FieldOffset(0x0000)] public ushort CommuBonus;
    [FieldOffset(0x0002)] public ushort LoversBonus;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatShuffleLoversArcanaTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatShuffleLoversArcanaRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FDatShuffleArcanaNameRecord
{
    [FieldOffset(0x0000)] public FText Name;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatShuffleArcanaNameTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatShuffleArcanaNameRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FDatShuffleCommonCoefficientArcanaRecord
{
    [FieldOffset(0x0000)] public float Value;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatShuffleCommonCoefficientArcanaTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatShuffleCommonCoefficientArcanaRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FDatShuffleCommonItemdropArcanaRecord
{
    [FieldOffset(0x0000)] public byte RankID;
    [FieldOffset(0x0001)] public byte Num;
    [FieldOffset(0x0002)] public ushort prob;
    [FieldOffset(0x0004)] public uint ItemtID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatShuffleCommonItemdropArcanaTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatShuffleCommonItemdropArcanaRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FDatBtlCommonName
{
    [FieldOffset(0x0000)] public FText Name;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatBtlCommonNameTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatBtlCommonName> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FDatCalcPANICDropItemRecord
{
    [FieldOffset(0x0000)] public FDatEnemyItemTable Item;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatCalcPANICDropItemTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatCalcPANICDropItemRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2)] 
public unsafe struct FDatCalcPANICUseItemRecord
{
    [FieldOffset(0x0000)] public ushort ItemId;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatCalcPANICUseItemTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatCalcPANICUseItemRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x5)] 
public unsafe struct FDatEncountEnemyBadPercentRecord
{
    [FieldOffset(0x0000)] public byte Num1;
    [FieldOffset(0x0001)] public byte Num2;
    [FieldOffset(0x0002)] public byte Num3;
    [FieldOffset(0x0003)] public byte Num4;
    [FieldOffset(0x0004)] public byte NumOver5;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatEncountEnemyBadPercentTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatEncountEnemyBadPercentRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FDatBtlTheurgiaBoostRecord
{
    [FieldOffset(0x0000)] public short Value;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatBtlTheurgiaBoostTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatBtlTheurgiaBoostRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FDatBtlMixraidReleaseRecord
{
    [FieldOffset(0x0000)] public ushort PersonaAID;
    [FieldOffset(0x0002)] public ushort PersonaBID;
    [FieldOffset(0x0004)] public uint flag;
    [FieldOffset(0x0008)] public ushort Skill;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatBtlMixraidReleaseTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatBtlMixraidReleaseRecord> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x290)] 
public unsafe struct ATheurgiaAnimActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FBtlItemData
{
    [FieldOffset(0x0000)] public int IconSpr;
    [FieldOffset(0x0004)] public int ID;
    [FieldOffset(0x0008)] public int CategoryID;
    [FieldOffset(0x000C)] public int Num;
    [FieldOffset(0x0010)] public FString Name;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FBtlDataTargetRule
{
    [FieldOffset(0x0000)] public bool Me;
    [FieldOffset(0x0001)] public bool Other;
    [FieldOffset(0x0002)] public bool Dead;
    [FieldOffset(0x0003)] public bool DownOnly;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC8)] 
public unsafe struct UBtlDataBaseComponent
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD8)] 
public unsafe struct UBtlEnvironmentBase
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x00C8)] public TArray<IntPtr> BgObjList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct ABtlEventActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public bool bCompleteInit;
    [FieldOffset(0x0279)] public bool bStartScript;
    [FieldOffset(0x0280)] public UBtlEventController* pController;
    [FieldOffset(0x0288)] public int BtlEventProcNo;
    [FieldOffset(0x028C)] public bool isCommonAsset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C8)] 
public unsafe struct ABtlEventAlloutShuffleMonitor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0298)] public UBtlCoreComponent* pCore;
    [FieldOffset(0x02A0)] public ABtlShuffleMainBase* pShuffle;
    [FieldOffset(0x02A8)] public TSubclassOf<ABtlShuffleMainBase> ShuffleUIBp;
    [FieldOffset(0x02B0)] public UAssetLoader* Loader;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B8)] 
public unsafe struct ABtlEventBfLoader
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public bool bCompleteInit;
    [FieldOffset(0x0280)] public UAssetLoader* pAssetLoader;
    [FieldOffset(0x0288)] public UBfAsset* pBfAsset;
    [FieldOffset(0x0290)] public UBmdAsset* pBmdAsset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x140)] 
public unsafe struct UBtlEventController
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x00C8)] public bool bLoadCompleted;
    [FieldOffset(0x00C9)] public bool bCommonLoadCompleted;
    [FieldOffset(0x00D0)] public UBfAsset* pBfCommonAsset;
    [FieldOffset(0x00D8)] public UBmdAsset* pBmdCommonAsset;
    [FieldOffset(0x00E0)] public UBfAsset* pBfAsset;
    [FieldOffset(0x00E8)] public UBmdAsset* pBmdAsset;
    [FieldOffset(0x00F0)] public ABtlEventActor* pEventActor;
    [FieldOffset(0x00F8)] public FBtlEncountParam EncountParam;
    [FieldOffset(0x0118)] public UBtlCoreComponent* BtlCore;
    [FieldOffset(0x0120)] public TSubclassOf<AAppActor> SequencerObserveClass;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FBtlCutsceneHandleData
{
    [FieldOffset(0x0008)] public ULevelSequence* Scene;
    [FieldOffset(0x0010)] public UAssetLoader* Loader;
    [FieldOffset(0x0018)] public FString RowName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x9B0)] 
public unsafe struct UBtlEventCutsceneController
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UDataTable* SequenceTable;
    [FieldOffset(0x0030)] public FBtlCutsceneHandleData LoadSequence;
    [FieldOffset(0x0990)] public ALevelSequenceActor* SequenceActor;
    [FieldOffset(0x0998)] public UAssetLoader* LoaderTable;
    [FieldOffset(0x09A8)] public UAssetLoader* AllLoader;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FBtlFadeParam
{
    [FieldOffset(0x0000)] public bool isFadeOut;
    [FieldOffset(0x0004)] public float NowTime;
    [FieldOffset(0x0008)] public float MaxTime;
    [FieldOffset(0x000C)] public float Param;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2E8)] 
public unsafe struct ABtlFadeManager
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0298)] public bool isFadeing;
    [FieldOffset(0x0299)] public bool isScreenWrap;
    [FieldOffset(0x029A)] public bool isEnemyFlag;
    [FieldOffset(0x029B)] public bool isAIActionFlag;
    [FieldOffset(0x029C)] public EBtlFadeType Type;
    [FieldOffset(0x029D)] public EBtlFadeType ReceaveType;
    [FieldOffset(0x029E)] public bool bCrossFade;
    [FieldOffset(0x02A0)] public float CrossfadeTime;
    [FieldOffset(0x02A4)] public float CrossFadeMaxTime;
    [FieldOffset(0x02A8)] public bool LastFadeOut;
    [FieldOffset(0x02B0)] public TArray<FBtlFadeParam> fadeParam;
    [FieldOffset(0x02D0)] public TSubclassOf<ABtlFadeManager> LoadClass;
    [FieldOffset(0x02D8)] public UAssetLoader* pLoader;
}

[StructLayout(LayoutKind.Explicit, Size = 0x228)] 
public unsafe struct ABtlFormationPoint
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public bool IsForEnemies;
    [FieldOffset(0x0221)] public EBtlFormationSizeType SizeCategory;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD8)] 
public unsafe struct UBtlGuiAnalyzeComponent
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x00C8)] public UBmdAsset* BmdAsset;
    [FieldOffset(0x00D0)] public UAssetLoader* Loader;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3)] 
public unsafe struct FBtlGuiDrawFlag
{
    [FieldOffset(0x0000)] public bool InheritScale;
    [FieldOffset(0x0001)] public bool InheritAngle;
    [FieldOffset(0x0002)] public bool InheritColor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UBtlGuiDrawObjectCore
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public bool Visible;
    [FieldOffset(0x002C)] public int grpNo;
    [FieldOffset(0x0040)] public TArray<IntPtr> childObject;
    [FieldOffset(0x0050)] public FBtlGuiDrawFlag drawFlag;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UBtlGuiDrawObjectClearScreen
{
    [FieldOffset(0x0000)] public UBtlGuiDrawObjectCore baseObj;
    [FieldOffset(0x0058)] public FColor Color;
    [FieldOffset(0x005C)] public EBtlGuiOT OT;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FBtlBlendState
{
    [FieldOffset(0x0000)] public EBtlGuiBlendOp OpColor;
    [FieldOffset(0x0001)] public EBtlGuiBlendFactor SrcColor;
    [FieldOffset(0x0002)] public EBtlGuiBlendFactor DstColor;
    [FieldOffset(0x0003)] public EBtlGuiBlendOp OpAlpha;
    [FieldOffset(0x0004)] public EBtlGuiBlendFactor SrcAlpha;
    [FieldOffset(0x0005)] public EBtlGuiBlendFactor DstAlpha;
    [FieldOffset(0x0006)] public EBtlGuiColorWhiteMask ColorWMask;
    [FieldOffset(0x0007)] public EBtlGuiOT OT;
}

[StructLayout(LayoutKind.Explicit, Size = 0x34)] 
public unsafe struct FBtlGuiDrawStructCore
{
    [FieldOffset(0x0000)] public FVector2D Pos;
    [FieldOffset(0x0008)] public FVector2D Scale;
    [FieldOffset(0x0010)] public float Angle;
    [FieldOffset(0x0014)] public EBtlGuiAnchorPt anchor;
    [FieldOffset(0x0018)] public FVector2D scaleAnchorPos;
    [FieldOffset(0x0020)] public FVector2D angleAnchorPos;
    [FieldOffset(0x0028)] public FColor Color;
    [FieldOffset(0x002C)] public FBtlBlendState blendState;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct FBtlGuiDrawImage
{
    [FieldOffset(0x0000)] public FBtlGuiDrawStructCore baseObj;
    [FieldOffset(0x0038)] public UTexture* Texture;
    [FieldOffset(0x0040)] public float Width;
    [FieldOffset(0x0044)] public float Height;
    [FieldOffset(0x0048)] public EBtlGuiDrawType drawType;
    [FieldOffset(0x0050)] public FVector4 UV;
    [FieldOffset(0x0060)] public bool RevHorizontal;
    [FieldOffset(0x0061)] public bool RevVertical;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD0)] 
public unsafe struct UBtlGuiDrawObjectImage
{
    [FieldOffset(0x0000)] public UBtlGuiDrawObjectCore baseObj;
    [FieldOffset(0x0060)] public FBtlGuiDrawImage Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3C)] 
public unsafe struct FBtlGuiDrawPanel
{
    [FieldOffset(0x0000)] public FBtlGuiDrawStructCore baseObj;
    [FieldOffset(0x0034)] public float Width;
    [FieldOffset(0x0038)] public float Height;
}

[StructLayout(LayoutKind.Explicit, Size = 0x98)] 
public unsafe struct UBtlGuiDrawObjectPanel
{
    [FieldOffset(0x0000)] public UBtlGuiDrawObjectCore baseObj;
    [FieldOffset(0x0058)] public FBtlGuiDrawPanel Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct FBtlGuiDrawText
{
    [FieldOffset(0x0000)] public FBtlGuiDrawStructCore baseObj;
    [FieldOffset(0x0038)] public FString str;
    [FieldOffset(0x0048)] public EBtlGuiTextType textType;
    [FieldOffset(0x0049)] public EBtlGuiFontStyle fontStyle;
    [FieldOffset(0x004C)] public FVector2D adjustedScale;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB8)] 
public unsafe struct UBtlGuiDrawObjectText
{
    [FieldOffset(0x0000)] public UBtlGuiDrawObjectCore baseObj;
    [FieldOffset(0x0060)] public FBtlGuiDrawText Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x80)] 
public unsafe struct FBtlGuiDrawMsg
{
    [FieldOffset(0x0000)] public FBtlGuiDrawStructCore baseObj;
    [FieldOffset(0x0038)] public UBmdAsset* bmd;
    [FieldOffset(0x0050)] public int msgNo;
    [FieldOffset(0x0058)] public int pageNo;
    [FieldOffset(0x005C)] public int msgLine;
    [FieldOffset(0x0064)] public EBtlGuiTextType textType;
    [FieldOffset(0x0065)] public EBtlGuiFontStyle fontStyle;
    [FieldOffset(0x0068)] public float lineBreak;
    [FieldOffset(0x006C)] public int MaxRow;
    [FieldOffset(0x0070)] public FVector2D adjustedScale;
    [FieldOffset(0x0078)] public float RowOffset;
}

[StructLayout(LayoutKind.Explicit, Size = 0xE0)] 
public unsafe struct UBtlGuiDrawObjectMsg
{
    [FieldOffset(0x0000)] public UBtlGuiDrawObjectCore baseObj;
    [FieldOffset(0x0060)] public FBtlGuiDrawMsg Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct FBtlGuiDrawRect
{
    [FieldOffset(0x0000)] public FBtlGuiDrawStructCore baseObj;
    [FieldOffset(0x0040)] public FVector4 rect;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD0)] 
public unsafe struct UBtlGuiDrawObjectRect
{
    [FieldOffset(0x0000)] public UBtlGuiDrawObjectCore baseObj;
    [FieldOffset(0x0080)] public FBtlGuiDrawRect Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct FBtlGuiDrawSprite
{
    [FieldOffset(0x0000)] public FBtlGuiDrawStructCore baseObj;
    [FieldOffset(0x0038)] public USprAsset* Sprite;
    [FieldOffset(0x0040)] public int grpNo;
    [FieldOffset(0x0044)] public int SprNo;
    [FieldOffset(0x0048)] public EBtlGuiDrawType drawType;
    [FieldOffset(0x0049)] public bool RevHorizontal;
    [FieldOffset(0x004A)] public bool RevVertical;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD8)] 
public unsafe struct UBtlGuiDrawObjectSprite
{
    [FieldOffset(0x0000)] public UBtlGuiDrawObjectCore baseObj;
    [FieldOffset(0x0088)] public FBtlGuiDrawSprite Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct FBtlGuiDrawMaterial
{
    [FieldOffset(0x0000)] public FBtlGuiDrawStructCore baseObj;
    [FieldOffset(0x0040)] public FVector4 rect;
    [FieldOffset(0x0050)] public UMaterialInterface* Material;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC0)] 
public unsafe struct UBtlGuiDrawObjectMaterial
{
    [FieldOffset(0x0000)] public UBtlGuiDrawObjectCore baseObj;
    [FieldOffset(0x0060)] public FBtlGuiDrawMaterial Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct FBtlGuiDrawPlg
{
    [FieldOffset(0x0000)] public FBtlGuiDrawStructCore baseObj;
    [FieldOffset(0x0038)] public UPlgAsset* plg;
    [FieldOffset(0x0040)] public int plgNo;
    [FieldOffset(0x0044)] public bool reverseAlpha;
    [FieldOffset(0x0045)] public bool inverseX;
    [FieldOffset(0x0046)] public bool isMultiMode;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA0)] 
public unsafe struct UBtlGuiDrawObjectPlg
{
    [FieldOffset(0x0000)] public UBtlGuiDrawObjectCore baseObj;
    [FieldOffset(0x0058)] public FBtlGuiDrawPlg Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FBtlGuiVertex
{
    [FieldOffset(0x0000)] public FVector2D Pos;
    [FieldOffset(0x0008)] public FColor Color;
    [FieldOffset(0x000C)] public FVector2D UV;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct FBtlGuiDrawPrimitive
{
    [FieldOffset(0x0000)] public FBtlGuiDrawStructCore baseObj;
    [FieldOffset(0x0038)] public TArray<FBtlGuiVertex> vertex;
    [FieldOffset(0x0048)] public UTexture* Texture;
    [FieldOffset(0x0054)] public bool useAnriAlias;
    [FieldOffset(0x0055)] public bool SkipAntiFirstVtx;
    [FieldOffset(0x0056)] public bool reverseAlpha;
    [FieldOffset(0x0057)] public bool vertexLeftTurn;
    [FieldOffset(0x0058)] public EBtlGuiDrawType drawType;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB8)] 
public unsafe struct UBtlGuiDrawObjectPrimitive
{
    [FieldOffset(0x0000)] public UBtlGuiDrawObjectCore baseObj;
    [FieldOffset(0x0058)] public FBtlGuiDrawPrimitive Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct FBtlGuiDrawLineFrame
{
    [FieldOffset(0x0000)] public FBtlGuiDrawStructCore baseObj;
    [FieldOffset(0x0038)] public TArray<FBtlGuiVertex> vertex;
    [FieldOffset(0x0048)] public float lineLength;
    [FieldOffset(0x0050)] public bool useAnriAlias;
    [FieldOffset(0x0051)] public bool reverseAlpha;
    [FieldOffset(0x0052)] public bool vertexLeftTurn;
    [FieldOffset(0x0053)] public bool outStretch;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB0)] 
public unsafe struct UBtlGuiDrawObjectLineFrame
{
    [FieldOffset(0x0000)] public UBtlGuiDrawObjectCore baseObj;
    [FieldOffset(0x0058)] public FBtlGuiDrawLineFrame Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct FBtlGuiDrawRoundRect
{
    [FieldOffset(0x0000)] public FBtlGuiDrawStructCore baseObj;
    [FieldOffset(0x0034)] public float Width;
    [FieldOffset(0x0038)] public float Height;
    [FieldOffset(0x003C)] public int Round;
}

[StructLayout(LayoutKind.Explicit, Size = 0x98)] 
public unsafe struct UBtlGuiDrawObjectRoundRect
{
    [FieldOffset(0x0000)] public UBtlGuiDrawObjectCore baseObj;
    [FieldOffset(0x0058)] public FBtlGuiDrawRoundRect Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct FBtlGuiDrawSilhouette
{
    [FieldOffset(0x0000)] public FBtlGuiDrawStructCore baseObj;
    [FieldOffset(0x0038)] public UTexture* Texture;
    [FieldOffset(0x0040)] public float Width;
    [FieldOffset(0x0044)] public float Height;
    [FieldOffset(0x0050)] public FVector4 UV;
    [FieldOffset(0x0060)] public bool reverseAlpha;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD0)] 
public unsafe struct UBtlGuiDrawObjectSilhouette
{
    [FieldOffset(0x0000)] public UBtlGuiDrawObjectCore baseObj;
    [FieldOffset(0x0060)] public FBtlGuiDrawSilhouette Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0xE8)] 
public unsafe struct UBtlGuiDrawComponent
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x00C8)] public EBtlGuiCanvas canvasType;
    [FieldOffset(0x00D0)] public TArray<IntPtr> ItemAry;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct UBtlEncountWipeLoader
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0048)] public UAssetLoader* pLoader;
    [FieldOffset(0x0050)] public ACharacter* Chara;
    [FieldOffset(0x0070)] public TSubclassOf<ABtlEncountWipeCore> EncountBp;
    [FieldOffset(0x0078)] public TSubclassOf<ABtlEncountWipeCore> EventEncountBp;
    [FieldOffset(0x0080)] public TSubclassOf<ABtlEncountWipeCore> PinthEncountBp;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct ABtlEncountWipeCore
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0288)] public bool requestWipeOut;
    [FieldOffset(0x0289)] public bool isWraped;
    [FieldOffset(0x028A)] public bool isSequenceEnable;
    [FieldOffset(0x028B)] public EBtlEncountWipeType wipeType;
    [FieldOffset(0x0290)] public UBtlCoreComponent* Core;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C8)] 
public unsafe struct ABtlGuiEncountWipe
{
    [FieldOffset(0x0000)] public ABtlEncountWipeCore baseObj;
    [FieldOffset(0x02A0)] public ACharacter* Chara;
    [FieldOffset(0x02A8)] public bool IsEnd;
    [FieldOffset(0x02AC)] public FVector startLine;
    [FieldOffset(0x02B8)] public FVector endLine;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A8)] 
public unsafe struct ABtlGuiPinchEncountWipe
{
    [FieldOffset(0x0000)] public ABtlEncountWipeCore baseObj;
    [FieldOffset(0x02A0)] public bool IsEnd;
    [FieldOffset(0x02A1)] public bool IsAnimation;
    [FieldOffset(0x02A2)] public bool isTexDraw;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A8)] 
public unsafe struct ABtlGuiEventEncountWipe
{
    [FieldOffset(0x0000)] public ABtlEncountWipeCore baseObj;
    [FieldOffset(0x02A0)] public bool IsEnd;
    [FieldOffset(0x02A1)] public bool IsAnimation;
    [FieldOffset(0x02A2)] public bool isTexDraw;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct ABtlGuiFBufferCapture
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public TSubclassOf<ABtlGuiFBufferCapture> LoadClass;
    [FieldOffset(0x0280)] public UAssetLoader* pLoader;
    [FieldOffset(0x0288)] public bool isSetupCompleted;
    [FieldOffset(0x0289)] public bool isDraw;
    [FieldOffset(0x028A)] public bool is2DCapture;
    [FieldOffset(0x028C)] public float animationTime;
    [FieldOffset(0x0290)] public float endAnimationTime;
    [FieldOffset(0x0294)] public float endGtayScale;
    [FieldOffset(0x0298)] public float endWhiteOut;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FBtlGuiIconDamage
{
    [FieldOffset(0x0000)] public ABtlActor* pTarget;
    [FieldOffset(0x0008)] public int Damage;
    [FieldOffset(0x000C)] public int DamageSP;
    [FieldOffset(0x0010)] public EBtlGuiIconHit Hit;
    [FieldOffset(0x0011)] public EBtlGuiIconDamageType DamageType;
    [FieldOffset(0x0012)] public bool isPortionDamage;
    [FieldOffset(0x0013)] public bool isBadStatus;
    [FieldOffset(0x0014)] public bool isBadStatusRecovery;
    [FieldOffset(0x0015)] public bool isEndure;
    [FieldOffset(0x0018)] public float Delay;
    [FieldOffset(0x001C)] public float StepEndureRadio;
}

[StructLayout(LayoutKind.Explicit, Size = 0x100)] 
public unsafe struct UBtlGuiIconComponent
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x180)] 
public unsafe struct UBtlGuiListComponent
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x150)] 
public unsafe struct UBtlGuiPersonaStatusComponent
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x00C8)] public APersonaStatus* pActor;
    [FieldOffset(0x00D0)] public ABtlActor* pFirstCharacter;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC8)] 
public unsafe struct UBtlGuiPromiseComponent
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct ABtlGuiResourcesBase
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x350)] 
public unsafe struct ABtlGuiResourcesActor
{
    [FieldOffset(0x0000)] public ABtlGuiResourcesBase baseObj;
    [FieldOffset(0x02A0)] public UObject* pLoadAsset;
    [FieldOffset(0x02A8)] public UAssetLoader* pLoader;
    [FieldOffset(0x02B0)] public FString StackLoadPath;
    [FieldOffset(0x02C0)] public UUILayoutDataTable* pItemSkillListTextDataTable;
    [FieldOffset(0x02C8)] public UUILayoutDataTable* pTargetInfoTextDataTable;
    [FieldOffset(0x02D0)] public UUILayoutDataTable* pTacticsListTextDataTable;
    [FieldOffset(0x02D8)] public UUILayoutDataTable* pTheurgiaDataTable;
    [FieldOffset(0x02E0)] public UUILayoutDataTable* pTacticsDataTable;
    [FieldOffset(0x02E8)] public UUILayoutDataTable* pTopDataTable;
    [FieldOffset(0x02F0)] public UUILayoutDataTable* pGuardDataTable;
    [FieldOffset(0x02F8)] public UUILayoutDataTable* pTheurgiaTextDataTable;
    [FieldOffset(0x0300)] public UUILayoutDataTable* pTheurgiaTextRowDataTable;
    [FieldOffset(0x0308)] public UUILayoutDataTable* pTheurgiaTextPosDataTable;
    [FieldOffset(0x0310)] public UUILayoutDataTable* pTacticsCheckDataTable;
    [FieldOffset(0x0318)] public UUILayoutDataTable* pPromiseDataTable;
    [FieldOffset(0x0320)] public UUILayoutDataTable* pAnalyzeDataTable;
    [FieldOffset(0x0328)] public UUILayoutDataTable* pAnalyzeTextDataTable;
    [FieldOffset(0x0330)] public UUILayoutDataTable* pDamageIconDataTable;
    [FieldOffset(0x0338)] public UUILayoutDataTable* pRushDataTable;
    [FieldOffset(0x0340)] public UUILayoutDataTable* pOthersDataTable;
    [FieldOffset(0x0348)] public UUILayoutDataTable* pTouchCollDataTable;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct ABtlGuiResourcesLoadWatcher
{
    [FieldOffset(0x0000)] public ABtlGuiResourcesBase baseObj;
    [FieldOffset(0x0290)] public TSubclassOf<ABtlGuiResourcesActor> LoadClass;
    [FieldOffset(0x0298)] public UAssetLoader* pLoader;
}

[StructLayout(LayoutKind.Explicit, Size = 0xE0)] 
public unsafe struct UBtlGuiResources
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C)] 
public unsafe struct FBtlGuiRushEffectParam
{
    [FieldOffset(0x0000)] public float Intensity_float;
    [FieldOffset(0x0004)] public float LineDensity_float;
    [FieldOffset(0x0008)] public float LineThershold_float;
    [FieldOffset(0x000C)] public float LineWidthX_float;
    [FieldOffset(0x0010)] public float LineWidthY_float;
    [FieldOffset(0x0014)] public float MaskWidth_float;
    [FieldOffset(0x0018)] public float Speed_float;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2D0)] 
public unsafe struct ABtlGuiRushEffect
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UMaterialInterface* Material;
    [FieldOffset(0x0280)] public UMaterialInstanceDynamic* DynamicMaterial;
    [FieldOffset(0x0288)] public UMaterialParameterCollection* MPC;
    [FieldOffset(0x0294)] public int switchState;
    [FieldOffset(0x0298)] public int materialOt;
    [FieldOffset(0x029C)] public int renderOt;
    [FieldOffset(0x02A0)] public UAssetLoader* pLoader;
    [FieldOffset(0x02A8)] public bool bEffectEnable;
    [FieldOffset(0x02A9)] public bool bAnimationPause;
    [FieldOffset(0x02AA)] public bool bLoadComlpeted;
    [FieldOffset(0x02AB)] public bool bBtlFlag;
    [FieldOffset(0x02AC)] public FBtlGuiRushEffectParam defaultEffectParam;
    [FieldOffset(0x02C8)] public float maskWidth;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2D0)] 
public unsafe struct AEventSkipEffect
{
    [FieldOffset(0x0000)] public ABtlGuiRushEffect baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B0)] 
public unsafe struct ABtlGuiStateManager
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public EBtlGuiState nowState;
    [FieldOffset(0x0279)] public EBtlGuiState prevState;
    [FieldOffset(0x0280)] public TArray<EBtlGuiState> StateList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FBtlInputKeyParam
{
    [FieldOffset(0x0000)] public bool ru;
    [FieldOffset(0x0001)] public bool OK;
    [FieldOffset(0x0002)] public bool RL;
    [FieldOffset(0x0003)] public bool CANCEL;
    [FieldOffset(0x0004)] public bool LU;
    [FieldOffset(0x0005)] public bool LR;
    [FieldOffset(0x0006)] public bool LL;
    [FieldOffset(0x0007)] public bool LD;
    [FieldOffset(0x0008)] public bool R1;
    [FieldOffset(0x0009)] public bool L1;
    [FieldOffset(0x000A)] public bool R2;
    [FieldOffset(0x000B)] public bool L2;
    [FieldOffset(0x000C)] public bool R3;
    [FieldOffset(0x000D)] public bool L3;
    [FieldOffset(0x000E)] public bool OPTION;
    [FieldOffset(0x000F)] public bool Touch;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FBtlInputKey
{
    [FieldOffset(0x0000)] public FBtlInputKeyParam Trig;
    [FieldOffset(0x0010)] public FBtlInputKeyParam Press;
    [FieldOffset(0x0020)] public FBtlInputKeyParam Rep;
}

[StructLayout(LayoutKind.Explicit, Size = 0x260)] 
public unsafe struct UBtlInputComponent
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x00EB)] public FBtlInputKey InputKey;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C0)] 
public unsafe struct ABtlManager
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public ABtlControlBase* Control;
    [FieldOffset(0x0280)] public UAssetLoader* Loader;
    [FieldOffset(0x0290)] public TSubclassOf<ABtlControlBase> ControlAsset;
    [FieldOffset(0x0298)] public FBtlEncountParam Param;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct ABtlControlBase
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UBtlCoreComponent* BtlCore;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UBtlOrder
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TArray<IntPtr> InterruptList;
    [FieldOffset(0x0038)] public TArray<IntPtr> StandbyList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x278)] 
public unsafe struct ABtlPerformanceMonitor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct ABtlPhase
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public EBtlPhaseType Type;
    [FieldOffset(0x0279)] public bool ImplementInBP;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct ABtlPhaseVictory
{
    [FieldOffset(0x0000)] public ABtlPhase baseObj;
    [FieldOffset(0x0288)] public UBtlCompensation* CompensationData;
    [FieldOffset(0x0290)] public UBtlCoreComponent* BtlCore;
}

[StructLayout(LayoutKind.Explicit, Size = 0x570)] 
public unsafe struct ABtlPhaseResult
{
    [FieldOffset(0x0000)] public ABtlPhaseVictory baseObj;
    [FieldOffset(0x0360)] public ABtlResultSceneBase* _sceneBase;
    [FieldOffset(0x0368)] public ABtlResultUIBase* _uiBase;
    [FieldOffset(0x0370)] public UBtlResultViewData* _ViewData;
    [FieldOffset(0x0378)] public ABtlShuffleMainBase* _ShuffleMain;
    [FieldOffset(0x0380)] public UBtlGuiDrawObjectRect* ReactBackGround;
    [FieldOffset(0x0388)] public TSubclassOf<ABtlResultUIBase> ResutlUIBp;
    [FieldOffset(0x0390)] public TSubclassOf<ABtlShuffleMainBase> ShuffleUIBp;
    [FieldOffset(0x0398)] public UAssetLoader* Loader;
    [FieldOffset(0x03A8)] public ABtlPhase* PhaseVictory;
    [FieldOffset(0x03B0)] public bool hasVictoryPhase;
    [FieldOffset(0x03B1)] public bool isStartResultInVictory;
    [FieldOffset(0x03B2)] public bool ReadyForExitByVictoryPhase;
    [FieldOffset(0x0558)] public TArray<IntPtr> FoundActors;
}

[StructLayout(LayoutKind.Explicit, Size = 0x140)] 
public unsafe struct UBtlResidentDataBase
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x00C8)] public UNiagaraSystem* SummonVFX;
    [FieldOffset(0x00D0)] public UNiagaraSystem* SummonShellVFX;
    [FieldOffset(0x00D8)] public UNiagaraSystem* HitSlashVFX;
    [FieldOffset(0x00E0)] public UNiagaraSystem* HitPierceVFX;
    [FieldOffset(0x00E8)] public UNiagaraSystem* HitStrikeVFX;
    [FieldOffset(0x00F0)] public UNiagaraSystem* ReflectionVFX;
    [FieldOffset(0x00F8)] public UNiagaraSystem* AbsorptionVFX;
    [FieldOffset(0x0100)] public UNiagaraSystem* PersonaAuraVFX;
    [FieldOffset(0x0108)] public UNiagaraSystem* PersonaAuraShineVFX;
    [FieldOffset(0x0110)] public UNiagaraSystem* ShadowSummonVFX;
    [FieldOffset(0x0118)] public UNiagaraSystem* ShadowDeadVFX;
    [FieldOffset(0x0120)] public UNiagaraSystem* ShadowDeadSplashVFX;
    [FieldOffset(0x0128)] public UNiagaraSystem* HitPierceVFX_YukariCritical;
    [FieldOffset(0x0130)] public UAssetLoader* Loader;
    [FieldOffset(0x0138)] public bool LoadedResidentData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x400)] 
public unsafe struct ABtlResultResourceManager
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public TSubclassOf<ABtlResultUIBase> ResutlUIBp;
    [FieldOffset(0x0280)] public TSubclassOf<ABtlShuffleMainBase> ShuffleUIBp;
    [FieldOffset(0x0288)] public UBmdAsset* MessageBmd;
    [FieldOffset(0x0290)] public USprAsset* SprShuffle;
    [FieldOffset(0x0298)] public UPlgAsset* PlgShuffle;
    [FieldOffset(0x02A0)] public UAnimSequenceBase* AnimCardInSequence;
    [FieldOffset(0x02E0)] public UAnimSequenceBase* AnimCardIn;
    [FieldOffset(0x0308)] public UNiagaraSystem* CardSelectEffect;
    [FieldOffset(0x0310)] public UNiagaraSystem* CardBonusEffect;
    [FieldOffset(0x0318)] public ABtlShuffleArcanaManager* ArcanaManager;
    [FieldOffset(0x03B0)] public UTexture* AllGetDownTexture;
    [FieldOffset(0x03D0)] public USprAsset* SprResult;
    [FieldOffset(0x03D8)] public UBmdAsset* BmdResult;
    [FieldOffset(0x03E0)] public AAppPropsCardContainer* CardContainer;
    [FieldOffset(0x03F0)] public UAssetLoader* Loader;
}

[StructLayout(LayoutKind.Explicit, Size = 0x278)] 
public unsafe struct ABtlResultSceneBase
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FBtlResultPersonaParam
{
    [FieldOffset(0x0000)] public int PersonaID;
    [FieldOffset(0x0004)] public int Level;
    [FieldOffset(0x0008)] public FString Name;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FBtlResultItemParam
{
    [FieldOffset(0x0000)] public int ID;
    [FieldOffset(0x0004)] public int Num;
    [FieldOffset(0x0008)] public FString Name;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct FBtlResultHeroInfo
{
    [FieldOffset(0x0000)] public FString Name;
    [FieldOffset(0x0010)] public int Hp;
    [FieldOffset(0x0014)] public int MaxHp;
    [FieldOffset(0x0018)] public int Sp;
    [FieldOffset(0x001C)] public int MaxSp;
    [FieldOffset(0x0020)] public long NextExp;
    [FieldOffset(0x0028)] public int EquipRaceNo;
    [FieldOffset(0x002C)] public int EquipPersonaLevel;
    [FieldOffset(0x0030)] public FString EquipPersonaName;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FBtlResultAllyLvupParam
{
    [FieldOffset(0x0000)] public int PlayerId;
    [FieldOffset(0x0004)] public int Level;
    [FieldOffset(0x0008)] public bool isLevelUp;
}

[StructLayout(LayoutKind.Explicit, Size = 0x328)] 
public unsafe struct ABtlResultUIBase
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UBtlResultViewData* _ViewData;
    [FieldOffset(0x0280)] public bool isShowPlusWindos;
    [FieldOffset(0x0288)] public bool isCreateMsgWindow;
    [FieldOffset(0x0290)] public TArray<IntPtr> FoundActors;
    [FieldOffset(0x02B8)] public byte ShowingPersonaNum;
    [FieldOffset(0x02B9)] public byte ShowingPlayerNum;
    [FieldOffset(0x02BA)] public bool IsEndPersonaStatus;
    [FieldOffset(0x02BB)] public bool isEndHeroPersona;
    [FieldOffset(0x02BC)] public bool isEndAllyPersona;
    [FieldOffset(0x02C0)] public APersonaStatus* _PersonaStatusActor;
    [FieldOffset(0x02C8)] public UAssetLoader* Loader;
    [FieldOffset(0x02D0)] public USprAsset* SprResult;
    [FieldOffset(0x02D8)] public UBmdAsset* BmdResult;
    [FieldOffset(0x02E0)] public UTexture* EquipPersonaTexture;
    [FieldOffset(0x02E8)] public ABtlResultResourceManager* ResultResource;
    [FieldOffset(0x02F0)] public bool isEndPrepare;
    [FieldOffset(0x02F8)] public UDataTable* LayoutData;
    [FieldOffset(0x0300)] public UUILayoutDataTable* LayoutDataTable;
    [FieldOffset(0x0308)] public UDataTable* TextLayoutData;
    [FieldOffset(0x0310)] public UUILayoutDataTable* TextLayoutDataTable;
    [FieldOffset(0x0318)] public UDataTable* OkNextLayoutData;
    [FieldOffset(0x0320)] public UUILayoutDataTable* OkNextLayoutDataTable;
}

[StructLayout(LayoutKind.Explicit, Size = 0x90)] 
public unsafe struct UBtlResultViewData
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public long Exp;
    [FieldOffset(0x0030)] public long money;
    [FieldOffset(0x0050)] public TArray<byte> PartyAfterLevel;
    [FieldOffset(0x0060)] public bool HeroStatusShowFlag;
    [FieldOffset(0x0088)] public bool isBonusExpArcana;
    [FieldOffset(0x0089)] public bool isBonusExpTheurgia;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B8)] 
public unsafe struct ABtlScriptCommandEventBattle
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x278)] 
public unsafe struct ABtlSequencerObserve
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A8)] 
public unsafe struct ABtlShakeManager
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public TArray<TSubclassOf<UMatineeCameraShake>> PresetShakeClass;
    [FieldOffset(0x0288)] public UAssetLoader* Loader;
    [FieldOffset(0x0290)] public ABtlShakeManager* childActor;
    [FieldOffset(0x0298)] public TSubclassOf<ABtlShakeManager> ShakeAsset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C0)] 
public unsafe struct ABtlShuffleArcanaManager
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public TArray<int> RemainMajorArcana;
    [FieldOffset(0x0288)] public TArray<int> RemainMinorArcana;
    [FieldOffset(0x02A8)] public TArray<IntPtr> FoundActors;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB0)] 
public unsafe struct FShuffleCardInfo
{
    [FieldOffset(0x0000)] public AAppPropsCore* Card;
    [FieldOffset(0x0008)] public FVector Pos;
    [FieldOffset(0x0014)] public FVector PosBase;
    [FieldOffset(0x0020)] public FVector PosAllMove;
    [FieldOffset(0x002C)] public FVector PosWaittingMove;
    [FieldOffset(0x0038)] public FVector SpeedWatting;
    [FieldOffset(0x0044)] public float BaseRotX;
    [FieldOffset(0x0048)] public float BaseRotZ;
    [FieldOffset(0x004C)] public float RotationX;
    [FieldOffset(0x0050)] public float RotationZ;
    [FieldOffset(0x0054)] public float SppedRotationX;
    [FieldOffset(0x0058)] public float SppedRotationZ;
    [FieldOffset(0x005C)] public FVector PosMoveFrom;
    [FieldOffset(0x0068)] public FVector PosMoveTo;
    [FieldOffset(0x0074)] public float RotMoveXFrom;
    [FieldOffset(0x0078)] public float RotMoveXTo;
    [FieldOffset(0x007C)] public float RotMoveZFrom;
    [FieldOffset(0x0080)] public float RotMoveZTo;
    [FieldOffset(0x0084)] public float MoveLerpValue;
    [FieldOffset(0x0088)] public EBtlShuffleCardState MoveAfterState;
    [FieldOffset(0x008C)] public float MoveTime;
    [FieldOffset(0x0090)] public EBtlShuffleCardState State;
    [FieldOffset(0x0091)] public bool Moving;
    [FieldOffset(0x0092)] public bool isOutAnimeSelectEffect;
    [FieldOffset(0x0094)] public float SelectEffectAlpha;
    [FieldOffset(0x0098)] public EBtlShuffleCardEffectSelectState EffectSelectState;
    [FieldOffset(0x009C)] public float ValueCardRotation;
    [FieldOffset(0x00A0)] public float TimeWaitCardRotation;
    [FieldOffset(0x00A4)] public EBtlShuffleCardRotationState StateCardRotation;
    [FieldOffset(0x00A5)] public bool IsTickCard;
    [FieldOffset(0x00A6)] public bool IsStartMajorAppear;
    [FieldOffset(0x00A8)] public float RotationMajorAppear;
}

[StructLayout(LayoutKind.Explicit, Size = 0xF58)] 
public unsafe struct ABtlShuffleMainBase
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x030C)] public int SelectCoursorIndex;
    [FieldOffset(0x0310)] public int ShowCardsMax;
    [FieldOffset(0x0314)] public int EnableSelectNum;
    [FieldOffset(0x0318)] public bool IsFirstSelect;
    [FieldOffset(0x0319)] public bool IsStopButton;
    [FieldOffset(0x033C)] public int SelectedCardNum;
    [FieldOffset(0x0340)] public int ActionCardIndex;
    [FieldOffset(0x0344)] public bool IsStartMajorArcanaEffect;
    [FieldOffset(0x0345)] public EBtlShuffleCardState EffectMessagePage;
    [FieldOffset(0x0348)] public int PersonaSelectCoursorIndex;
    [FieldOffset(0x034C)] public int PersonaSelectState;
    [FieldOffset(0x0352)] public bool IsStartCharaAnime;
    [FieldOffset(0x0358)] public int AllGetBonousMessageIndex;
    [FieldOffset(0x035C)] public EBtlShuffleCardState AllGetBonousEffectMessageIndex;
    [FieldOffset(0x035D)] public bool isEndCardInAnime;
    [FieldOffset(0x035E)] public bool isEndPersonaListInFlag;
    [FieldOffset(0x035F)] public bool isEndArcanaBurstInFlag;
    [FieldOffset(0x0368)] public TArray<byte> AppearMajors;
    [FieldOffset(0x0390)] public UAssetLoader* Loader;
    [FieldOffset(0x0398)] public USprAsset* SprShuffle;
    [FieldOffset(0x03A0)] public UPlgAsset* PlgShuffle;
    [FieldOffset(0x03A8)] public UTutorialManager* pTutorialManager;
    [FieldOffset(0x03B0)] public UBmdAsset* MessageBmd;
    [FieldOffset(0x03B8)] public UTexture* AllGetDownTexture;
    [FieldOffset(0x03D8)] public UBtlGuiDrawObjectMsg* MsgShuffle;
    [FieldOffset(0x03E0)] public UBtlCompensation* CompensationData;
    [FieldOffset(0x03E8)] public ABtlShuffleArcanaManager* ArcanaManager;
    [FieldOffset(0x03F8)] public UBtlShufflePersonaList* PersonaList;
    [FieldOffset(0x0DC0)] public UAnimSequenceBase* AnimCardInSequence;
    [FieldOffset(0x0E00)] public UAnimSequenceBase* AnimCardIn;
    [FieldOffset(0x0E28)] public UNiagaraSystem* CardSelectEffect;
    [FieldOffset(0x0E30)] public UNiagaraSystem* CardBonusEffect;
    [FieldOffset(0x0E38)] public AAppPropsCardContainer* CardContainer;
    [FieldOffset(0x0E40)] public TArray<FShuffleCardInfo> CardInfos;
    [FieldOffset(0x0E88)] public APersonaStatus* _PersonaStatusActor;
    [FieldOffset(0x0ED0)] public ABtlResultResourceManager* ResultResource;
    [FieldOffset(0x0EE0)] public UUILayoutDataTable* LayoutDataTable;
    [FieldOffset(0x0EE8)] public UUILayoutDataTable* TextLayoutDataTable;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA50)] 
public unsafe struct UBtlShufflePersonaList
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct FBtlSkillParam
{
    [FieldOffset(0x0000)] public UNiagaraSystem* VFX;
    [FieldOffset(0x0008)] public EBtlSkillTargetType TargetType;
    [FieldOffset(0x0009)] public EBtlSkillPositionTargetType PositionType;
    [FieldOffset(0x000A)] public EBtlSkillPositionHeightType PositionHeight;
    [FieldOffset(0x000B)] public EBtlSkillDirectionTargetType Direction;
    [FieldOffset(0x000C)] public float Scale;
    [FieldOffset(0x0010)] public float StartTime;
    [FieldOffset(0x0014)] public float IntervalTime;
    [FieldOffset(0x0018)] public bool IsDamageEffect;
    [FieldOffset(0x0020)] public USoundAtomCue* SkillSE;
    [FieldOffset(0x0028)] public float SEVolumeRatio;
    [FieldOffset(0x002C)] public bool SE_UseCameraRangeParam;
    [FieldOffset(0x0030)] public float SE_CameraRangeMaxCM;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FBtlSkillCameraEffectParam
{
    [FieldOffset(0x0000)] public UNiagaraCameraAttachComponent* CameraEffect;
    [FieldOffset(0x0008)] public float StartTime;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2D8)] 
public unsafe struct ABtlSkill
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public TArray<FBtlSkillParam> EffectList;
    [FieldOffset(0x0288)] public float DestroyTime;
    [FieldOffset(0x028C)] public float DamageTime;
    [FieldOffset(0x0290)] public bool WaitUntilDestroy;
    [FieldOffset(0x0298)] public FBtlSkillCameraEffectParam CameraEffect;
    [FieldOffset(0x02A8)] public bool QuickAbsorptionEffectWhenAbsorptionOnly;
    [FieldOffset(0x02AC)] public float EnvAnimTime;
    [FieldOffset(0x02B0)] public bool UseLightEnvParam;
    [FieldOffset(0x02B4)] public float LightIntensityRatio;
    [FieldOffset(0x02B8)] public bool UseFogEnvParam;
    [FieldOffset(0x02BC)] public float FogPower;
    [FieldOffset(0x02C0)] public float FogDistance;
    [FieldOffset(0x02C4)] public float FogGradationRange;
    [FieldOffset(0x02C8)] public bool UseBGBlack;
    [FieldOffset(0x02CC)] public float BGBlackPower;
    [FieldOffset(0x02D0)] public bool IsOnlyAbsorptionMode;
}

[StructLayout(LayoutKind.Explicit, Size = 0xE0)] 
public unsafe struct UBtlSkillGeneratorComponent
{
    [FieldOffset(0x0000)] public UActorComponent baseObj;
    [FieldOffset(0x00C0)] public ABtlSkill* pSkill;
    [FieldOffset(0x00C8)] public TSubclassOf<ABtlSkill> SkillAsset;
    [FieldOffset(0x00D0)] public UAssetLoader* Loader;
    [FieldOffset(0x00D8)] public bool LoadRequested;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBtlSoundBPFuncLib
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UBtlSpecificEventBattle
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct UBtlSupportInfoBase
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UBtlSupportInfoMessage* SupportInfoMessage;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct UBtlSupportInfoCommonOnly
{
    [FieldOffset(0x0000)] public UBtlSupportInfoBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct UBtlSupportInfoFuka
{
    [FieldOffset(0x0000)] public UBtlSupportInfoBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC8)] 
public unsafe struct UBtlSupportInfoMessage
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UBmdAsset* commonBmdAsset;
    [FieldOffset(0x0030)] public UBmdAsset* currentNaviBmdAsset;
    [FieldOffset(0x0038)] public UDatSupportInfo* commonDataAsset;
    [FieldOffset(0x0040)] public UDatSupportInfo* currentNaviDataAsset;
    [FieldOffset(0x0048)] public UAssetLoader* Loader;
    [FieldOffset(0x0070)] public FString CommonBmdpath;
    [FieldOffset(0x0080)] public FString CommonTablepath;
    [FieldOffset(0x0090)] public FString CurrentNaviBmdpath;
    [FieldOffset(0x00A0)] public FString CurrentNaviTablepath;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct UBtlSupportInfoMituru
{
    [FieldOffset(0x0000)] public UBtlSupportInfoBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBtlSupportSound
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UBtlTableTypes
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x100)] 
public unsafe struct UBtlTargetsManagerComponent
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x00C8)] public TArray<IntPtr> Targets;
    [FieldOffset(0x00D8)] public TArray<IntPtr> EffectTargets;
    [FieldOffset(0x00E8)] public TArray<IntPtr> CursorTargets;
    [FieldOffset(0x00F8)] public ABtlActor* MainCharacter;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UBtlTutorialBase
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UBtlTutorial1st
{
    [FieldOffset(0x0000)] public UBtlTutorialBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UBtlTutorial2nd
{
    [FieldOffset(0x0000)] public UBtlTutorialBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UBtlTutorial3rd
{
    [FieldOffset(0x0000)] public UBtlTutorialBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UBtlTutorialTheurgia
{
    [FieldOffset(0x0000)] public UBtlBoss baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UBtlVoicePlayWatcher
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct UBtlVoice
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0058)] public ABtlActor* Character;
    [FieldOffset(0x0060)] public UBtlCoreComponent* Core;
    [FieldOffset(0x0068)] public UBtlVoicePlayWatcher* Watcher;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct UBtlPcVoice
{
    [FieldOffset(0x0000)] public UBtlVoice baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct UBtlBossVoice
{
    [FieldOffset(0x0000)] public UBtlVoice baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct UBtlBossStregaVoice
{
    [FieldOffset(0x0000)] public UBtlBossVoice baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct UBtlBossNyxAvatarVoice
{
    [FieldOffset(0x0000)] public UBtlBossVoice baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UBustupController
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public UBustupModel* pModel;
}

[StructLayout(LayoutKind.Explicit, Size = 0x128)] 
public unsafe struct UBustupObject
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UMaterialInterface* BaseMaterial_;
    [FieldOffset(0x0030)] public UMaterialInstanceDynamic* DrawableMaterial_;
    [FieldOffset(0x0040)] public UTexture* BaseTex_;
    [FieldOffset(0x0048)] public UTexture* ShadowMask_;
    [FieldOffset(0x0050)] public UTexture* RimLightMask_;
    [FieldOffset(0x0058)] public UTexture* EyeTex_;
    [FieldOffset(0x0070)] public UTexture* MouthTex_;
    [FieldOffset(0x0088)] public UTexture* BlushTex_;
    [FieldOffset(0x0090)] public UTexture* SweatTex_;
    [FieldOffset(0x0098)] public UTexture* BaseMask_;
    [FieldOffset(0x00A0)] public UTexture* DropMask_;
    [FieldOffset(0x00A8)] public UAssetLoader* Loader_;
    [FieldOffset(0x0118)] public UBustupAnimDataAsset* BustupAnim_;
    [FieldOffset(0x0120)] public USupportBustupDataAsset* SupportBustupOffset_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FBustupObjectBuffer
{
    [FieldOffset(0x0000)] public UBustupObject* BustupObject;
}

[StructLayout(LayoutKind.Explicit, Size = 0xF0)] 
public unsafe struct UBustupDraw
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0038)] public UBustupObject* BustupObject_;
    [FieldOffset(0x0040)] public UBustupObject* PrevBustupObject_;
    [FieldOffset(0x0048)] public TArray<FBustupObjectBuffer> ObjectBuffer_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UBustupModel
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0040)] public UBustupDraw* pBustupDraw;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FAppCalculationItem
{
    [FieldOffset(0x0000)] public float SrcValue;
    [FieldOffset(0x0004)] public float DstValue;
    [FieldOffset(0x0008)] public int Delay;
    [FieldOffset(0x000C)] public int DstFrame;
    [FieldOffset(0x0010)] public appCalculationType Type;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FAppCalculaterComponentWork
{
    [FieldOffset(0x0000)] public float Timer;
    [FieldOffset(0x0008)] public TArray<FAppCalculationItem> List;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB0)] 
public unsafe struct UAppCalculaterComponent
{
    [FieldOffset(0x0000)] public UActorComponent baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xB8)] 
public unsafe struct UCalendar
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0090)] public ACldBindingEventActor* mEventActor_;
    [FieldOffset(0x0098)] public uint mChangeFlag_;
    [FieldOffset(0x009C)] public ECldSceneChangeType mChangeType_;
    [FieldOffset(0x009D)] public ECldSceneChangeType mChangeSetted_;
    [FieldOffset(0x00A0)] public int mChangePrevDay_;
    [FieldOffset(0x00A4)] public ECldTimeZone mChangePrevTimeZone_;
    [FieldOffset(0x00A8)] public int mChangeNextDay_;
    [FieldOffset(0x00AC)] public ECldTimeZone mChangeNextTimeZone_;
    [FieldOffset(0x00B0)] public int cursorDay;
}

[StructLayout(LayoutKind.Explicit, Size = 0x298)] 
public unsafe struct ACalendarActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FCampModelControllerMotionItem
{
    [FieldOffset(0x0000)] public UAnimSequenceBase* pAnimSequence;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UCampModelControllerItem
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public TArray<FCampModelControllerMotionItem> AnimItems;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UCampPlayerModelControllerItem
{
    [FieldOffset(0x0000)] public UCampModelControllerItem baseObj;
    [FieldOffset(0x0048)] public TSubclassOf<ACharacter> pCharacterClass;
    [FieldOffset(0x0050)] public ACharacter* pCharacter;
    [FieldOffset(0x0058)] public UAnimMontage* pDefaultMontage;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UCampModelController
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public UAssetLoader* pAssetLoader;
    [FieldOffset(0x0038)] public TArray<IntPtr> Items;
}

[StructLayout(LayoutKind.Explicit, Size = 0x238)] 
public unsafe struct ACampSceneCapture
{
    [FieldOffset(0x0000)] public ASceneCapture2D baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FLipsyncAppListener
{
    [FieldOffset(0x0000)] public EAppCharCategoryType CharcterCategoryType;
    [FieldOffset(0x0004)] public int CharaIndexID;
    [FieldOffset(0x0008)] public int SoundMajorID;
    [FieldOffset(0x000C)] public int SoundMinorID;
    [FieldOffset(0x0010)] public float PlayingCheckWaitTime;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1A0)] 
public unsafe struct UCharacterLipsyncAppComponent
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x00C8)] public FLipsyncAppListener CurrentLipsyncParam;
    [FieldOffset(0x00E0)] public USkeletalMeshComponent* OwnerMesh;
    [FieldOffset(0x00E8)] public UAppCharBaseComp* AppCharacterComponent;
    [FieldOffset(0x00F0)] public TFieldPath<FFloatProperty> LipA_PropPath;
    [FieldOffset(0x0110)] public TFieldPath<FFloatProperty> LipI_PropPath;
    [FieldOffset(0x0130)] public TFieldPath<FFloatProperty> LipU_PropPath;
    [FieldOffset(0x0150)] public TFieldPath<FFloatProperty> LipE_PropPath;
    [FieldOffset(0x0170)] public TFieldPath<FFloatProperty> LipO_PropPath;
    [FieldOffset(0x0190)] public float mCurrentTotalTime;
    [FieldOffset(0x0198)] public UCurveFloat* mLipACurveDefault;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FCharacterSimpleLipsAnimAppParam
{
    [FieldOffset(0x0000)] public EAppCharCategoryType CharcterCategoryType;
    [FieldOffset(0x0004)] public int CharaIndexID;
    [FieldOffset(0x0008)] public float RequestedTotalTime;
    [FieldOffset(0x000C)] public float LipsPlayRate;
    [FieldOffset(0x0010)] public float StartLipsDelaySec;
    [FieldOffset(0x0018)] public UCurveFloat* LipACustomCurve;
    [FieldOffset(0x0020)] public AActor* CharaActorPtr;
    [FieldOffset(0x0028)] public int PlayerMajorID;
    [FieldOffset(0x002C)] public int PlayerMinorID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FCharacterSimpleLipsAnimAppListener
{
    [FieldOffset(0x0000)] public FCharacterSimpleLipsAnimAppParam SimpleLipsAnimParam;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1D8)] 
public unsafe struct UCharacterSimpleLipsAnimAppComponent
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x00C8)] public UCurveFloat* LipACurveDefault;
    [FieldOffset(0x00D0)] public float CurrentTotalLipDeltaTime;
    [FieldOffset(0x00D4)] public float CurrentTotalTime;
    [FieldOffset(0x00D8)] public float RequestedTotalEndTime;
    [FieldOffset(0x00DC)] public float LipsPlayRate;
    [FieldOffset(0x00E0)] public float StartLipsDelaySec;
    [FieldOffset(0x00E8)] public UCurveFloat* LipACustomCurve;
    [FieldOffset(0x00F0)] public int PlayerMajorID;
    [FieldOffset(0x00F4)] public int PlayerMinorID;
    [FieldOffset(0x00F8)] public FCharacterSimpleLipsAnimAppListener CurrentLipsyncParam;
    [FieldOffset(0x0128)] public USkeletalMeshComponent* OwnerMesh;
    [FieldOffset(0x0130)] public UAppCharBaseComp* AppCharacterComponent;
    [FieldOffset(0x0138)] public TFieldPath<FFloatProperty> LipA_PropPath;
    [FieldOffset(0x0158)] public TFieldPath<FFloatProperty> LipI_PropPath;
    [FieldOffset(0x0178)] public TFieldPath<FFloatProperty> LipU_PropPath;
    [FieldOffset(0x0198)] public TFieldPath<FFloatProperty> LipE_PropPath;
    [FieldOffset(0x01B8)] public TFieldPath<FFloatProperty> LipO_PropPath;
}

[StructLayout(LayoutKind.Explicit, Size = 0x90)] 
public unsafe struct UCharacterSimpleLipsAnimAppSubsystem
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
    [FieldOffset(0x0040)] public TMap<uint, FCharacterSimpleLipsAnimAppListener> SpeakCharacterMap;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct FCldBindingData
{
    [FieldOffset(0x0000)] public FString mBindingTag;
    [FieldOffset(0x0010)] public FString mAssetPath;
    [FieldOffset(0x0020)] public int mNpcSkeltonID;
    [FieldOffset(0x0024)] public short mCostumeID;
    [FieldOffset(0x0026)] public short mAnimSlotID;
    [FieldOffset(0x0028)] public bool mIsBag;
    [FieldOffset(0x0030)] public UClass* mBpClass;
    [FieldOffset(0x0038)] public AActor* mActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C8)] 
public unsafe struct ACldBindingEventActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x02A8)] public UAssetLoader* mAssetLoader_;
    [FieldOffset(0x02B0)] public TArray<FCldBindingData> mBindList_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UCldBpFuncLib
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x298)] 
public unsafe struct ACldCmnDataActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0288)] public UAssetLoader* mAssetLoader_;
    [FieldOffset(0x0290)] public UArcAsset* mArcAsset_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UCldCommonData
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public ACldCmnDataActor* mActor_;
    [FieldOffset(0x0048)] public UCldDateDataAsset* mDatesData_;
    [FieldOffset(0x0050)] public UClass* mBpClass_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x6)] 
public unsafe struct FCldDateTableItem
{
    [FieldOffset(0x0000)] public byte Month;
    [FieldOffset(0x0001)] public byte Day;
    [FieldOffset(0x0002)] public byte MoonAge;
    [FieldOffset(0x0003)] public bool IsHoliday;
    [FieldOffset(0x0004)] public bool IsPublicHoliday;
    [FieldOffset(0x0005)] public ECldDateColor NumColorType;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UCldDateDataAsset
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FCldDateTableItem> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FCldDateMessage
{
    [FieldOffset(0x0000)] public int Key;
    [FieldOffset(0x0004)] public ushort TotalDay;
    [FieldOffset(0x0006)] public byte Month;
    [FieldOffset(0x0007)] public byte Day;
    [FieldOffset(0x0008)] public ECldDateMsgPeriod Period;
    [FieldOffset(0x000C)] public uint MsgLabel;
    [FieldOffset(0x0010)] public uint VisibleFlag;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FCldDateMessageMonth
{
    [FieldOffset(0x0000)] public TArray<FCldDateMessage> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UCldDateMessageDataAsset
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FCldDateMessageMonth> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UCldSceneChange
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C8)] 
public unsafe struct ACldSchedulerActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0288)] public AUIVoiceConnect* mVoiceConnect_;
    [FieldOffset(0x02B0)] public UAssetLoader* mAssetLoader_;
    [FieldOffset(0x02B8)] public UClass* mBpClass_;
    [FieldOffset(0x02C0)] public AUtlProcActor* mProcActor_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UUtlBpObjCore
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UUtlBpObj
{
    [FieldOffset(0x0000)] public UUtlBpObjCore baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UCldSchedulerBpObject
{
    [FieldOffset(0x0000)] public UUtlBpObj baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B0)] 
public unsafe struct AUtlProcActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B0)] 
public unsafe struct ACldSchedulerProcActor
{
    [FieldOffset(0x0000)] public AUtlProcActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UCldTableTypes
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UCmpMenuBase
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public ACmpMainActor* pMainActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UCmpCalendar
{
    [FieldOffset(0x0000)] public UCmpMenuBase baseObj;
    [FieldOffset(0x0040)] public UAssetLoader* AssetLoader_;
    [FieldOffset(0x0048)] public AUICmpCalendar* Actor_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UUIScene
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x98)] 
public unsafe struct UCmpCharacterStatus
{
    [FieldOffset(0x0000)] public UUIScene baseObj;
    [FieldOffset(0x0058)] public UCmpHeroHumanStatus* HeroStatus_;
    [FieldOffset(0x0060)] public UUICmpStatus* Owner_;
}

[StructLayout(LayoutKind.Explicit, Size = 0xF10)] 
public unsafe struct UCmpCharacterStatusDraw
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0038)] public UCmpHeroHumanStatusDraw* HumanParamDraw_;
    [FieldOffset(0x0040)] public UUICmpStatus* pParent;
    [FieldOffset(0x0048)] public ACmpMainActor* pMainActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC60)] 
public unsafe struct UCmpCommu
{
    [FieldOffset(0x0000)] public UCmpMenuBase baseObj;
    [FieldOffset(0x0060)] public UTexture2D* pCommuBustupAry;
    [FieldOffset(0x0C48)] public UAssetLoader* AssetLoader_;
    [FieldOffset(0x0C50)] public AUICmpCommu* Actor_;
    [FieldOffset(0x0C58)] public ACmpCommuModelController* pModelController;
}

[StructLayout(LayoutKind.Explicit, Size = 0x968)] 
public unsafe struct UCmpCommuDetails
{
    [FieldOffset(0x0000)] public UUIScene baseObj;
    [FieldOffset(0x0060)] public AUICmpCommu* Context_;
    [FieldOffset(0x08B0)] public AUICmpCommu* pParent;
    [FieldOffset(0x08B8)] public ACmpMainActor* pMainActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x550)] 
public unsafe struct UCmpCommuList
{
    [FieldOffset(0x0000)] public UUIScene baseObj;
    [FieldOffset(0x04C0)] public AUICmpCommu* Context_;
    [FieldOffset(0x04C8)] public AUICmpCommu* pParent;
    [FieldOffset(0x04D0)] public ACmpMainActor* pMainActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2D0)] 
public unsafe struct UCmpCommuCardAnimInstance
{
    [FieldOffset(0x0000)] public UAnimInstance baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2E8)] 
public unsafe struct ACmpCommuModelController
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x02B0)] public ACmpMainActor* pMainActor;
    [FieldOffset(0x02B8)] public AAppPropsCardContainer* pCardContainer;
    [FieldOffset(0x02C0)] public AAppPropsCore* pCardBp;
    [FieldOffset(0x02C8)] public TArray<IntPtr> pTextures;
    [FieldOffset(0x02D8)] public TArray<IntPtr> pMotions;
}

[StructLayout(LayoutKind.Explicit, Size = 0x330)] 
public unsafe struct UCmpEquip
{
    [FieldOffset(0x0000)] public UCmpMenuBase baseObj;
    [FieldOffset(0x0278)] public UCmpEquipSystem* PSystem;
    [FieldOffset(0x0280)] public UCmpEquipDraw* pDraw;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3528)] 
public unsafe struct UCmpEquipDraw
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x34C0)] public ACmpMainActor* pMainActor;
    [FieldOffset(0x34C8)] public UCmpEquip* pParent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FEquipListItem
{
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct UCmpEquipSystem
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TArray<short> PartyMemberList;
    [FieldOffset(0x0038)] public TArray<FEquipListItem> EquipList;
    [FieldOffset(0x0048)] public TArray<FEquipListItem> LastEquipList;
    [FieldOffset(0x0060)] public ACmpMainActor* pMainActor;
    [FieldOffset(0x0068)] public UCmpEquip* pParent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UCmpHeroHumanStatus
{
    [FieldOffset(0x0000)] public UUIScene baseObj;
    [FieldOffset(0x0050)] public UCmpHeroHumanStatusDraw* pOffHumanParamDraw_;
    [FieldOffset(0x0058)] public UUICmpStatus* pParent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4138)] 
public unsafe struct UCmpHeroHumanStatusDraw
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x4048)] public ACmpMainActor* pMainActor;
    [FieldOffset(0x4050)] public UUICmpStatus* pParent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x240)] 
public unsafe struct UCmpItem
{
    [FieldOffset(0x0000)] public UCmpMenuBase baseObj;
    [FieldOffset(0x0188)] public UCmpItemSystem* PSystem;
    [FieldOffset(0x0190)] public UCmpItemDraw* pDraw;
    [FieldOffset(0x0198)] public APersonaStatus* pPersonaStatus;
}

[StructLayout(LayoutKind.Explicit, Size = 0x608)] 
public unsafe struct UCmpItemDraw
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0038)] public ACmpMainActor* pMainActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FItemListItem
{
}

[StructLayout(LayoutKind.Explicit, Size = 0x798)] 
public unsafe struct UCmpItemSystem
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0768)] public TArray<short> PartyMemberList;
    [FieldOffset(0x0778)] public TArray<int> PersonaStockIDList;
    [FieldOffset(0x0788)] public TArray<FItemListItem> ItemList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30F0)] 
public unsafe struct ACmpMainActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x12C8)] public UAssetLoader* pAssetLoader;
    [FieldOffset(0x12D0)] public TSubclassOf<ACampSceneCapture> SceneCaptureClass;
    [FieldOffset(0x12D8)] public ACampSceneCapture* pSceneCapture2D;
    [FieldOffset(0x12E0)] public UMaterialInstance* pCaptureMaterial;
    [FieldOffset(0x12E8)] public UMaterialInstanceDynamic* pCaptureInstanceDynamic;
    [FieldOffset(0x12F0)] public UMaterialInstance* pOutlineMaterial;
    [FieldOffset(0x12F8)] public UMaterialInstanceDynamic* pOutlineInstanceDynamic;
    [FieldOffset(0x1300)] public UMaterial* pSimpleCopyMaterial;
    [FieldOffset(0x1308)] public UMaterialInstanceDynamic* pSimpleCopyMateDynamic;
    [FieldOffset(0x1310)] public UMaterial* pHologramMaterial;
    [FieldOffset(0x1318)] public UMaterialInstanceDynamic* pHologramMateDynamic;
    [FieldOffset(0x1320)] public UTexture2D* HologMaskTexAAry;
    [FieldOffset(0x1328)] public UTexture2D* HologMaskTexBAry;
    [FieldOffset(0x1330)] public UTexture2D* HologMaskTexCAry;
    [FieldOffset(0x1338)] public UTexture2D* HologMaskTexDAry;
    [FieldOffset(0x1340)] public UMaterialInstanceDynamic* pGlassMateDynamic;
    [FieldOffset(0x1348)] public UTextureRenderTarget2D* pCaptureRenderTarget;
    [FieldOffset(0x1350)] public UTexture2D* HeroGaussMaskTexAry;
    [FieldOffset(0x13A8)] public UTexture2D* pOutAnimationTexture;
    [FieldOffset(0x13B0)] public USprAsset* pSprCommon;
    [FieldOffset(0x13B8)] public UUimAsset* pUimBgAry;
    [FieldOffset(0x13C8)] public UDataTable* pParamHologTable;
    [FieldOffset(0x13D0)] public UDataTable* pParamTopTable;
    [FieldOffset(0x13D8)] public UDataTable* pParamSkillTable;
    [FieldOffset(0x13E0)] public UDataTable* pParamItemTable;
    [FieldOffset(0x13E8)] public UDataTable* pParamEquipTable;
    [FieldOffset(0x13F0)] public UDataTable* pParamPersonaTable;
    [FieldOffset(0x13F8)] public UDataTable* pParamStatusTable;
    [FieldOffset(0x1400)] public UDataTable* pParamRankUpTable;
    [FieldOffset(0x1408)] public UDataTable* pParamCommuTable;
    [FieldOffset(0x1410)] public UDataTable* pParamSystemTable;
    [FieldOffset(0x1418)] public UDataTable* pParamCommonTable;
    [FieldOffset(0x1420)] public UDataTable* pCameraTable;
    [FieldOffset(0x1428)] public UDataTable* pHologramTable;
    [FieldOffset(0x1430)] public UMaterial* pMateWaveCaustics;
    [FieldOffset(0x1438)] public UDataTable* pParamLayoutDataRoot;
    [FieldOffset(0x1440)] public UDataTable* pParamLayoutDataSystem;
    [FieldOffset(0x1448)] public UDataTable* pParamTriangularCursorDataRoot;
    [FieldOffset(0x1450)] public UDataTable* pParamTriangularCursorDataSystem;
    [FieldOffset(0x1458)] public UDataTable* pParamLayoutDataQuest;
    [FieldOffset(0x1460)] public UDataTable* pParamLayoutDataQuestDate;
    [FieldOffset(0x1468)] public UDataTable* pParamLayoutPersonaList;
    [FieldOffset(0x1470)] public UDataTable* pParamLayoutDataItem;
    [FieldOffset(0x1478)] public UDataTable* pParamLayoutDataSkill;
    [FieldOffset(0x1480)] public UDataTable* pParamLayoutDataSkill2;
    [FieldOffset(0x1488)] public UDataTable* pParamLayoutDataOthers;
    [FieldOffset(0x1490)] public UDataTable* pParamLayoutDataHelpOthers;
    [FieldOffset(0x1498)] public UDataTable* pParamLayoutDataPartyPanel;
    [FieldOffset(0x14A0)] public UDataTable* pParamLayoutDataTutorialText;
    [FieldOffset(0x14A8)] public UDataTable* pParamLayoutDataDictionaryText;
    [FieldOffset(0x14B0)] public UDataTable* pParamLayoutDataCalendarText;
    [FieldOffset(0x14B8)] public UDataTable* pParamLayoutDataEquipTextCol;
    [FieldOffset(0x14C0)] public UDataTable* pParamLayoutDataItemTextCol;
    [FieldOffset(0x14C8)] public UDataTable* pParamLayoutDataQuestTextCol;
    [FieldOffset(0x14D0)] public UDataTable* pParamLayoutDataQuestTextPos;
    [FieldOffset(0x14D8)] public UDataTable* pParamLayoutDataCommuTextCol;
    [FieldOffset(0x14E0)] public UDataTable* pParamLayoutDataStatusTextCol;
    [FieldOffset(0x14E8)] public UDataTable* pParamLayoutDataOkNext;
    [FieldOffset(0x14F0)] public UDataTable* pParamLayoutDataOkNextMask;
    [FieldOffset(0x14F8)] public UDataTable* pParamLayoutDataRootTouchColl;
    [FieldOffset(0x1500)] public UDataTable* pParamLayoutDataSystemTouchColl;
    [FieldOffset(0x1508)] public UUimAsset* pUimNamiRootAAry;
    [FieldOffset(0x15F8)] public UUimAsset* pUimNamiRootBAry;
    [FieldOffset(0x16E8)] public UUimAsset* pUimNamiSkillAAry;
    [FieldOffset(0x17D8)] public UUimAsset* pUimNamiSkillBAry;
    [FieldOffset(0x18C8)] public UUimAsset* pUimNamiItemAAry;
    [FieldOffset(0x19B8)] public UUimAsset* pUimNamiItemBAry;
    [FieldOffset(0x1AA8)] public UUimAsset* pUimNamiEquipAAry;
    [FieldOffset(0x1B98)] public UUimAsset* pUimNamiEquipBAry;
    [FieldOffset(0x1C88)] public UUimAsset* pUimNamiPersonaAAry;
    [FieldOffset(0x1D78)] public UUimAsset* pUimNamiPersonaBAry;
    [FieldOffset(0x1E68)] public UUimAsset* pUimNamiStatusAAry;
    [FieldOffset(0x1F58)] public UUimAsset* pUimNamiStatusBAry;
    [FieldOffset(0x2048)] public UUimAsset* pUimNamiQuestAAry;
    [FieldOffset(0x2138)] public UUimAsset* pUimNamiQuestBAry;
    [FieldOffset(0x2228)] public UUimAsset* pUimNamiCommuAAry;
    [FieldOffset(0x2318)] public UUimAsset* pUimNamiCommuBAry;
    [FieldOffset(0x2408)] public UUimAsset* pUimNamiCalendarAAry;
    [FieldOffset(0x24F8)] public UUimAsset* pUimNamiCalendarBAry;
    [FieldOffset(0x25E8)] public UUimAsset* pUimNamiSystemAAry;
    [FieldOffset(0x26D8)] public UUimAsset* pUimNamiSystemBAry;
    [FieldOffset(0x27C8)] public UUimAsset* pUimNamiTutorialAAry;
    [FieldOffset(0x28B8)] public UUimAsset* pUimNamiTutorialBAry;
    [FieldOffset(0x29A8)] public UUimAsset* pUimNamiConfigAAry;
    [FieldOffset(0x2A98)] public UUimAsset* pUimNamiConfigBAry;
    [FieldOffset(0x2B88)] public UTexture2D* pCharaGlassAry;
    [FieldOffset(0x2BD8)] public UTexture2D* pCharaDetailAry;
    [FieldOffset(0x2C28)] public UTexture2D* pCharaDetailShdAry;
    [FieldOffset(0x2C98)] public TArray<IntPtr> MenuList;
    [FieldOffset(0x2CB0)] public UCmpMenuBase* pCurrentMenu;
    [FieldOffset(0x2CB8)] public UCmpMenuBase* pNextMenu;
    [FieldOffset(0x2CC0)] public UCmpMenuBase* pPrevMenu;
    [FieldOffset(0x2CC8)] public UCampModelController* pModelController;
    [FieldOffset(0x2CD0)] public ACmpMainLoadActor* pCmpMainLoadActor;
    [FieldOffset(0x2CE0)] public TSubclassOf<ACharacter> pHeroCharaClass;
    [FieldOffset(0x2CE8)] public UAppAnimCtrl* pHeroAnimCtrl;
    [FieldOffset(0x2CF0)] public TArray<IntPtr> MateInterAry;
    [FieldOffset(0x2D00)] public bool bIsDisableForceTermination;
    [FieldOffset(0x2D02)] public bool bEquipChange;
    [FieldOffset(0x2D03)] public bool bReturnCommuToField;
    [FieldOffset(0x2D08)] public UUIRequest* pUIRequest;
    [FieldOffset(0x2D10)] public UUIMissingPerson* pUIMissingPerson;
    [FieldOffset(0x2D18)] public UUITheurgia* pUITheurgia;
    [FieldOffset(0x3028)] public UUILayoutDataTable* RootLayoutDataTable;
    [FieldOffset(0x3030)] public UUILayoutDataTable* SystemLayoutDataTable;
    [FieldOffset(0x3038)] public UUILayoutDataTable* QuestLayoutDataTable;
    [FieldOffset(0x3040)] public UUILayoutDataTable* QuestDateLayoutDataTable;
    [FieldOffset(0x3048)] public UUILayoutDataTable* OthersLayoutDataTable;
    [FieldOffset(0x3050)] public UUILayoutDataTable* HelpOthersLayoutDataTable;
    [FieldOffset(0x3058)] public UUILayoutDataTable* PersonaListLayoutDataTable;
    [FieldOffset(0x3060)] public UUILayoutDataTable* ItemLayoutDataTable;
    [FieldOffset(0x3068)] public UUILayoutDataTable* SkillLayoutDataTable;
    [FieldOffset(0x3070)] public UUILayoutDataTable* SkillLayoutDataTable2;
    [FieldOffset(0x3078)] public UUILayoutDataTable* PartyPanelLayoutDataTable;
    [FieldOffset(0x3080)] public UUILayoutDataTable* TutorialTextLayoutDataTable;
    [FieldOffset(0x3088)] public UUILayoutDataTable* DictionaryTextLayoutDataTable;
    [FieldOffset(0x3090)] public UUILayoutDataTable* CalendarTextLayoutDataTable;
    [FieldOffset(0x3098)] public UUILayoutDataTable* EquipTextColLayoutDataTable;
    [FieldOffset(0x30A0)] public UUILayoutDataTable* ItemTextColLayoutDataTable;
    [FieldOffset(0x30A8)] public UUILayoutDataTable* QuestTextColLayoutDataTable;
    [FieldOffset(0x30B0)] public UUILayoutDataTable* QuestTextPosLayoutDataTable;
    [FieldOffset(0x30B8)] public UUILayoutDataTable* CommuTextColLayoutDataTable;
    [FieldOffset(0x30C0)] public UUILayoutDataTable* StatusTextColLayoutDataTable;
    [FieldOffset(0x30C8)] public UUILayoutDataTable* OkNextLayoutDataTable;
    [FieldOffset(0x30D0)] public UUILayoutDataTable* OkNextMaskLayoutDataTable;
    [FieldOffset(0x30D8)] public UUILayoutDataTable* RootTouchCollLayoutDataTable;
    [FieldOffset(0x30E0)] public UUILayoutDataTable* SystemTouchCollLayoutDataTable;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UCampLoadSequenceBase
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UCallFieldSequence
{
    [FieldOffset(0x0000)] public UCampLoadSequenceBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct UCallTitleSequence
{
    [FieldOffset(0x0000)] public UCampLoadSequenceBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x288)] 
public unsafe struct ACmpMainLoadActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UCampLoadSequenceBase* pSequence;
    [FieldOffset(0x0280)] public ACmpMainActor* pParent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x460)] 
public unsafe struct UCmpPersona
{
    [FieldOffset(0x0000)] public UCmpMenuBase baseObj;
    [FieldOffset(0x0048)] public UAssetLoader* AssetLoader_;
    [FieldOffset(0x0050)] public UMaterialInstanceDynamic* pDynaMateWaveCausticsAry;
    [FieldOffset(0x0110)] public UTexture2D* pTexArcanaWordAry;
    [FieldOffset(0x01D0)] public AUICmpPersona* Actor_;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD8)] 
public unsafe struct UCmpPersonaList
{
    [FieldOffset(0x0000)] public UUIScene baseObj;
    [FieldOffset(0x0088)] public AUICmpPersona* Context_;
    [FieldOffset(0x0090)] public APersonaStatus* PSStatusActor_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x230)] 
public unsafe struct UCmpQuest
{
    [FieldOffset(0x0000)] public UCmpMenuBase baseObj;
    [FieldOffset(0x0040)] public USprAsset* m_pSpr;
    [FieldOffset(0x0048)] public UAssetLoader* AssetLoader_;
    [FieldOffset(0x0050)] public USprAsset* m_pCampSpr;
    [FieldOffset(0x0058)] public USprAsset* m_pCampKeySpr;
    [FieldOffset(0x0060)] public UPlgAsset* m_pCampPlg;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC0)] 
public unsafe struct UCmpRoot
{
    [FieldOffset(0x0000)] public UCmpMenuBase baseObj;
    [FieldOffset(0x0088)] public UCmpRootDraw* pRootDraw;
}

[StructLayout(LayoutKind.Explicit, Size = 0x878)] 
public unsafe struct UCmpRootDraw
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0828)] public UUimAsset* pUimTextCursorOn;
    [FieldOffset(0x0830)] public UUimAsset* pUimCursorLoop;
    [FieldOffset(0x0838)] public UUimAsset* pUimCursorInBounce;
    [FieldOffset(0x0840)] public TArray<IntPtr> pMenuItemInstanceDynamics;
    [FieldOffset(0x0850)] public UMaterial* pMetaricMaterial;
    [FieldOffset(0x0858)] public UMaterial* pWriteMetaricMaterial;
    [FieldOffset(0x0860)] public UMaterialInstanceDynamic* pWriteMetaricInstanceDynamics;
    [FieldOffset(0x0868)] public ACmpMainActor* pMainActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x160)] 
public unsafe struct UCmpSkill
{
    [FieldOffset(0x0000)] public UCmpMenuBase baseObj;
    [FieldOffset(0x0100)] public UCmpSkillDraw* pSkillDraw;
    [FieldOffset(0x0108)] public UCmpSkillSystem* pSkillSystem;
}

[StructLayout(LayoutKind.Explicit, Size = 0x548)] 
public unsafe struct UCmpSkillDraw
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0038)] public ACmpMainActor* pMainActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UCmpSkillSystem
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x248)] 
public unsafe struct UCmpStatus
{
    [FieldOffset(0x0000)] public UCmpMenuBase baseObj;
    [FieldOffset(0x0058)] public UUICmpStatus* Actor_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x118)] 
public unsafe struct UCmpStatusCharacterList
{
    [FieldOffset(0x0000)] public UUIScene baseObj;
    [FieldOffset(0x00B8)] public UUICmpStatus* Owner_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x870)] 
public unsafe struct UCmpStatusCharacterListDraw
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UUICmpStatus* pParent;
    [FieldOffset(0x0030)] public ACmpMainActor* pMainActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x118)] 
public unsafe struct UCmpSystem
{
    [FieldOffset(0x0000)] public UCmpMenuBase baseObj;
    [FieldOffset(0x00A8)] public UCmpSystemDraw* pSystemDraw;
    [FieldOffset(0x00B0)] public UCmpSystemSystem* pSystemSystem;
    [FieldOffset(0x00B8)] public AUISaveLoad* pSaveMenu;
    [FieldOffset(0x00C0)] public AUITutorial* pTutorial;
    [FieldOffset(0x00C8)] public AUIDictionary* pDictionary;
    [FieldOffset(0x00D0)] public TSubclassOf<AUITutorialDraw> pTutorialDrawClass;
    [FieldOffset(0x00D8)] public AUIConfiguration* pConfig;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1408)] 
public unsafe struct UCmpSystemDraw
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0048)] public TArray<IntPtr> SubMenuMateDynamicAry;
    [FieldOffset(0x13F8)] public ACmpMainActor* pMainActor;
    [FieldOffset(0x1400)] public UCmpSystem* pParent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UCmpSystemSystem
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0040)] public ACmpMainActor* pCmpMainActor;
    [FieldOffset(0x0048)] public AUISaveLoad* pSaveMenu;
    [FieldOffset(0x0050)] public AUIRestore* pRestoreMenu;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct ACombineTest
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UUICombineCalc* CombineCalc_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C)] 
public unsafe struct FCommunityCallEventData
{
    [FieldOffset(0x0000)] public int Rank;
    [FieldOffset(0x0004)] public int major;
    [FieldOffset(0x0008)] public int Minor;
    [FieldOffset(0x000C)] public uint Flag0;
    [FieldOffset(0x0010)] public uint Flag1;
    [FieldOffset(0x0014)] public uint Flag2;
    [FieldOffset(0x0018)] public uint Flag3;
}

[StructLayout(LayoutKind.Explicit, Size = 0x290)] 
public unsafe struct ACommunityEventManager
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0280)] public TArray<FCommunityCallEventData> CallEventList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x148)] 
public unsafe struct UCommunityHandler
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x00F0)] public UCommunityEventDataAsset* pEventDataAsset;
    [FieldOffset(0x00F8)] public UHolidayEventDataAsset* pHolidayEventDataAsset;
    [FieldOffset(0x0100)] public UHolidayScheduleDataAsset* pHolidayScheduleDataAsset;
    [FieldOffset(0x0108)] public UDataTable* pMemberFormatTable;
    [FieldOffset(0x0110)] public UDataTable* pNameFormatTable;
    [FieldOffset(0x0118)] public UCoefficientDataAsset* pCoefficientDataAsset;
    [FieldOffset(0x0120)] public UCommunityPresentDataAsset* pPresentDataAsset;
    [FieldOffset(0x0128)] public UMoviesEventDataAsset* pMoviesEventDataAsset;
    [FieldOffset(0x0130)] public USummerFestivalEventDataAsset* pSummerFestivalEventDataAsset;
    [FieldOffset(0x0138)] public UChristmasEventDataAsset* pChristmasEventDataAsset;
    [FieldOffset(0x0140)] public ACommunityEventManager* pEventManager;
}

[StructLayout(LayoutKind.Explicit, Size = 0x290)] 
public unsafe struct ADebugViewer
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0280)] public UDebugMenu* pMenu;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B8)] 
public unsafe struct ACommunityShortcut
{
    [FieldOffset(0x0000)] public ADebugViewer baseObj;
    [FieldOffset(0x02A0)] public AScrActor* pScript;
    [FieldOffset(0x02A8)] public UBfAsset* pBfAsset;
    [FieldOffset(0x02B0)] public UAssetLoader* pAssetLoader;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FCommunityEventData
{
    [FieldOffset(0x0000)] public int Rank;
    [FieldOffset(0x0004)] public int major;
    [FieldOffset(0x0008)] public int Minor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C)] 
public unsafe struct FCommunityRankUpEventData
{
    [FieldOffset(0x0000)] public short Rank;
    [FieldOffset(0x0002)] public short Point;
    [FieldOffset(0x0004)] public short major;
    [FieldOffset(0x0006)] public short Minor;
    [FieldOffset(0x0008)] public sbyte Brain;
    [FieldOffset(0x0009)] public sbyte charm;
    [FieldOffset(0x000A)] public sbyte Courage;
    [FieldOffset(0x000C)] public uint Flag0;
    [FieldOffset(0x0010)] public uint Flag1;
    [FieldOffset(0x0014)] public uint Flag2;
    [FieldOffset(0x0018)] public uint Flag3;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FCommunityEventTable
{
    [FieldOffset(0x0000)] public TArray<FCommunityEventData> NotRankUpTable;
    [FieldOffset(0x0010)] public TArray<FCommunityRankUpEventData> RankUpTable;
    [FieldOffset(0x0020)] public TArray<FCommunityRankUpEventData> LoverRankUpTable;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UCommunityEventDataAsset
{
    [FieldOffset(0x0000)] public UAppMultiDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FCommunityEventTable> Tables;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FHeroParameterTable
{
    [FieldOffset(0x0000)] public TArray<int> Points;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UHeroParameterDataAsset
{
    [FieldOffset(0x0000)] public UAppMultiDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FHeroParameterTable> Tables;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FHolidayEventData
{
    [FieldOffset(0x0000)] public int major;
    [FieldOffset(0x0004)] public int Minor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FHolidayEventDataTable
{
    [FieldOffset(0x0000)] public TArray<FHolidayEventData> Datas;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UHolidayEventDataAsset
{
    [FieldOffset(0x0000)] public UAppMultiDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FHolidayEventDataTable> Tables;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FHolidayScheduleData
{
    [FieldOffset(0x0000)] public int Month;
    [FieldOffset(0x0004)] public int Day;
    [FieldOffset(0x0008)] public int ArcanaID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UHolidayScheduleDataAsset
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FHolidayScheduleData> Table;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FCoefficientInfo
{
    [FieldOffset(0x0000)] public int Value;
    [FieldOffset(0x0004)] public float Coefficient;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct FUniqCoefficient
{
    [FieldOffset(0x0000)] public TMap<int, FCoefficientInfo> DataMap;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UCoefficientDataAsset
{
    [FieldOffset(0x0000)] public UAppMultiDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FCoefficientInfo> GeneralTable;
    [FieldOffset(0x0040)] public TArray<FUniqCoefficient> UniqTables;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FCommunityPresentData
{
    [FieldOffset(0x0000)] public uint ItemId;
    [FieldOffset(0x0004)] public int AddCommunityPoint;
    [FieldOffset(0x0008)] public FName ReactionMessageLabel;
    [FieldOffset(0x0010)] public FName HeroMessageLabel;
    [FieldOffset(0x0018)] public FName ChristmasReactionMessageLabel;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FCommunityPresentTable
{
    [FieldOffset(0x0000)] public TArray<FCommunityPresentData> Datas;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UCommunityPresentDataAsset
{
    [FieldOffset(0x0000)] public UAppMultiDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FCommunityPresentTable> Tables;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FMoviesEventData
{
    [FieldOffset(0x0000)] public sbyte Month;
    [FieldOffset(0x0001)] public sbyte Day;
    [FieldOffset(0x0004)] public int ArcanaID;
    [FieldOffset(0x0008)] public int MailID;
    [FieldOffset(0x000C)] public short major;
    [FieldOffset(0x000E)] public short Minor;
    [FieldOffset(0x0010)] public sbyte CommunityRankMin;
    [FieldOffset(0x0011)] public sbyte CommunityRankMax;
    [FieldOffset(0x0014)] public uint OffFlag;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UMoviesEventDataAsset
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FMoviesEventData> Table;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FSummerFestivalEventData
{
    [FieldOffset(0x0000)] public int MailID;
    [FieldOffset(0x0004)] public short major;
    [FieldOffset(0x0006)] public short Minor;
    [FieldOffset(0x0008)] public uint OnFlag;
    [FieldOffset(0x000C)] public uint OffFlag;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct USummerFestivalEventDataAsset
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FSummerFestivalEventData> Table;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FChristmasEventMailData
{
    [FieldOffset(0x0000)] public short ID;
    [FieldOffset(0x0002)] public short Rank;
    [FieldOffset(0x0004)] public uint flag;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FChristmasEventListData
{
    [FieldOffset(0x0000)] public short major;
    [FieldOffset(0x0002)] public short Minor;
    [FieldOffset(0x0004)] public uint flag;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FChristmasEventData
{
    [FieldOffset(0x0000)] public FChristmasEventMailData Mail;
    [FieldOffset(0x0008)] public TArray<FChristmasEventListData> Events;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UChristmasEventDataAsset
{
    [FieldOffset(0x0000)] public UAppMultiDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FChristmasEventData> Table;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UCommunityWork
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* pAssetLoader;
    [FieldOffset(0x0030)] public UCommunityHandler* pCommunityHandle;
    [FieldOffset(0x0038)] public UVeveWork* pVeveWork;
    [FieldOffset(0x0040)] public UHeroParameterHandle* pHeroParameterHandle;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD0)] 
public unsafe struct UConfigBGMSelectDialog
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UConfigDialog
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD0)] 
public unsafe struct UConfigDungeonBGMSelectDialog
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x78)] 
public unsafe struct FGetUIParameter
{
    [FieldOffset(0x0018)] public UUIParameterAsset* ParameterAsset;
    [FieldOffset(0x0020)] public TMap<FString, float> ParameterMap;
    [FieldOffset(0x0070)] public UAssetLoader* AssetLoader;
}

[StructLayout(LayoutKind.Explicit, Size = 0xAC8)] 
public unsafe struct ACutInDraw
{
    [FieldOffset(0x0000)] public AUIBaseActor baseObj;
    [FieldOffset(0x08D8)] public UAssetLoader* AssetLoader_;
    [FieldOffset(0x08E0)] public UPlgAsset* EmotionIconPlg_;
    [FieldOffset(0x08E8)] public UTexture* BustUpTexture_;
    [FieldOffset(0x08F0)] public UTexture* BustUpDummyTexture_;
    [FieldOffset(0x08F8)] public FGetUIParameter UIP_;
    [FieldOffset(0x0970)] public FCurveVectorAnimation Curve1_;
    [FieldOffset(0x09A0)] public FCurveVectorAnimation Curve2_;
    [FieldOffset(0x09D0)] public FCurveVectorAnimation Curve3_;
    [FieldOffset(0x0A00)] public FCurveVectorAnimation Curve4_;
    [FieldOffset(0x0A30)] public FCurveVectorAnimation Curve5_;
    [FieldOffset(0x0A60)] public FCurveVectorAnimation Curve6_;
    [FieldOffset(0x0A90)] public FCurveVectorAnimation Curve7_;
    [FieldOffset(0x0AC0)] public USprAsset* Spr_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C8)] 
public unsafe struct ADailyChangeVoiceActionViewer
{
    [FieldOffset(0x0000)] public ADebugViewer baseObj;
    [FieldOffset(0x02B8)] public AUIDebugReceiveVoiceAction* mVoiceConnect_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B0)] 
public unsafe struct AUIVoiceBase
{
    [FieldOffset(0x0000)] public AUIBaseActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B8)] 
public unsafe struct AUIDebugReceiveVoiceAction
{
    [FieldOffset(0x0000)] public AUIVoiceBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UDatAnalyze
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataAsset* TableAnalyzeSync;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UDatBtlCommon
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataAsset* Table;
    [FieldOffset(0x0038)] public UDataAsset* TableCalcPANICDropItem;
    [FieldOffset(0x0040)] public UDataAsset* TableCalcPANICUseItem;
    [FieldOffset(0x0048)] public UDataAsset* TableEncountEnemyBadPercent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UDatEncount
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataAsset* TableEncount;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UDatEnemy
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataAsset* TableEnemy;
    [FieldOffset(0x0038)] public UDataAsset* TableName;
    [FieldOffset(0x0040)] public UDataAsset* TableAttr;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UDatFontAdjustment
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UFontAdjustmentListTable* TableFontAdjustment;
}

[StructLayout(LayoutKind.Explicit, Size = 0x290)] 
public unsafe struct ADatItemActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0280)] public UAssetLoader* mAssetLoader_;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD0)] 
public unsafe struct UDatItem
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataAsset* TableAccs;
    [FieldOffset(0x0038)] public UDataAsset* TableArmor;
    [FieldOffset(0x0040)] public UDataAsset* TableCommon;
    [FieldOffset(0x0048)] public UDataAsset* TableCostume;
    [FieldOffset(0x0050)] public UDataAsset* TableEvitem;
    [FieldOffset(0x0058)] public UDataAsset* TableMaterial;
    [FieldOffset(0x0060)] public UDataAsset* TableShoes;
    [FieldOffset(0x0068)] public UDataAsset* TableSkillcard;
    [FieldOffset(0x0070)] public UDataAsset* TableWeapon;
    [FieldOffset(0x0078)] public UDataAsset* TableAccsName;
    [FieldOffset(0x0080)] public UDataAsset* TableArmorName;
    [FieldOffset(0x0088)] public UDataAsset* TableCommonName;
    [FieldOffset(0x0090)] public UDataAsset* TableCostumeName;
    [FieldOffset(0x0098)] public UDataAsset* TableEvitemName;
    [FieldOffset(0x00A0)] public UDataAsset* TableMaterialName;
    [FieldOffset(0x00A8)] public UDataAsset* TableShoesName;
    [FieldOffset(0x00B0)] public UDataAsset* TableSkillcardName;
    [FieldOffset(0x00B8)] public UDataAsset* TableWeaponName;
    [FieldOffset(0x00C8)] public ADatItemActor* mActor_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FMiniMapInfoTable
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public FString FieldID;
    [FieldOffset(0x0018)] public float Scale;
    [FieldOffset(0x001C)] public float DegreeAngle;
    [FieldOffset(0x0020)] public bool Hide;
    [FieldOffset(0x0024)] public float VLScale;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UDatMiniMapInfo
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
    [FieldOffset(0x0048)] public TArray<FMiniMapInfoTable> m_aInfoList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FMiniMapOffsetTable
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public FString FieldID;
    [FieldOffset(0x0018)] public int OffsetX;
    [FieldOffset(0x001C)] public int OffsetY;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UDatMiniMapOffset
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
    [FieldOffset(0x0048)] public TArray<FMiniMapOffsetTable> m_aOffsetList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UDatPersona
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataAsset* TablePersona;
    [FieldOffset(0x0038)] public UDataAsset* TableAttr;
    [FieldOffset(0x0040)] public UDataAsset* TableName;
    [FieldOffset(0x0048)] public UDataAsset* TableGrowth;
    [FieldOffset(0x0050)] public UDataAsset* TableAllyGrowth;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UDatPlayer
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataAsset* TableLevelup;
    [FieldOffset(0x0038)] public UDataAsset* TableMaxHPSP;
    [FieldOffset(0x0040)] public UDataAsset* TableName;
    [FieldOffset(0x0048)] public UDataAsset* TableFitstName;
    [FieldOffset(0x0050)] public UDataAsset* TableLastName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FDatPlayerNameOne
{
    [FieldOffset(0x0000)] public int mPlayerID;
    [FieldOffset(0x0008)] public FText mName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatPlayerNameTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatPlayerNameOne> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatPlayerFirstNameTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatPlayerNameOne> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatPlayerLastNameTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatPlayerNameOne> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UDatRace
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataAsset* Table;
}

[StructLayout(LayoutKind.Explicit, Size = 0x138)] 
public unsafe struct UDatSaveDataLocalization
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA0)] 
public unsafe struct UDatShuffleCard
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataAsset* TableName;
    [FieldOffset(0x0038)] public UDataAsset* TableChoiceMajor;
    [FieldOffset(0x0040)] public UDataAsset* TableChoiceMinor;
    [FieldOffset(0x0048)] public UDataAsset* TablePersona;
    [FieldOffset(0x0050)] public UDataAsset* TableWand;
    [FieldOffset(0x0058)] public UDataAsset* TableCoin;
    [FieldOffset(0x0060)] public UDataAsset* TableCup;
    [FieldOffset(0x0068)] public UDataAsset* TableSword;
    [FieldOffset(0x0070)] public UDataAsset* TableFool;
    [FieldOffset(0x0078)] public UDataAsset* TableMagician;
    [FieldOffset(0x0080)] public UDataAsset* TableLovers;
    [FieldOffset(0x0088)] public UDataAsset* TableFortune;
    [FieldOffset(0x0090)] public UDataAsset* TableStrength;
    [FieldOffset(0x0098)] public UDataAsset* TableHangedman;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UDatSkill
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataAsset* TableName;
    [FieldOffset(0x0038)] public UDataAsset* TableSkill;
    [FieldOffset(0x0040)] public UDataAsset* TableNormal;
    [FieldOffset(0x0048)] public UDataAsset* TableAttrName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatSuggestion
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataAsset* TableSuggestion;
    [FieldOffset(0x0038)] public UDataAsset* TableSuggestionText;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatSupportInfo
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public UAssetLoader* Loader;
    [FieldOffset(0x0038)] public UDataAsset* TableSupportInfo;
}

[StructLayout(LayoutKind.Explicit, Size = 0x90)] 
public unsafe struct UDatSystemText
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataTable* DataTable;
    [FieldOffset(0x0038)] public TMap<int, FString> SystemTextTable;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UDatTableTypes
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct UDatTheurgia
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataAsset* TableTheurgiaBoost;
    [FieldOffset(0x0038)] public UDataAsset* TableTheurgiaBoostBoss;
    [FieldOffset(0x0040)] public UDataAsset* TableMixraidRelease;
    [FieldOffset(0x0048)] public UBmdAsset* TheurgiaFlavorText;
}

[StructLayout(LayoutKind.Explicit, Size = 0x78)] 
public unsafe struct FTownMapInfoTable
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public FString LocationName;
    [FieldOffset(0x0018)] public int LocationNo;
    [FieldOffset(0x0020)] public FString CategoryName;
    [FieldOffset(0x0030)] public int CategoryNo;
    [FieldOffset(0x0038)] public FString IconName;
    [FieldOffset(0x0048)] public int SprType;
    [FieldOffset(0x004C)] public int SprNo;
    [FieldOffset(0x0050)] public bool Noon;
    [FieldOffset(0x0051)] public bool Night;
    [FieldOffset(0x0058)] public FString HideFlag;
    [FieldOffset(0x0068)] public FString TextLabel;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct FTownMapInfoNameTable
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public FString TextLabel;
    [FieldOffset(0x0018)] public FString Text;
    [FieldOffset(0x0028)] public FString Comment;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FTownMapDetailTextTable
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public FString DetailText;
}

[StructLayout(LayoutKind.Explicit, Size = 0x78)] 
public unsafe struct UDatTownMapInfo
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
    [FieldOffset(0x0048)] public TArray<FTownMapInfoTable> m_aTownMapInfoList;
    [FieldOffset(0x0058)] public TArray<FTownMapInfoNameTable> m_aNameList;
    [FieldOffset(0x0068)] public TArray<FTownMapDetailTextTable> m_aDetailTextList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UDatTownMapRestrictions
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UDatTownMapTime
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x80)] 
public unsafe struct UDatUICalendarText
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataTable* MonthTable;
    [FieldOffset(0x0038)] public UDataTable* DateTable;
    [FieldOffset(0x0040)] public UDataTable* DayOfWeekTable;
    [FieldOffset(0x0048)] public TArray<FString> MonthTexts;
    [FieldOffset(0x0058)] public TArray<FString> DateTexts;
    [FieldOffset(0x0068)] public TArray<FString> DayOfWeekTexts;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UDatUIText
{
    [FieldOffset(0x0000)] public UGameInstanceSubsystem baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x90)] 
public unsafe struct UDatUIUseText
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataTable* DataTable;
    [FieldOffset(0x0038)] public TMap<int, FString> UIUseTextTable;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UDatUnit
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x288)] 
public unsafe struct ADbgCmpStatusTest
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UUICmpStatus* Actor_;
    [FieldOffset(0x0280)] public UDebugMenu* DebugMenu_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FDictionaryTableData
{
    [FieldOffset(0x0000)] public int DictionaryID;
    [FieldOffset(0x0004)] public int SortID;
    [FieldOffset(0x0008)] public int OpenFlagID;
    [FieldOffset(0x0010)] public FString Title;
    [FieldOffset(0x0020)] public TArray<FName> TextureNames;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDictionaryTableDataAsset
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDictionaryTableData> Tables;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B8)] 
public unsafe struct AUIDrawBaseActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0290)] public UAssetLoader* pAssetLoader;
    [FieldOffset(0x0298)] public UUIDataAsset* ResourceDataAsset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x740)] 
public unsafe struct ADifficultySelectionActor
{
    [FieldOffset(0x0000)] public AUIDrawBaseActor baseObj;
    [FieldOffset(0x0340)] public UAssetLoader* AssetLoader;
    [FieldOffset(0x0348)] public USprAsset* TitleSpr;
    [FieldOffset(0x0350)] public UPlgAsset* TitlePlg;
    [FieldOffset(0x0358)] public UTexture* InheritanceTex;
    [FieldOffset(0x0360)] public UDataTable* TitleSelectDataTable;
    [FieldOffset(0x0368)] public UDataTable* LayoutDataTable;
    [FieldOffset(0x0370)] public UUILayoutDataTable* UILayoutLayoutDataTable;
    [FieldOffset(0x0378)] public int DiffBGScaleAnimFrame;
    [FieldOffset(0x037C)] public int DiffBGAlphaAnimFrame;
    [FieldOffset(0x0380)] public int DiffBGGradAlphaAnimFrame;
    [FieldOffset(0x0384)] public int ListWaitFrame;
    [FieldOffset(0x0388)] public int InfoInAnimRange;
    [FieldOffset(0x038C)] public int InfoInAnimFrame;
    [FieldOffset(0x0390)] public int InfoInWaitFrame;
    [FieldOffset(0x0394)] public int InfoChangeAnimRange;
    [FieldOffset(0x0398)] public int InfoChangeFrame;
    [FieldOffset(0x039C)] public int InfoChangeAnimWaitFrame;
    [FieldOffset(0x03A0)] public int CloseListAndHelpFrame;
    [FieldOffset(0x03A4)] public int CloseListY;
    [FieldOffset(0x03A8)] public int CloseBGFrame;
    [FieldOffset(0x03AC)] public int InheritanceBGFrame;
    [FieldOffset(0x03B0)] public int InheritanceFadeFrame;
    [FieldOffset(0x03B4)] public bool CloseBGNotScaleFlag;
    [FieldOffset(0x03B5)] public bool bChangeAnimDisable;
    [FieldOffset(0x03B8)] public float DiffBGX;
    [FieldOffset(0x03BC)] public float DiffBGY;
}

[StructLayout(LayoutKind.Explicit, Size = 0x310)] 
public unsafe struct ADLCManager
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x02D8)] public UAssetLoader* mAssetLoader;
    [FieldOffset(0x02E0)] public UAddContentEntitlementDataAsset* mAddContentEntitlementData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x268)] 
public unsafe struct ADEPRECATED_Draft_EventManager
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public UBmdAsset* mpBmdAsset;
    [FieldOffset(0x0230)] public int ExecutingMessageNo;
    [FieldOffset(0x0238)] public EEventManagerMessageState MessageState;
    [FieldOffset(0x0240)] public UMovieSceneSequencePlayer* EventSequencePlayer;
    [FieldOffset(0x0250)] public int RequestedSeqClosedEventMessageID;
    [FieldOffset(0x0254)] public EEventManagerSeqControllerState SeqControllerState;
    [FieldOffset(0x0258)] public FEvtLocalData EvtLocalData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UDungeonSoundDataAssets
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* pAssetLoader;
    [FieldOffset(0x0030)] public UDataAsset* pDlcDungeonBgm;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UDungeonSoundTableTypes
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FDatDlcDungeonBgmTableData
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public uint BandleID;
    [FieldOffset(0x000C)] public uint SerialNumber;
    [FieldOffset(0x0010)] public FName Title;
    [FieldOffset(0x0018)] public uint CueId;
    [FieldOffset(0x001C)] public uint ControlNumber;
    [FieldOffset(0x0020)] public uint Sort;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatDlcDungeonBgmTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatDlcDungeonBgmTableData> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x278)] 
public unsafe struct UEventSkipWidgetDelegate
{
    [FieldOffset(0x0000)] public UUserWidget baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct AEvtCharacterDraft
{
    [FieldOffset(0x0000)] public APawn baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UEvtDataAssets
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FDatDataOffDataTable
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public FName Category;
    [FieldOffset(0x0010)] public uint major;
    [FieldOffset(0x0014)] public uint Minor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatDataOffTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatDataOffDataTable> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FDatFadeOutDataTable
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public FName Category;
    [FieldOffset(0x0010)] public uint major;
    [FieldOffset(0x0014)] public uint Minor;
    [FieldOffset(0x0018)] public byte FadeType;
    [FieldOffset(0x0019)] public byte ColorR;
    [FieldOffset(0x001A)] public byte ColorG;
    [FieldOffset(0x001B)] public byte ColorB;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatFadeOutTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatFadeOutDataTable> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FDatAssetOverWriteDataTable
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public uint major;
    [FieldOffset(0x000C)] public uint Minor;
    [FieldOffset(0x0010)] public FName BindingTag;
    [FieldOffset(0x0018)] public byte Month;
    [FieldOffset(0x0019)] public byte Day;
    [FieldOffset(0x001A)] public byte Time;
    [FieldOffset(0x001C)] public uint BaseMotion;
    [FieldOffset(0x0020)] public uint BaseMotionEx;
    [FieldOffset(0x0024)] public uint AddMotionEx;
    [FieldOffset(0x0028)] public uint flag;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatAssetOverWriteTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatAssetOverWriteDataTable> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FDatAssetOverWriteEventDataTable
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public FName Category;
    [FieldOffset(0x0010)] public uint major;
    [FieldOffset(0x0014)] public uint Minor;
    [FieldOffset(0x0018)] public uint ProcNo;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatAssetOverWriteEventTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatAssetOverWriteEventDataTable> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FDatBagEnableDataTable
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public FName Category;
    [FieldOffset(0x0010)] public uint major;
    [FieldOffset(0x0014)] public uint Minor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatBagEnableTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatBagEnableDataTable> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FDatPersonaCombineAdjustDataTable
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public uint PersonaID;
    [FieldOffset(0x000C)] public float TransX;
    [FieldOffset(0x0010)] public float TransY;
    [FieldOffset(0x0014)] public float TransZ;
    [FieldOffset(0x0018)] public float RotationX;
    [FieldOffset(0x001C)] public float RotationY;
    [FieldOffset(0x0020)] public float RotationZ;
    [FieldOffset(0x0024)] public float ScaleX;
    [FieldOffset(0x0028)] public float ScaleY;
    [FieldOffset(0x002C)] public float ScaleZ;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatPersonaCombineAdjustTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatPersonaCombineAdjustDataTable> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct FDatObjectVisibleDataTable
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public uint major;
    [FieldOffset(0x000C)] public uint Minor;
    [FieldOffset(0x0010)] public uint ObjectID;
    [FieldOffset(0x0014)] public byte Visible;
    [FieldOffset(0x0018)] public FString FlagCond1;
    [FieldOffset(0x0028)] public byte FlagValue1;
    [FieldOffset(0x0030)] public FString FlagCond2;
    [FieldOffset(0x0040)] public byte FlagValue2;
    [FieldOffset(0x0048)] public FString FlagCond3;
    [FieldOffset(0x0058)] public byte FlagValue3;
    [FieldOffset(0x0060)] public FString TimeZone;
    [FieldOffset(0x0070)] public FString FlagDoW;
    [FieldOffset(0x0080)] public byte FlagDoWValue;
    [FieldOffset(0x0081)] public byte StartMonth;
    [FieldOffset(0x0082)] public byte StartDay;
    [FieldOffset(0x0083)] public byte EndMonth;
    [FieldOffset(0x0084)] public byte EndDay;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UDatObjectVisibleTable
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDatObjectVisibleDataTable> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct UEvtDataLoad
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* pAssetLoader;
    [FieldOffset(0x0030)] public UDataAsset* pDataOffTable;
    [FieldOffset(0x0038)] public UDataAsset* pFadeOutTable;
    [FieldOffset(0x0040)] public UDataAsset* pAssetOverWriteTable;
    [FieldOffset(0x0048)] public UDataAsset* pAssetOverWriteEventTable;
    [FieldOffset(0x0050)] public UDataAsset* pBagEnableTable;
    [FieldOffset(0x0058)] public UDataAsset* pEvtPreDataTable;
    [FieldOffset(0x0060)] public UDataAsset* pPersonaCombineAdjustTable;
    [FieldOffset(0x0068)] public UDataAsset* pObjectVisibleTable;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UEvtManagerStateBase
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public AAtlEvtEventManager_PauseActor* EvtPauseActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UEvtManagerStateBacklog
{
    [FieldOffset(0x0000)] public UEvtManagerStateBase baseObj;
    [FieldOffset(0x0038)] public AUIBackLog* UIBackLogActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UEvtManagerStateExit
{
    [FieldOffset(0x0000)] public UEvtManagerStateBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UEvtManagerStateNetAnswer
{
    [FieldOffset(0x0000)] public UEvtManagerStateBase baseObj;
    [FieldOffset(0x0038)] public AUIVoiceAnswer* UINetAnswerActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UEvtManagerStatePlaying
{
    [FieldOffset(0x0000)] public UEvtManagerStateBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UEvtTableTypes
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct AFadePgBattleEventWipeActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public bool IsAnimation;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UFadeProgramBase
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x60)] 
public unsafe struct UFadePgBattleEventWipe
{
    [FieldOffset(0x0000)] public UFadeProgramBase baseObj;
    [FieldOffset(0x0040)] public AFadePgBattleEventWipeActor* pActor;
    [FieldOffset(0x0048)] public TSubclassOf<AFadePgBattleEventWipeActor> LoadClass;
    [FieldOffset(0x0050)] public UAssetLoader* pAssetLoader;
    [FieldOffset(0x0058)] public bool m_bLoading;
    [FieldOffset(0x0059)] public bool m_bLoaded;
    [FieldOffset(0x005A)] public bool m_bMainLoaded;
    [FieldOffset(0x005B)] public bool m_bIsAnimation;
    [FieldOffset(0x005C)] public int requestNo;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UBattleResultWatcher
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD0)] 
public unsafe struct FPgBtlResultWipe
{
    [FieldOffset(0x0000)] public FCurveVectorAnimation m_curveFadeOutBlack;
    [FieldOffset(0x0030)] public FCurveVectorAnimation m_curveFadeOutBlue;
    [FieldOffset(0x0060)] public FCurveVectorAnimation m_curveFadeInBlack;
    [FieldOffset(0x0090)] public TArray<IntPtr> objList;
    [FieldOffset(0x00A0)] public UBattleResultWatcher* m_Watcher;
    [FieldOffset(0x00A8)] public FVector2D centerOffset;
    [FieldOffset(0x00B0)] public FVector2D Offset1;
    [FieldOffset(0x00B8)] public FVector2D Offset2;
    [FieldOffset(0x00C0)] public FVector2D Offset3;
    [FieldOffset(0x00C8)] public bool m_bLoading;
    [FieldOffset(0x00C9)] public bool m_bLoaded;
    [FieldOffset(0x00CA)] public bool m_bMainLoaded;
}

[StructLayout(LayoutKind.Explicit, Size = 0x110)] 
public unsafe struct UFadePgBattleResult
{
    [FieldOffset(0x0000)] public UFadeProgramBase baseObj;
    [FieldOffset(0x0040)] public FPgBtlResultWipe m_PgBtlResultWipe;
}

[StructLayout(LayoutKind.Explicit, Size = 0x110)] 
public unsafe struct UFadePgBattleResultEnd
{
    [FieldOffset(0x0000)] public UFadePgBattleResult baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UFadePgCircle
{
    [FieldOffset(0x0000)] public UFadeProgramBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UFadePgColorOut
{
    [FieldOffset(0x0000)] public UFadeProgramBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UFadePgCrossFade
{
    [FieldOffset(0x0000)] public UFadeProgramBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC0)] 
public unsafe struct FDarkHourWork
{
    [FieldOffset(0x0020)] public USkeletalMesh* SkeletalMesh;
    [FieldOffset(0x0028)] public UAppAnimCtrl* pAnimCtrl;
    [FieldOffset(0x0030)] public UStaticMesh* pSkyBoxMesh;
    [FieldOffset(0x0038)] public AStaticMeshActor* pSkyBoxMeshActor;
    [FieldOffset(0x0040)] public UStaticMeshComponent* pSkyBoxMeshCompo;
    [FieldOffset(0x0048)] public UMaterialInterface* pLoadMaterial;
    [FieldOffset(0x0050)] public UMaterialInstanceDynamic* mMateInst;
    [FieldOffset(0x0058)] public UMaterialParameterCollection* pMpc;
    [FieldOffset(0x0088)] public TSubclassOf<AUISceneCapture> UISceneCaptureClass;
    [FieldOffset(0x0090)] public AUISceneCapture* pUISceneCapture2D;
    [FieldOffset(0x0098)] public UAssetLoader* pAssetLoader;
}

[StructLayout(LayoutKind.Explicit, Size = 0x100)] 
public unsafe struct UFadePgDarkHour
{
    [FieldOffset(0x0000)] public UFadeProgramBase baseObj;
    [FieldOffset(0x0040)] public FDarkHourWork Work;
}

[StructLayout(LayoutKind.Explicit, Size = 0x70)] 
public unsafe struct UFadePgSlide
{
    [FieldOffset(0x0000)] public UFadeProgramBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x68)] 
public unsafe struct UFadePgSlideVertical
{
    [FieldOffset(0x0000)] public UFadeProgramBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2418)] 
public unsafe struct FVelvetWipe
{
    [FieldOffset(0x0000)] public UAssetLoader* m_pLoader;
    [FieldOffset(0x0008)] public USprAsset* m_pSpr;
    [FieldOffset(0x0010)] public FGetUIParameter m_uip;
    [FieldOffset(0x0088)] public UDataTable* m_pVelvetWipeDT;
    [FieldOffset(0x0090)] public FCurveVectorAnimation m_curveOpenAnim;
    [FieldOffset(0x00C0)] public FCurveVectorAnimation m_curveFadeInAnim;
    [FieldOffset(0x00F0)] public FCurveVectorAnimation m_curveSpeedAnim;
    [FieldOffset(0x0120)] public FCurveVectorAnimation m_curveCenterDoorSpeedAnim;
    [FieldOffset(0x0150)] public UTexture* m_pCaptureTex;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2458)] 
public unsafe struct UFadePgVelvet
{
    [FieldOffset(0x0000)] public UFadeProgramBase baseObj;
    [FieldOffset(0x0040)] public FVelvetWipe m_velvetWipe;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2458)] 
public unsafe struct UFadePgVelvetReturn
{
    [FieldOffset(0x0000)] public UFadeProgramBase baseObj;
    [FieldOffset(0x0040)] public FVelvetWipe m_velvetWipe;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FFadeProperties
{
    [FieldOffset(0x0000)] public int Frame;
    [FieldOffset(0x0004)] public int RenderTargetOt;
    [FieldOffset(0x0008)] public int CaptureTargetOt;
    [FieldOffset(0x000C)] public bool UseCapture;
}

[StructLayout(LayoutKind.Explicit, Size = 0x98)] 
public unsafe struct UFadePlayer
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0088)] public TArray<IntPtr> Programs_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3C0)] 
public unsafe struct AFclShopBase
{
    [FieldOffset(0x0000)] public AUIBaseActor baseObj;
    [FieldOffset(0x0368)] public AScrActor* ScrActor_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x530)] 
public unsafe struct AFclAntiqueShop
{
    [FieldOffset(0x0000)] public AFclShopBase baseObj;
    [FieldOffset(0x03C0)] public UAssetLoader* Loader_;
    [FieldOffset(0x03C8)] public UAntiqueShopLineUpListTable* LineupTable_;
    [FieldOffset(0x03D0)] public UBfAsset* BfAsset_;
    [FieldOffset(0x03D8)] public UBmdAsset* BmdAsset_;
    [FieldOffset(0x03E0)] public USprAsset* _ComSpr00;
    [FieldOffset(0x03E8)] public UPlgAsset* _ComPlg00;
    [FieldOffset(0x03F0)] public USprAsset* _Spr00;
    [FieldOffset(0x03F8)] public UPlgAsset* _Plg00;
    [FieldOffset(0x0400)] public UDataTable* pParamLayoutDataAntique;
    [FieldOffset(0x0408)] public TSubclassOf<AFclAntiqueShopDrawActor> _DrawActorClass;
    [FieldOffset(0x0410)] public AFclAntiqueShopDrawActor* _DrawActor;
    [FieldOffset(0x0460)] public UDataTable* LayoutData;
    [FieldOffset(0x0468)] public UDataTable* TextColLayoutData;
    [FieldOffset(0x0470)] public UUILayoutDataTable* LayoutDataTable;
    [FieldOffset(0x0478)] public UUILayoutDataTable* TextColLayoutDataTable;
}

[StructLayout(LayoutKind.Explicit, Size = 0x23D0)] 
public unsafe struct UAntiqueShopDrawCommon
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x1E28)] public AUICloudCursorDraw* _pCloudCursor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct AFclWeaponShopDrawActorBase
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UMcaAsset* _CurrentMcaAsset;
    [FieldOffset(0x0280)] public ACameraActor* _CurrentCamera;
    [FieldOffset(0x0288)] public AActor* _OldCamera;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FWeaponShopDrawParam
{
    [FieldOffset(0x0000)] public FVector2D _Position;
    [FieldOffset(0x0008)] public FVector2D _ScaleOrWH;
    [FieldOffset(0x0010)] public float _Angle;
    [FieldOffset(0x0014)] public float _GenericValue;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct FWeaponShopAnimParam
{
    [FieldOffset(0x0000)] public FWeaponShopDrawParam _StartParam;
    [FieldOffset(0x0018)] public FWeaponShopDrawParam _EndParam;
    [FieldOffset(0x0030)] public float _WaitTime;
    [FieldOffset(0x0038)] public UCurveFloat* _InterpCurve;
    [FieldOffset(0x0040)] public float _InterpCoefficient;
    [FieldOffset(0x0044)] public float _InterpTime;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA10)] 
public unsafe struct AFclAntiqueShopDrawActor
{
    [FieldOffset(0x0000)] public AFclWeaponShopDrawActorBase baseObj;
    [FieldOffset(0x02E0)] public UAntiqueShopDrawCommon* _CommonData;
    [FieldOffset(0x02E8)] public FColor _ListUnselectedStringColor;
    [FieldOffset(0x02EC)] public FColor _ListPanelColor;
    [FieldOffset(0x02F0)] public FColor _DetailPanelHyphenColor;
    [FieldOffset(0x02F4)] public FColor _MatIconDisabledColor;
    [FieldOffset(0x02F8)] public FColor _MatNamelDisabledColor;
    [FieldOffset(0x02FC)] public FColor _MatNumberDisabledColor;
    [FieldOffset(0x0300)] public FColor _BgColor;
    [FieldOffset(0x0308)] public FWeaponShopAnimParam _TopMenuList1stAnim;
    [FieldOffset(0x0350)] public FWeaponShopAnimParam _TopMenuListAnim;
    [FieldOffset(0x0398)] public FWeaponShopAnimParam _TopMenuListOutAnim;
    [FieldOffset(0x03E0)] public FWeaponShopAnimParam _TopMenuKanban1stAnim;
    [FieldOffset(0x0428)] public FWeaponShopAnimParam _TopMenuKanbanAnim;
    [FieldOffset(0x0470)] public FWeaponShopAnimParam _TopMenuKanbanOutAnim;
    [FieldOffset(0x04B8)] public FWeaponShopAnimParam _TopMenuMoonAnim;
    [FieldOffset(0x0500)] public FWeaponShopAnimParam _TopMenuMoonLoopAnim;
    [FieldOffset(0x0548)] public FWeaponShopAnimParam _TopMenuMoonOutAnim;
    [FieldOffset(0x0590)] public FWeaponShopAnimParam _ListCursorBaseInAnim;
    [FieldOffset(0x05D8)] public FWeaponShopAnimParam _ListCursorInAnim;
    [FieldOffset(0x0620)] public FWeaponShopAnimParam _ListTriangleCursorInAnim;
    [FieldOffset(0x0668)] public FWeaponShopAnimParam _ListTriangleCursorLoopAnim;
    [FieldOffset(0x06B0)] public FWeaponShopAnimParam _CompareBaseShiftAnim;
    [FieldOffset(0x06F8)] public FWeaponShopAnimParam _CompareMoonRotateAnim;
    [FieldOffset(0x0740)] public FWeaponShopAnimParam _CompareCharacterMoonRotateAnim;
    [FieldOffset(0x0788)] public FWeaponShopAnimParam _CompareOutAnim;
    [FieldOffset(0x07D0)] public FWeaponShopAnimParam _LRCursorLoopAnim;
    [FieldOffset(0x0818)] public FWeaponShopAnimParam _LRCursorInputAnim;
    [FieldOffset(0x0860)] public FWeaponShopAnimParam _UDCursorLoopAnim;
    [FieldOffset(0x08A8)] public FWeaponShopAnimParam _UDCursorInputAnim;
    [FieldOffset(0x08F0)] public FWeaponShopAnimParam _ParamUpDownAnim;
    [FieldOffset(0x0938)] public FWeaponShopAnimParam _SellListCursorBaseInAnim;
    [FieldOffset(0x0980)] public FWeaponShopAnimParam _SellListCursorInAnim;
    [FieldOffset(0x09C8)] public FWeaponShopAnimParam _ParamUpDownLoopAnim;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1128)] 
public unsafe struct AFclItemShop
{
    [FieldOffset(0x0000)] public AFclShopBase baseObj;
    [FieldOffset(0x09A0)] public USprAsset* m_pSpr_ItemShop;
    [FieldOffset(0x09A8)] public USprAsset* m_pSpr_Common;
    [FieldOffset(0x09B0)] public UPlgAsset* m_pTex_ItemShopPlg;
    [FieldOffset(0x09B8)] public UPlgAsset* m_pTex_CommonPlg;
    [FieldOffset(0x09C0)] public UTexture* m_pTex_Medisine1;
    [FieldOffset(0x09C8)] public UTexture* m_pTex_Medisine2;
    [FieldOffset(0x09D0)] public UTexture* m_pTex_Medisine3;
    [FieldOffset(0x09D8)] public UTexture* m_pTex_Medisine4;
    [FieldOffset(0x09E0)] public UTexture* m_pTex_CapusleA_1;
    [FieldOffset(0x09E8)] public UTexture* m_pTex_CapusleB_1;
    [FieldOffset(0x09F0)] public UTexture* m_pTex_CapusleC_1;
    [FieldOffset(0x09F8)] public UTexture* m_pTex_CapusleShadow;
    [FieldOffset(0x0A00)] public USprAsset* m_pSpr_Common_Money;
    [FieldOffset(0x0FC0)] public UAssetLoader* Loader_;
    [FieldOffset(0x0FC8)] public UItemShopLineUpListTable* LineupTable_;
    [FieldOffset(0x0FD0)] public UBfAsset* BfAsset_;
    [FieldOffset(0x0FD8)] public UBmdAsset* BmdAsset_;
    [FieldOffset(0x0FE8)] public UUimAsset* m_pUimCapsuleAIn;
    [FieldOffset(0x0FF0)] public UUimAsset* m_pUimCapsuleBIn;
    [FieldOffset(0x0FF8)] public UUimAsset* m_pUimCapsuleCIn;
    [FieldOffset(0x1000)] public UUimAsset* m_pUimCapsuleAChange;
    [FieldOffset(0x1008)] public UUimAsset* m_pUimCapsuleBChange;
    [FieldOffset(0x1010)] public UUimAsset* m_pUimCapsuleCChange;
    [FieldOffset(0x1018)] public UUimAsset* m_pUimCapsuleAOut1;
    [FieldOffset(0x1020)] public UUimAsset* m_pUimCapsuleBOut1;
    [FieldOffset(0x1028)] public UUimAsset* m_pUimCapsuleCOut1;
    [FieldOffset(0x1030)] public UUimAsset* m_pUimCapsuleAOut2;
    [FieldOffset(0x1038)] public UUimAsset* m_pUimCapsuleBOut2;
    [FieldOffset(0x1040)] public UUimAsset* m_pUimCapsuleCOut2;
    [FieldOffset(0x1048)] public AUICloudCursorDraw* CloudCursor_;
    [FieldOffset(0x1080)] public UUILayoutDataTable* m_pTextDataTable;
    [FieldOffset(0x1088)] public UDataTable* m_pTextData;
    [FieldOffset(0x1090)] public UUILayoutDataTable* m_pLayoutDataTable;
    [FieldOffset(0x1098)] public UDataTable* m_pLayoutData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x520)] 
public unsafe struct AFclSimpleShop
{
    [FieldOffset(0x0000)] public AFclShopBase baseObj;
    [FieldOffset(0x03D8)] public ASimpleShopDraw* ShopDraw;
    [FieldOffset(0x03E0)] public UFrameBufferCapture* captureBackGround;
    [FieldOffset(0x03F0)] public UTexture* tex;
    [FieldOffset(0x0400)] public UAssetLoader* Loader_;
    [FieldOffset(0x0420)] public UDataTable* pParamLayoutData;
    [FieldOffset(0x0428)] public UDataTable* pTextParamLayoutData;
    [FieldOffset(0x0430)] public UUILayoutDataTable* pLayoutDataTable;
    [FieldOffset(0x0438)] public UUILayoutDataTable* pTextLayoutDataTable;
}

[StructLayout(LayoutKind.Explicit, Size = 0x580)] 
public unsafe struct AFclWeaponShop
{
    [FieldOffset(0x0000)] public AFclShopBase baseObj;
    [FieldOffset(0x03C0)] public UAssetLoader* Loader_;
    [FieldOffset(0x03C8)] public UWeaponShopLineUpListTable* LineupTable_;
    [FieldOffset(0x03D0)] public UBfAsset* BfAsset_;
    [FieldOffset(0x03D8)] public UBmdAsset* BmdAsset_;
    [FieldOffset(0x03E0)] public USprAsset* _ComSpr00;
    [FieldOffset(0x03E8)] public UPlgAsset* _ComPlg00;
    [FieldOffset(0x03F0)] public USprAsset* _Spr00;
    [FieldOffset(0x03F8)] public UPlgAsset* _Plg00;
    [FieldOffset(0x0400)] public UDataTable* pParamLayoutDataRoot;
    [FieldOffset(0x0408)] public UUILayoutDataTable* pLayoutDataTableRoot;
    [FieldOffset(0x0410)] public UDataTable* pParamLayoutDataChara;
    [FieldOffset(0x0418)] public UUILayoutDataTable* pLayoutDataTableChara;
    [FieldOffset(0x0420)] public UDataTable* pParamLayoutDataCharaText;
    [FieldOffset(0x0428)] public UUILayoutDataTable* pLayoutDataTableCharaText;
    [FieldOffset(0x0430)] public UDataTable* pParamLayoutDataBuyText;
    [FieldOffset(0x0438)] public UUILayoutDataTable* pLayoutDataTableBuyText;
    [FieldOffset(0x0440)] public UDataTable* pParamLayoutDataBuyHelpText;
    [FieldOffset(0x0448)] public UUILayoutDataTable* pLayoutDataTableBuyHelpText;
    [FieldOffset(0x0450)] public UDataTable* pParamLayoutDataSellText;
    [FieldOffset(0x0458)] public UUILayoutDataTable* pLayoutDataTableSellText;
    [FieldOffset(0x0460)] public UDataTable* pParamLayoutDataTradeInText;
    [FieldOffset(0x0468)] public UUILayoutDataTable* pLayoutDataTableTradeInText;
    [FieldOffset(0x0470)] public UDataTable* pParamLayoutDataOther;
    [FieldOffset(0x0478)] public UUILayoutDataTable* pLayoutDataTableOther;
    [FieldOffset(0x0480)] public TSubclassOf<AFclWeaponShopDrawActor> _DrawActorClass;
    [FieldOffset(0x0488)] public AFclWeaponShopDrawActor* _DrawActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3778)] 
public unsafe struct UWeaponShopDrawCommon
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x36B8)] public AUICloudCursorDraw* _pCloudCursor;
}

[StructLayout(LayoutKind.Explicit, Size = 0xAC0)] 
public unsafe struct AFclWeaponShopDrawActor
{
    [FieldOffset(0x0000)] public AFclWeaponShopDrawActorBase baseObj;
    [FieldOffset(0x02D8)] public UWeaponShopDrawCommon* _CommonData;
    [FieldOffset(0x02E0)] public FColor _BgColor;
    [FieldOffset(0x02E4)] public FColor _InfoWindowInnerColor;
    [FieldOffset(0x02E8)] public FWeaponShopAnimParam _TopMenuAnim;
    [FieldOffset(0x0330)] public FWeaponShopAnimParam _CatIconAnim;
    [FieldOffset(0x0378)] public FWeaponShopAnimParam _TapeAnim;
    [FieldOffset(0x03C0)] public FWeaponShopAnimParam _TapeChangeAnim;
    [FieldOffset(0x0408)] public FWeaponShopAnimParam _EquipCompareTapeAnim;
    [FieldOffset(0x0450)] public FWeaponShopAnimParam _ListCursorBaseInAnim;
    [FieldOffset(0x0498)] public FWeaponShopAnimParam _ListCursorInAnim;
    [FieldOffset(0x04E0)] public FWeaponShopAnimParam _ListTriangleCursorInAnim;
    [FieldOffset(0x0528)] public FWeaponShopAnimParam _ListTriangleCursorLoopAnim;
    [FieldOffset(0x0570)] public FWeaponShopAnimParam _LRCursorLoopAnim;
    [FieldOffset(0x05B8)] public FWeaponShopAnimParam _LRCursorInputAnim;
    [FieldOffset(0x0600)] public FWeaponShopAnimParam _UDCursorLoopAnim;
    [FieldOffset(0x0648)] public FWeaponShopAnimParam _UDCursorInputAnim;
    [FieldOffset(0x0690)] public FWeaponShopAnimParam _RevolverAnim;
    [FieldOffset(0x06D8)] public TArray<FWeaponShopAnimParam> _DecideConfirmPanelAnimArray;
    [FieldOffset(0x06E8)] public TArray<FWeaponShopAnimParam> _NumConfirmPanelAnimArray;
    [FieldOffset(0x06F8)] public TArray<FWeaponShopAnimParam> _MoneyWindowAnimArray;
    [FieldOffset(0x0708)] public FWeaponShopAnimParam _EquipCompareInAnim;
    [FieldOffset(0x0750)] public FWeaponShopAnimParam _EquipCompareOutAnim;
    [FieldOffset(0x0798)] public FWeaponShopAnimParam _ParamUpDownAnim;
    [FieldOffset(0x07E0)] public TArray<FWeaponShopAnimParam> _PicUpAnimArray;
    [FieldOffset(0x07F0)] public FWeaponShopAnimParam _SellListCursorBaseInAnim;
    [FieldOffset(0x0838)] public FWeaponShopAnimParam _SellListCursorInAnim;
    [FieldOffset(0x0880)] public FWeaponShopAnimParam _ParamUpDownLoopAnim;
    [FieldOffset(0x08C8)] public FWeaponShopAnimParam _ListInAnim;
    [FieldOffset(0x0910)] public FWeaponShopAnimParam _CharaEquipListInAnim;
    [FieldOffset(0x0958)] public FWeaponShopAnimParam _TopMenuOutAnim;
    [FieldOffset(0x09A0)] public FWeaponShopAnimParam _CatIconOutAnim;
    [FieldOffset(0x09E8)] public FWeaponShopAnimParam _TapeOutAnim;
    [FieldOffset(0x0A30)] public FWeaponShopAnimParam _CharaListCursorInAnim;
    [FieldOffset(0x0A78)] public FWeaponShopAnimParam _SellInfoInAnim;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FFileNameList
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public FString Path;
    [FieldOffset(0x0018)] public FString Name;
    [FieldOffset(0x0028)] public int chunk;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UFileNameListAssets
{
    [FieldOffset(0x0000)] public UAppDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FFileNameList> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x290)] 
public unsafe struct AUFileNameManagerrActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0280)] public UAssetLoader* mAssetLoader_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x48)] 
public unsafe struct UFileNameManager
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public UAssetLoader* Loader;
    [FieldOffset(0x0030)] public UDataAsset* TableFileName;
    [FieldOffset(0x0040)] public AUFileNameManagerrActor* mActor_;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC8)] 
public unsafe struct UFldLocalActorComp
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FFldAnimalParam
{
    [FieldOffset(0x0000)] public float mWalkSpeed;
    [FieldOffset(0x0004)] public float mRunSpeed;
    [FieldOffset(0x0008)] public float mRotSpeed;
    [FieldOffset(0x000C)] public float mIdleTimeFix;
    [FieldOffset(0x0010)] public float mIdleTimeRnd;
}

[StructLayout(LayoutKind.Explicit, Size = 0x170)] 
public unsafe struct UFldAnimalCompCore
{
    [FieldOffset(0x0000)] public UFldLocalActorComp baseObj;
    [FieldOffset(0x00C8)] public int mIndex_;
    [FieldOffset(0x00CC)] public bool bIsEscape_;
    [FieldOffset(0x00CD)] public bool bIsNotComeBack_;
    [FieldOffset(0x00D0)] public float mSceneOutTimeFix_;
    [FieldOffset(0x00D4)] public float mSceneOutTimeRnd_;
    [FieldOffset(0x00D8)] public float mEscapeRadius_;
    [FieldOffset(0x00DC)] public FFldAnimalParam mParamater_;
    [FieldOffset(0x00F4)] public FVector mEscapeVector_;
    [FieldOffset(0x0108)] public AAppPropsCore* mOwnerAnimal_;
    [FieldOffset(0x0110)] public bool mInitDisp_;
    [FieldOffset(0x0120)] public FTransform mInitTransform_;
    [FieldOffset(0x0150)] public AFldAnimalHit* mEscapeHit_;
    [FieldOffset(0x0158)] public TArray<IntPtr> mOverlapTargets_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C0)] 
public unsafe struct UFldAnimalComp_BIRD
{
    [FieldOffset(0x0000)] public UFldAnimalCompCore baseObj;
    [FieldOffset(0x0168)] public bool bWalkAfterLanding_;
    [FieldOffset(0x016C)] public float mFlyPitch_;
    [FieldOffset(0x0170)] public float mFlyAwayTime_;
    [FieldOffset(0x0174)] public float mFlyAwayDist_;
    [FieldOffset(0x0178)] public float mComebackTime_;
    [FieldOffset(0x017C)] public float mComebackDist_;
    [FieldOffset(0x0180)] public bool bAutoFlyAway_;
    [FieldOffset(0x0184)] public float mAutoFlyAwayTimeFix_;
    [FieldOffset(0x0188)] public float mAutoFlyAwayTimeRnd_;
    [FieldOffset(0x018C)] public float mAutoFlyAwayYaw_;
    [FieldOffset(0x0190)] public bool bIsMove_;
    [FieldOffset(0x0194)] public float mMoveTimeFix_;
    [FieldOffset(0x0198)] public float mMoveTimeRnd_;
    [FieldOffset(0x019C)] public float mMoveDist_;
    [FieldOffset(0x01A0)] public float mMoveRadius_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FFldCatMotionList
{
    [FieldOffset(0x0000)] public TArray<EFldAnimalMotion_CAT> mList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x250)] 
public unsafe struct UFldAnimalComp_CAT
{
    [FieldOffset(0x0000)] public UFldAnimalCompCore baseObj;
    [FieldOffset(0x0168)] public TArray<FFldCatMotionList> mMotionPattern_;
    [FieldOffset(0x0178)] public float mEscapeTime_;
    [FieldOffset(0x017C)] public float mEscapeDist_;
    [FieldOffset(0x0180)] public float mComebackDist_;
    [FieldOffset(0x0184)] public bool bEscapeYawFixed_;
    [FieldOffset(0x0188)] public float mEscapeFixedYaw_;
    [FieldOffset(0x018C)] public bool bAutoWalkAway_;
    [FieldOffset(0x0190)] public float mAutoWalkAwayTimeFix_;
    [FieldOffset(0x0194)] public float mAutoWalkAwayTimeRnd_;
    [FieldOffset(0x0198)] public float mAutoWalkAwayYaw_;
    [FieldOffset(0x019C)] public float mAutoWalkAwayDist_;
    [FieldOffset(0x01A0)] public bool bFixedMove_;
    [FieldOffset(0x01A4)] public float mFixedMoveTimeFix_;
    [FieldOffset(0x01A8)] public float mFixedMoveTimeRnd_;
    [FieldOffset(0x01B0)] public FTransform mFixedMoveTransform_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1D0)] 
public unsafe struct UFldAnimalComp_PIGEON
{
    [FieldOffset(0x0000)] public UFldAnimalComp_BIRD baseObj;
    [FieldOffset(0x01C0)] public float mRunAwayDist_;
    [FieldOffset(0x01C4)] public float mHeroNearDist_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct AFldLocalActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x298)] 
public unsafe struct AFldAnimalHit
{
    [FieldOffset(0x0000)] public AFldLocalActor baseObj;
    [FieldOffset(0x0280)] public UFldAnimalCompCore* mOwner_;
    [FieldOffset(0x0288)] public float mHitRadius_;
    [FieldOffset(0x0290)] public USphereComponent* mHitComp_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x298)] 
public unsafe struct AFldObjBase
{
    [FieldOffset(0x0000)] public AFldLocalActor baseObj;
    [FieldOffset(0x0280)] public FName mOnFlagName_;
    [FieldOffset(0x0288)] public FName mOffFlagName_;
    [FieldOffset(0x0290)] public ECldWeek mOnWeek_;
    [FieldOffset(0x0291)] public bool bIsOnWeek_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FFldAnimeObjAnimation
{
    [FieldOffset(0x0000)] public UAnimationAsset* mAsset;
    [FieldOffset(0x0008)] public bool mLoop;
    [FieldOffset(0x0010)] public UNiagaraSystem* mNiagara;
}

[StructLayout(LayoutKind.Explicit, Size = 0x310)] 
public unsafe struct AFldAnimObj
{
    [FieldOffset(0x0000)] public AFldObjBase baseObj;
    [FieldOffset(0x0298)] public TArray<FFldAnimeObjAnimation> mAnimeArray_;
    [FieldOffset(0x02A8)] public int mIndex_;
    [FieldOffset(0x02AC)] public bool mNotPausedInLoop_;
    [FieldOffset(0x02B0)] public USkeletalMeshComponent* mAnimeMesh_;
    [FieldOffset(0x02B8)] public UNiagaraComponent* mNiagaraComp_;
    [FieldOffset(0x02C0)] public TArray<IntPtr> mAnimeMeshList_;
    [FieldOffset(0x02D0)] public int mAnimIndex_;
    [FieldOffset(0x02D4)] public bool bIsInit_;
    [FieldOffset(0x02D8)] public int mLoopAnimIndex_;
    [FieldOffset(0x02DC)] public bool mIsHide_;
    [FieldOffset(0x02E0)] public FTransform mHideTransform_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A8)] 
public unsafe struct AFldAtomSound
{
    [FieldOffset(0x0000)] public AFldLocalActor baseObj;
    [FieldOffset(0x0280)] public bool mSeasonSpring_;
    [FieldOffset(0x0281)] public bool mSeasonSummer_;
    [FieldOffset(0x0282)] public bool mSeasonAutumn_;
    [FieldOffset(0x0283)] public bool mSeasonWinter_;
    [FieldOffset(0x0284)] public bool mTimeNoon_;
    [FieldOffset(0x0285)] public bool mTimeAfternoon_;
    [FieldOffset(0x0286)] public bool mTimeNight_;
    [FieldOffset(0x0287)] public bool mTimeShadow_;
    [FieldOffset(0x0288)] public bool mOffInEvent_;
    [FieldOffset(0x028C)] public FName mOnFlagName_;
    [FieldOffset(0x0294)] public FName mOffFlagName_;
    [FieldOffset(0x02A0)] public UAtomComponent* AtomComponent;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B0)] 
public unsafe struct AFldScriptManagerCore
{
    [FieldOffset(0x0000)] public AFldLocalActor baseObj;
    [FieldOffset(0x0290)] public UAssetLoader* mAssetLoader_;
    [FieldOffset(0x0298)] public UBfAsset* mBfAsset_;
    [FieldOffset(0x02A0)] public UBmdAsset* mBmdAsset_;
    [FieldOffset(0x02A8)] public AFldScriptActor* mScriptActor_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B0)] 
public unsafe struct AFldAutoRecoverMenuScript
{
    [FieldOffset(0x0000)] public AFldScriptManagerCore baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B0)] 
public unsafe struct AFldBossBattleScript
{
    [FieldOffset(0x0000)] public AFldScriptManagerCore baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UFldBpFuncLib
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FFldPlayerHolder
{
    [FieldOffset(0x0000)] public APawn* Pawn;
    [FieldOffset(0x0008)] public UFldPlayerComp* PlayerComp;
    [FieldOffset(0x0010)] public UFldPlayerDungeonComp* DungeonComp;
}

[StructLayout(LayoutKind.Explicit, Size = 0x270)] 
public unsafe struct AFldCameraBase
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public USceneComponent* YawSceneComp;
    [FieldOffset(0x0228)] public USceneComponent* PitchSceneComp;
    [FieldOffset(0x0230)] public UCameraComponent* CameraComp;
    [FieldOffset(0x0238)] public AFldCameraHitBase* HitRef;
    [FieldOffset(0x0240)] public FFldPlayerHolder PlayerRef;
    [FieldOffset(0x0258)] public bool bIsCurrent;
    [FieldOffset(0x025C)] public FVector Input;
    [FieldOffset(0x0268)] public bool bZoom;
}

[StructLayout(LayoutKind.Explicit, Size = 0x7B0)] 
public unsafe struct AFldCamera
{
    [FieldOffset(0x0000)] public ACameraActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC8)] 
public unsafe struct UFldCameraBehaviorBase
{
    [FieldOffset(0x0000)] public UActorComponent baseObj;
    [FieldOffset(0x00B0)] public AFldCameraBase* BaseOwner;
    [FieldOffset(0x00B8)] public EFldCameraForwardType ForwardType;
    [FieldOffset(0x00C0)] public AActor* FreeForward;
}

[StructLayout(LayoutKind.Explicit, Size = 0xE0)] 
public unsafe struct UFldCameraBehaviorFixed
{
    [FieldOffset(0x0000)] public UFldCameraBehaviorBase baseObj;
    [FieldOffset(0x00C8)] public float FixedYaw;
    [FieldOffset(0x00CC)] public float FixedPitch;
    [FieldOffset(0x00D0)] public float MarginYaw;
    [FieldOffset(0x00D4)] public float MarginPitch;
    [FieldOffset(0x00D8)] public float RotSpeed;
    [FieldOffset(0x00DC)] public bool MarginForward;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C)] 
public unsafe struct FldCameraRotParam
{
    [FieldOffset(0x0000)] public float Speed;
    [FieldOffset(0x0004)] public float Acceleration;
    [FieldOffset(0x0008)] public float Deceleration;
    [FieldOffset(0x000C)] public float Press;
    [FieldOffset(0x0010)] public float Release;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FldCameraCorrectionParam
{
    [FieldOffset(0x0000)] public FldCameraRotParam baseObj;
    [FieldOffset(0x001C)] public float Margin;
}

[StructLayout(LayoutKind.Explicit, Size = 0x24)] 
public unsafe struct FldCameraSlopeParam
{
    [FieldOffset(0x0000)] public FldCameraRotParam baseObj;
    [FieldOffset(0x001C)] public float Margin;
    [FieldOffset(0x0020)] public float Pitch;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C)] 
public unsafe struct FldCameraParam
{
}

[StructLayout(LayoutKind.Explicit, Size = 0x270)] 
public unsafe struct UFldCameraBehaviorFree
{
    [FieldOffset(0x0000)] public UFldCameraBehaviorBase baseObj;
    [FieldOffset(0x00C8)] public AFldCameraFree* DrivedOwner;
    [FieldOffset(0x00D0)] public FFldPlayerHolder Player;
    [FieldOffset(0x00E8)] public FldCameraRotParam YawParam;
    [FieldOffset(0x0104)] public FldCameraRotParam PitchParam;
    [FieldOffset(0x0120)] public FldCameraCorrectionParam CorrectionParam;
    [FieldOffset(0x0140)] public FldCameraSlopeParam SlopeParam;
    [FieldOffset(0x0164)] public float FarLength;
    [FieldOffset(0x0168)] public float NearLength;
    [FieldOffset(0x016C)] public FVector Offset;
    [FieldOffset(0x0178)] public float ZoomTime;
    [FieldOffset(0x017C)] public float InitialPitch;
    [FieldOffset(0x0180)] public float DefaultMoveSpeed;
    [FieldOffset(0x0184)] public float NormalFov;
    [FieldOffset(0x0188)] public float DashFov;
    [FieldOffset(0x018C)] public float FovAnimSpeed;
    [FieldOffset(0x0190)] public float ExtrusionSpeed;
    [FieldOffset(0x0194)] public float UpLimitBegin;
    [FieldOffset(0x0198)] public float UpLimitEnd;
    [FieldOffset(0x019C)] public float UpLimitLength;
    [FieldOffset(0x01A0)] public FVector UpLimitOffset;
    [FieldOffset(0x01AC)] public float DownLimitBegin;
    [FieldOffset(0x01B0)] public float DownLimitEnd;
    [FieldOffset(0x01B4)] public float DownLimitLength;
    [FieldOffset(0x01B8)] public FVector DownLimitOffset;
    [FieldOffset(0x01C4)] public float BlurAmount;
    [FieldOffset(0x01C8)] public float PushOutOffset;
    [FieldOffset(0x0220)] public EFldCameraBehaviorFreeState State;
    [FieldOffset(0x0224)] public EFldCameraBehaviorFreeState NextState;
    [FieldOffset(0x0228)] public FVector StoredInput;
    [FieldOffset(0x0234)] public float AnimTime;
    [FieldOffset(0x0238)] public FldCameraParam ResetParam;
    [FieldOffset(0x0254)] public bool bResetDirectionOnce;
}

[StructLayout(LayoutKind.Explicit, Size = 0x278)] 
public unsafe struct AFldCameraFixed
{
    [FieldOffset(0x0000)] public AFldCameraBase baseObj;
    [FieldOffset(0x0270)] public UFldCameraBehaviorFixed* Behavior;
}

[StructLayout(LayoutKind.Explicit, Size = 0x278)] 
public unsafe struct AFldCameraFree
{
    [FieldOffset(0x0000)] public AFldCameraBase baseObj;
    [FieldOffset(0x0270)] public UFldCameraBehaviorFree* Behavior;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FldCameraLockAtParam
{
    [FieldOffset(0x0000)] public bool bEnable;
    [FieldOffset(0x0004)] public float MinLimitAngle;
    [FieldOffset(0x0008)] public float MaxLimitAngle;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2E0)] 
public unsafe struct AFldCameraHitBase
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UFldCameraTransBase* Transition;
    [FieldOffset(0x0280)] public FldCameraLockAtParam LockAtYaw;
    [FieldOffset(0x028C)] public FldCameraLockAtParam LockAtPitch;
    [FieldOffset(0x0298)] public bool LockAtForward;
}

[StructLayout(LayoutKind.Explicit, Size = 0x310)] 
public unsafe struct AFldCameraHitBox
{
    [FieldOffset(0x0000)] public AFldCameraHitBase baseObj;
    [FieldOffset(0x02E0)] public UBoxComponent* Box;
    [FieldOffset(0x02E8)] public AFldCameraFixed* Camera;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3A8)] 
public unsafe struct AFldCameraHitSpline
{
    [FieldOffset(0x0000)] public AFldCameraHitBase baseObj;
    [FieldOffset(0x02E0)] public UBoxComponent* BoxComp;
    [FieldOffset(0x02E8)] public USplineComponent* SplineComp;
    [FieldOffset(0x02F0)] public USplineComponent* CameraSplineComp;
    [FieldOffset(0x02F8)] public TMap<int, IntPtr> CameraList;
    [FieldOffset(0x0348)] public EFldCameraForwardType ForwardType;
    [FieldOffset(0x0350)] public AActor* FreeForward;
    [FieldOffset(0x0358)] public bool bTracking;
    [FieldOffset(0x035C)] public float TrackingDistance;
    [FieldOffset(0x0360)] public float TrackingBufferZone_Player;
    [FieldOffset(0x0364)] public float TrackingBufferZone_Camera;
    [FieldOffset(0x0368)] public float MarginYaw;
    [FieldOffset(0x036C)] public float MarginPitch;
    [FieldOffset(0x0370)] public float MarginSpeed;
    [FieldOffset(0x0374)] public bool MarginForward;
    [FieldOffset(0x0394)] public bool bFanShape;
    [FieldOffset(0x0398)] public float Yaw_FrontOffset;
    [FieldOffset(0x039C)] public float Yaw_BackOffset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x270)] 
public unsafe struct AFldCameraSpline
{
    [FieldOffset(0x0000)] public AFldCameraBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD0)] 
public unsafe struct UFldCameraTransBase
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x00C8)] public bool bIdentifyAngle;
    [FieldOffset(0x00CC)] public float ComplementaryAngle;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD8)] 
public unsafe struct UFldCameraTransLinear
{
    [FieldOffset(0x0000)] public UFldCameraTransBase baseObj;
    [FieldOffset(0x00D0)] public float TotalTime;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UFldCameraUtility
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD8)] 
public unsafe struct UFldCharAccessIconMngComp
{
    [FieldOffset(0x0000)] public UFldLocalActorComp baseObj;
    [FieldOffset(0x00C8)] public UAppCharBaseComp* mCharaBaseComp_;
    [FieldOffset(0x00D0)] public AActor* mIconActor_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x40)] 
public unsafe struct UFldCharAttackAnimNotify
{
    [FieldOffset(0x0000)] public UAnimNotify baseObj;
    [FieldOffset(0x0038)] public EFldCharAttackAnimNotifyFlag flag;
    [FieldOffset(0x003C)] public bool bEnable;
}

[StructLayout(LayoutKind.Explicit, Size = 0x230)] 
public unsafe struct AFldCharArea
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public USceneComponent* RootComp;
    [FieldOffset(0x0228)] public UBoxComponent* AreaComp;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FFldCharSpeed
{
    [FieldOffset(0x0000)] public float Walk;
    [FieldOffset(0x0004)] public float Run;
    [FieldOffset(0x0008)] public float Dash;
    [FieldOffset(0x000C)] public float Assault;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FFldCharMinorBgData
{
    [FieldOffset(0x0000)] public FFldCharSpeed Speed;
}

[StructLayout(LayoutKind.Explicit, Size = 0x50)] 
public unsafe struct FFldCharMajorBgData
{
    [FieldOffset(0x0000)] public TMap<int, FFldCharMinorBgData> Minor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FFldPlayerInputInterpolationData
{
    [FieldOffset(0x0000)] public float MinAgnle;
    [FieldOffset(0x0004)] public int MinFrame;
    [FieldOffset(0x0008)] public float MaxAgnle;
    [FieldOffset(0x000C)] public int MaxFrame;
    [FieldOffset(0x0010)] public float Border;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FFldPlayerAttackData
{
    [FieldOffset(0x0000)] public EDungeonAnimID AnimId;
    [FieldOffset(0x0004)] public float AnimBlendTime;
    [FieldOffset(0x0008)] public int WeaponAnimId;
    [FieldOffset(0x000C)] public float BeginReceivingInputTime;
    [FieldOffset(0x0010)] public float EndReceivingInputTime;
    [FieldOffset(0x0014)] public float SwitchNextAttackTime;
    [FieldOffset(0x0018)] public float SwitchFreeStateTime;
    [FieldOffset(0x001C)] public float SlideRot;
    [FieldOffset(0x0020)] public float SlideScaleTime;
    [FieldOffset(0x0024)] public float SlideScale;
    [FieldOffset(0x0028)] public int VoiceId;
    [FieldOffset(0x002C)] public int NextAttackId;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FFldPlayerAttackGuideData
{
    [FieldOffset(0x0000)] public float Range;
    [FieldOffset(0x0004)] public float Angle;
    [FieldOffset(0x0008)] public float GuideAngle;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FRumbleParam
{
    [FieldOffset(0x0000)] public int power;
    [FieldOffset(0x0004)] public int Frame;
    [FieldOffset(0x0008)] public int WaitFrame;
    [FieldOffset(0x000C)] public int Num;
    [FieldOffset(0x0010)] public int TotalFram;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3C)] 
public unsafe struct FRumbleData
{
    [FieldOffset(0x0000)] public FRumbleParam Encount;
    [FieldOffset(0x0014)] public FRumbleParam PinchEncount;
    [FieldOffset(0x0028)] public FRumbleParam Broken;
}

[StructLayout(LayoutKind.Explicit, Size = 0x118)] 
public unsafe struct FFldPlayerData
{
    [FieldOffset(0x0000)] public float InputDeadZone;
    [FieldOffset(0x0004)] public float InputWalkZone;
    [FieldOffset(0x0008)] public FFldPlayerInputInterpolationData InputInterpolation;
    [FieldOffset(0x001C)] public float Acceleration;
    [FieldOffset(0x0020)] public float Deceleration;
    [FieldOffset(0x0024)] public float RotSpeed;
    [FieldOffset(0x0028)] public float RotSpeed_Walk;
    [FieldOffset(0x002C)] public float TurnSpeed;
    [FieldOffset(0x0030)] public float TurnMoveRot;
    [FieldOffset(0x0034)] public float BrakingTime;
    [FieldOffset(0x0038)] public float BrakingSlideTime;
    [FieldOffset(0x003C)] public float ReverseBrakingTime;
    [FieldOffset(0x0040)] public float ReverseBrakingSlideTime;
    [FieldOffset(0x0044)] public float EncoutRadius;
    [FieldOffset(0x0048)] public float SwitchingTimeToAssault;
    [FieldOffset(0x004C)] public float SwitchingTimeToAssaultLv2;
    [FieldOffset(0x0050)] public float AssaultGetTpLv1;
    [FieldOffset(0x0054)] public float AssaultGetTpLv2;
    [FieldOffset(0x0058)] public int AssaultUpsetRateLv1;
    [FieldOffset(0x005C)] public int AssaultUpsetRateLv2;
    [FieldOffset(0x0060)] public int IdleAttackId;
    [FieldOffset(0x0064)] public int WalkAttackId;
    [FieldOffset(0x0068)] public int RunAttackId;
    [FieldOffset(0x006C)] public int DashAttackId;
    [FieldOffset(0x0070)] public int AssaultAttackId;
    [FieldOffset(0x0074)] public float AttackToMoveBlendTime;
    [FieldOffset(0x0078)] public TMap<int, FFldPlayerAttackData> attack;
    [FieldOffset(0x00C8)] public TArray<FFldPlayerAttackGuideData> AttackGuide;
    [FieldOffset(0x00D8)] public FRumbleData Rumble;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FFldPartnerData
{
    [FieldOffset(0x0000)] public float TrackingBeginDistance;
    [FieldOffset(0x0004)] public float TrackingNearDistance;
    [FieldOffset(0x0008)] public float TrackingUpdateDistance;
    [FieldOffset(0x000C)] public float AvoidPlayerDistance;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FFldCharKeyParam
{
    [FieldOffset(0x0000)] public EFldCharKeyType Save;
    [FieldOffset(0x0001)] public EFldCharKeyType AutoRecover;
    [FieldOffset(0x0002)] public EFldCharKeyType DailyMenu;
    [FieldOffset(0x0003)] public EFldCharKeyType DungeonMenu;
    [FieldOffset(0x0004)] public EFldCharKeyType Camp;
    [FieldOffset(0x0005)] public EFldCharKeyType LargeMap;
    [FieldOffset(0x0006)] public EFldCharKeyType BackLog;
    [FieldOffset(0x0007)] public EFldCharKeyType VoiceActionDisp;
    [FieldOffset(0x0008)] public EFldCharKeyType Check;
    [FieldOffset(0x0009)] public EFldCharKeyType attack;
    [FieldOffset(0x000A)] public EFldCharKeyType CameraZoomIn;
    [FieldOffset(0x000B)] public EFldCharKeyType CameraZoomOut;
    [FieldOffset(0x0010)] public TArray<EFldCharKeyType> CameraDefault;
    [FieldOffset(0x0020)] public EFldCharKeyType DebugCamera;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1F0)] 
public unsafe struct UFldCharDataAsset
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
    [FieldOffset(0x0030)] public FFldCharSpeed DailySpeed;
    [FieldOffset(0x0040)] public FFldCharSpeed DungeonSpeed;
    [FieldOffset(0x0050)] public TMap<int, FFldCharMajorBgData> MajorBg;
    [FieldOffset(0x00A0)] public FFldPlayerData Player;
    [FieldOffset(0x01B8)] public FFldPartnerData Partner;
    [FieldOffset(0x01C8)] public FFldCharKeyParam Key;
}

[StructLayout(LayoutKind.Explicit, Size = 0x148)] 
public unsafe struct UFldCharParamTable
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0028)] public TSoftObjectPtr<UFldCharDataAsset> Path;
    [FieldOffset(0x0050)] public UFldCharDataAsset* Data;
    [FieldOffset(0x0058)] public bool bLoaded;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD8)] 
public unsafe struct UFldCharEmotionIconMngComp
{
    [FieldOffset(0x0000)] public UFldLocalActorComp baseObj;
    [FieldOffset(0x00C8)] public UAppCharBaseComp* mCharaBaseComp_;
    [FieldOffset(0x00D0)] public AHandwritingSpawner* mHandwritingSpawner_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FFldPmtCostumeDataCore
{
    [FieldOffset(0x0000)] public int CostumeIndex;
    [FieldOffset(0x0004)] public int Setting;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FFldPersonalMotionData
{
    [FieldOffset(0x0000)] public int MotionID;
    [FieldOffset(0x0004)] public int IsBag;
    [FieldOffset(0x0008)] public TArray<FFldPmtCostumeDataCore> DailyCostumes;
}

[StructLayout(LayoutKind.Explicit, Size = 0x110)] 
public unsafe struct UFldCharPersonalMotionComp
{
    [FieldOffset(0x0000)] public UFldLocalActorComp baseObj;
    [FieldOffset(0x00C8)] public float mIdolTime_FIX_;
    [FieldOffset(0x00CC)] public float mIdolTime_RAND_;
    [FieldOffset(0x00D0)] public float mBlendTime_START_;
    [FieldOffset(0x00D4)] public float mBlendTime_END_;
    [FieldOffset(0x00D8)] public UAppCharBaseComp* mCharComp_;
    [FieldOffset(0x00E0)] public float mTimer_;
    [FieldOffset(0x00E4)] public float mMaxTime_;
    [FieldOffset(0x00E8)] public UAnimMontage* mAnimMontage_;
    [FieldOffset(0x00F0)] public TArray<FFldPersonalMotionData> mMotionList_BASE_;
    [FieldOffset(0x0100)] public TArray<FFldPersonalMotionData> mMotionList_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UFldCharSysBPFL
{
    [FieldOffset(0x0000)] public UBlueprintFunctionLibrary baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x340)] 
public unsafe struct AFldHitCore
{
    [FieldOffset(0x0000)] public AFldLocalActor baseObj;
    [FieldOffset(0x0288)] public TArray<IntPtr> mOtherList_;
    [FieldOffset(0x0298)] public int mPriority_;
    [FieldOffset(0x02A0)] public FString mBfAssetPath_;
    [FieldOffset(0x02B0)] public FString mBmdAssetPath_;
    [FieldOffset(0x02C0)] public USceneComponent* RootComp_;
    [FieldOffset(0x02C8)] public UShapeComponent* HitComp_;
    [FieldOffset(0x02D0)] public TSubclassOf<AUtlProcActor> mOverlapBluePrint_;
    [FieldOffset(0x02D8)] public bool mOverlapKeyLock_;
    [FieldOffset(0x02E0)] public TSubclassOf<AUtlProcActor> mKeyPushBluePrint_;
    [FieldOffset(0x02E8)] public bool mActionKeyLock_;
    [FieldOffset(0x02E9)] public FFldHitCoreHeroDirectType mHeroDirectType_;
    [FieldOffset(0x02EA)] public EFldHitCoreCheckIconType mCheckIcon_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FFldNpcCompAttachPropsParam
{
    [FieldOffset(0x0000)] public FTransform mAddTransform;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA0)] 
public unsafe struct FFldHitCharaModelParam
{
    [FieldOffset(0x0000)] public int mMajorID;
    [FieldOffset(0x0004)] public int mMinorID;
    [FieldOffset(0x0008)] public int mFbnNumber;
    [FieldOffset(0x000C)] public bool mNoCollision;
    [FieldOffset(0x0010)] public FTransform mAddTransform;
    [FieldOffset(0x0040)] public FFldNpcCompAttachPropsParam mAttachProps00;
    [FieldOffset(0x0070)] public FFldNpcCompAttachPropsParam mAttachProps01;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FFldHitCharaIconParam
{
    [FieldOffset(0x0000)] public FName mFlagName;
    [FieldOffset(0x0008)] public EFldHitCharaIconType mIconType;
}

[StructLayout(LayoutKind.Explicit, Size = 0x458)] 
public unsafe struct AFldHitCharacter
{
    [FieldOffset(0x0000)] public AFldHitCore baseObj;
    [FieldOffset(0x0340)] public UShapeComponent* CollisionComp_;
    [FieldOffset(0x0348)] public TArray<FFldHitCharaModelParam> mCharaModelParam_;
    [FieldOffset(0x0358)] public EFldHitCharaIconType mIconType_;
    [FieldOffset(0x0359)] public bool mIconPlural_;
    [FieldOffset(0x0360)] public TArray<FFldHitCharaIconParam> mChangeIconParam_;
    [FieldOffset(0x0370)] public EFldHitCharaIconAttachedType mIconAttachedType_;
    [FieldOffset(0x0374)] public FVector mIconDirectLocationMODEL_;
    [FieldOffset(0x0380)] public bool bIconDirectLocationMODEL_;
    [FieldOffset(0x0384)] public FName mReadedFlagName_;
    [FieldOffset(0x038C)] public int mFloorIndex_;
    [FieldOffset(0x0390)] public bool mLookHeroOverlap_;
    [FieldOffset(0x0391)] public bool mSpeakMotionKeyPush_;
    [FieldOffset(0x0392)] public bool mLookHeroKeyPush_;
    [FieldOffset(0x0393)] public bool mFaceingHeroKeyPush_;
    [FieldOffset(0x0394)] public EFldHitCharaHeroMotion mHeroMotionKeyPush_;
    [FieldOffset(0x0395)] public bool mReturnBaseRotator_;
    [FieldOffset(0x0398)] public TSubclassOf<ACharacterBaseCore> mCharaBaseClass_;
    [FieldOffset(0x03A0)] public TSubclassOf<ANpcBaseCore> mNpcBaseClass_;
    [FieldOffset(0x03A8)] public TMap<short, IntPtr> mCharaModelList_;
    [FieldOffset(0x03F8)] public AActor* mIconActor_;
    [FieldOffset(0x0400)] public AActor* mMoveActor_;
    [FieldOffset(0x0408)] public AActor* mHeroProcActor_;
    [FieldOffset(0x0410)] public FString mDispName_;
    [FieldOffset(0x0420)] public bool bChangedRotator_;
    [FieldOffset(0x0424)] public FRotator mBaseRotator_;
    [FieldOffset(0x0430)] public UFldHitCharaIdleTalkComp* mIdleTalkComp_;
    [FieldOffset(0x0438)] public UFldHitCharaIdleBehaviorComp* mIdleBehaviorComp_;
    [FieldOffset(0x0440)] public bool bIsIdleBehaviorCreated_;
    [FieldOffset(0x0441)] public bool bGetAwayPrevAction_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x488)] 
public unsafe struct AFldCmmActor
{
    [FieldOffset(0x0000)] public AFldHitCharacter baseObj;
    [FieldOffset(0x0458)] public int mUniqueId_;
    [FieldOffset(0x045C)] public EFldCmmNpcType mType_;
    [FieldOffset(0x0460)] public int mNameIndex_;
    [FieldOffset(0x0464)] public bool mNotMapInfoDisp_;
    [FieldOffset(0x0468)] public FVector mMapIconDirectLocation_;
    [FieldOffset(0x0474)] public bool bMapIconDirectLocation_;
    [FieldOffset(0x0478)] public FName mOnFlagName_;
    [FieldOffset(0x0480)] public FName mOffFlagName_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct AFldCmnDataActor
{
    [FieldOffset(0x0000)] public AFldLocalActor baseObj;
    [FieldOffset(0x0288)] public UFldCommonData* mParent_;
    [FieldOffset(0x0290)] public UAssetLoader* mAssetLoader_;
    [FieldOffset(0x0298)] public UArcAsset* mArcAsset_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x230)] 
public unsafe struct UFldCommonData
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0030)] public AFldCmnDataActor* mActor_;
    [FieldOffset(0x00B8)] public AFldTvProgramScript* mTvProgramActor_;
    [FieldOffset(0x00C0)] public AFldMailOrderScript* mMailOrderActor_;
    [FieldOffset(0x00C8)] public AFldBossBattleScript* mBossBattleActor_;
    [FieldOffset(0x00D0)] public UDataTable* mTableDat_;
    [FieldOffset(0x0188)] public UClass* mBpClass_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x110)] 
public unsafe struct UFldCrowdIdleBehaviorComp
{
    [FieldOffset(0x0000)] public UFldLocalActorComp baseObj;
    [FieldOffset(0x00C8)] public float mLoopPitchTime_;
    [FieldOffset(0x00CC)] public float mPitchRadius_;
    [FieldOffset(0x00D0)] public float mLoopRollTime_;
    [FieldOffset(0x00D4)] public float mRollRadius_;
    [FieldOffset(0x00D8)] public float mPitchTimer_;
    [FieldOffset(0x00DC)] public int mPitchDir_;
    [FieldOffset(0x00E0)] public float mRollTimer_;
    [FieldOffset(0x00E4)] public int mRollDir_;
    [FieldOffset(0x00E8)] public FRotator mBaseRotator_;
    [FieldOffset(0x00F4)] public FVector mForwardVector_;
    [FieldOffset(0x0100)] public FVector mRightVector_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FFldCrowdNpcChildParam
{
    [FieldOffset(0x0000)] public int mColorID_G;
    [FieldOffset(0x0004)] public int mColorID_B;
    [FieldOffset(0x0008)] public float mRandomValue;
    [FieldOffset(0x000C)] public bool mGrassesOn;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct AFldCrowdNpcBase
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UCapsuleComponent* CapsuleComp_;
    [FieldOffset(0x0280)] public int mDispValue_;
    [FieldOffset(0x0284)] public FName mOffFlagName_;
    [FieldOffset(0x0290)] public TArray<FFldCrowdNpcChildParam> mChildParam_;
}

[StructLayout(LayoutKind.Explicit, Size = 0xE8)] 
public unsafe struct UFldCrowdOpacityComp
{
    [FieldOffset(0x0000)] public UFldLocalActorComp baseObj;
    [FieldOffset(0x00C8)] public float mTargetOpacity_;
    [FieldOffset(0x00CC)] public float mSpeed_;
    [FieldOffset(0x00D0)] public float mInvisibleRadius_;
    [FieldOffset(0x00D4)] public float mDisappearRadius_;
    [FieldOffset(0x00D8)] public float mOpacity_;
    [FieldOffset(0x00DC)] public FAppCharTransparency mTransparency_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x238)] 
public unsafe struct AFldCrowdTarget
{
    [FieldOffset(0x0000)] public AMobWalkTarget baseObj;
    [FieldOffset(0x0228)] public int mIndex_;
    [FieldOffset(0x0230)] public AMobWalkCharaBaseCore* mMobActor_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x258)] 
public unsafe struct AFldCrowdTarget_STOP
{
    [FieldOffset(0x0000)] public AFldCrowdTarget baseObj;
    [FieldOffset(0x0238)] public int mStopRatio_;
    [FieldOffset(0x023C)] public float mStopTime_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FFldCrowdWalkRouteTimer
{
    [FieldOffset(0x0000)] public float mTimer_;
    [FieldOffset(0x0004)] public float mLoopTime_;
    [FieldOffset(0x0008)] public EFldCrowdRoutePtn mRoutePattern;
    [FieldOffset(0x0010)] public TArray<int> mPointList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FFldCrowdWalkRouteParam
{
    [FieldOffset(0x0000)] public TArray<int> mPointList;
    [FieldOffset(0x0010)] public EFldCrowdRoutePtn mRoutePattern_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FFldCrowdWalkFollowParam
{
    [FieldOffset(0x0000)] public TSubclassOf<AMobWalkCharaBaseCore> mMobBpClass;
    [FieldOffset(0x0008)] public FVector mRelativeLocation;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FFldCrowdWalkBpParam
{
    [FieldOffset(0x0000)] public TSubclassOf<AMobWalkCharaBaseCore> mMobBpClass;
    [FieldOffset(0x0008)] public TArray<FFldCrowdWalkFollowParam> mFollowList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C0)] 
public unsafe struct AFldCrowdWalkManager
{
    [FieldOffset(0x0000)] public AFldLocalActor baseObj;
    [FieldOffset(0x0280)] public uint mFlag_;
    [FieldOffset(0x0288)] public TArray<FFldCrowdWalkRouteTimer> mRouteTimers_;
    [FieldOffset(0x0298)] public float mMinTimer_;
    [FieldOffset(0x029C)] public float mMaxTimer_;
    [FieldOffset(0x02A0)] public TArray<FFldCrowdWalkRouteParam> mRouteParam_;
    [FieldOffset(0x02B0)] public TArray<FFldCrowdWalkBpParam> mMobBpList_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x110)] 
public unsafe struct UFldCrowdWalkOpacityComp
{
    [FieldOffset(0x0000)] public UFldCrowdOpacityComp baseObj;
    [FieldOffset(0x00E8)] public float mSpeedLoc_;
    [FieldOffset(0x00EC)] public float mInvisibleRadiusLoc_;
    [FieldOffset(0x00F0)] public float mDisappearRadiusLoc_;
    [FieldOffset(0x00F4)] public FVector mStartPoint_;
    [FieldOffset(0x0100)] public FVector mEndPoint_;
    [FieldOffset(0x010C)] public float mOpacityLoc_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B8)] 
public unsafe struct AFldDailyMenuScript
{
    [FieldOffset(0x0000)] public AFldScriptManagerCore baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B0)] 
public unsafe struct AFldDbgChLoad
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0238)] public TArray<TSoftClassPtr<UAnimInstance>> AnimInsList;
    [FieldOffset(0x0248)] public UObject* InitSkel;
    [FieldOffset(0x0250)] public UObject* InitAnim;
    [FieldOffset(0x0258)] public TArray<IntPtr> loadedAssets;
    [FieldOffset(0x02A8)] public UAppCharLoader* Loader;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FFldEnemyHolder
{
    [FieldOffset(0x0000)] public AActor* Actor;
    [FieldOffset(0x0008)] public UFldEnemyComp* EnemyComp;
}

[StructLayout(LayoutKind.Explicit, Size = 0x260)] 
public unsafe struct AFldDbgEmMaker
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public UClass* EmClass;
    [FieldOffset(0x0228)] public TArray<IntPtr> Bg;
    [FieldOffset(0x0248)] public bool IsLoadEnded;
    [FieldOffset(0x0250)] public TArray<FFldEnemyHolder> Enemy;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FFldPartnerHolder
{
    [FieldOffset(0x0000)] public APawn* Pawn;
    [FieldOffset(0x0008)] public UFldPartnerComp* PartnerComp;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2D8)] 
public unsafe struct AFldDbgMaker
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public UClass* PlayerClass;
    [FieldOffset(0x0228)] public AActor* PlayerPoints;
    [FieldOffset(0x0230)] public int PlayerCharaId;
    [FieldOffset(0x0238)] public FFldPlayerHolder Player;
    [FieldOffset(0x0250)] public UClass* PartnerClass;
    [FieldOffset(0x0258)] public UClass* KoroPartnerClass;
    [FieldOffset(0x0260)] public TArray<int> PartnerId;
    [FieldOffset(0x0270)] public TArray<IntPtr> PartnerPoints;
    [FieldOffset(0x0280)] public TArray<IntPtr> PartnerActors;
    [FieldOffset(0x0290)] public TArray<FFldPartnerHolder> Partners;
    [FieldOffset(0x02A0)] public int CostumeID;
    [FieldOffset(0x02A4)] public EAnimPackID AnimPackID;
    [FieldOffset(0x02A5)] public bool bWeapon;
    [FieldOffset(0x02A8)] public int WeaponId;
    [FieldOffset(0x02AC)] public bool bBag;
    [FieldOffset(0x02B0)] public int BagId;
    [FieldOffset(0x02B8)] public UAppCharFootstepsDataAsset* FootstepsData;
    [FieldOffset(0x02D0)] public bool IsLoad;
    [FieldOffset(0x02D1)] public bool ReLoadCostume;
}

[StructLayout(LayoutKind.Explicit, Size = 0x278)] 
public unsafe struct AFldDbgNpcMaker
{
    [FieldOffset(0x0000)] public AActor baseObj;
    [FieldOffset(0x0220)] public UClass* NpcClass;
    [FieldOffset(0x0228)] public TArray<int> NpcIDs;
    [FieldOffset(0x0238)] public TArray<IntPtr> NpcPoints;
    [FieldOffset(0x0248)] public TArray<IntPtr> NpcActors;
    [FieldOffset(0x0258)] public EAnimPackID AnimPackID;
    [FieldOffset(0x0270)] public bool IsLoad;
}

[StructLayout(LayoutKind.Explicit, Size = 0x24)] 
public unsafe struct FFldDungeonPartsSelDataAssetRecord
{
    [FieldOffset(0x0000)] public byte parts01;
    [FieldOffset(0x0001)] public byte parts02;
    [FieldOffset(0x0002)] public byte parts03;
    [FieldOffset(0x0003)] public byte parts04;
    [FieldOffset(0x0004)] public byte parts05;
    [FieldOffset(0x0005)] public byte parts06;
    [FieldOffset(0x0006)] public byte parts07;
    [FieldOffset(0x0007)] public byte parts08;
    [FieldOffset(0x0008)] public uint primBit01;
    [FieldOffset(0x000C)] public uint primBit02;
    [FieldOffset(0x0010)] public uint primBit03;
    [FieldOffset(0x0014)] public uint scndBit01;
    [FieldOffset(0x0018)] public uint scndBit02;
    [FieldOffset(0x001C)] public uint scndBit03;
    [FieldOffset(0x0020)] public byte primNum;
    [FieldOffset(0x0021)] public byte room;
    [FieldOffset(0x0022)] public byte roomMax;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FFldDungeonLayoutCombDataAssetRecord
{
    [FieldOffset(0x0000)] public ushort prio;
    [FieldOffset(0x0002)] public ushort Index;
    [FieldOffset(0x0004)] public byte Data0_0_no;
    [FieldOffset(0x0005)] public byte Data0_0_dir;
    [FieldOffset(0x0006)] public byte Data0_0_y;
    [FieldOffset(0x0007)] public byte Data0_1_no;
    [FieldOffset(0x0008)] public byte Data0_1_dir;
    [FieldOffset(0x0009)] public byte Data0_1_y;
    [FieldOffset(0x000A)] public byte Data0_2_no;
    [FieldOffset(0x000B)] public byte Data0_2_dir;
    [FieldOffset(0x000C)] public byte Data0_2_y;
    [FieldOffset(0x000D)] public byte Data1_0_no;
    [FieldOffset(0x000E)] public byte Data1_0_dir;
    [FieldOffset(0x000F)] public byte Data1_0_y;
    [FieldOffset(0x0010)] public byte Data1_1_no;
    [FieldOffset(0x0011)] public byte Data1_1_dir;
    [FieldOffset(0x0012)] public byte Data1_1_y;
    [FieldOffset(0x0013)] public byte Data1_2_no;
    [FieldOffset(0x0014)] public byte Data1_2_dir;
    [FieldOffset(0x0015)] public byte Data1_2_y;
    [FieldOffset(0x0016)] public byte Data2_0_no;
    [FieldOffset(0x0017)] public byte Data2_0_dir;
    [FieldOffset(0x0018)] public byte Data2_0_y;
    [FieldOffset(0x0019)] public byte Data2_1_no;
    [FieldOffset(0x001A)] public byte Data2_1_dir;
    [FieldOffset(0x001B)] public byte Data2_1_y;
    [FieldOffset(0x001C)] public byte Data2_2_no;
    [FieldOffset(0x001D)] public byte Data2_2_dir;
    [FieldOffset(0x001E)] public byte Data2_2_y;
}

[StructLayout(LayoutKind.Explicit, Size = 0x74)] 
public unsafe struct FFldDungeonFloorDataAssetRecord
{
    [FieldOffset(0x0000)] public uint flags;
    [FieldOffset(0x0004)] public ushort FieldMajor;
    [FieldOffset(0x0006)] public ushort FieldMinor;
    [FieldOffset(0x0008)] public ushort major;
    [FieldOffset(0x000A)] public ushort Minor;
    [FieldOffset(0x000C)] public byte areaNo;
    [FieldOffset(0x000D)] public byte envID;
    [FieldOffset(0x000E)] public byte partMin;
    [FieldOffset(0x000F)] public byte partMax;
    [FieldOffset(0x0010)] public byte partSelTable;
    [FieldOffset(0x0011)] public byte enemyMin;
    [FieldOffset(0x0012)] public byte enemyMax;
    [FieldOffset(0x0013)] public byte strongEnemyProbability;
    [FieldOffset(0x0014)] public byte strongEnemyMax;
    [FieldOffset(0x0015)] public byte rareEnemyProbability;
    [FieldOffset(0x0016)] public byte rareEnemyMax;
    [FieldOffset(0x0017)] public byte repopNormalNormal;
    [FieldOffset(0x0018)] public byte repopNormalStrong;
    [FieldOffset(0x0019)] public byte repopNormalRare;
    [FieldOffset(0x001A)] public byte repopStrongNormal;
    [FieldOffset(0x001B)] public byte repopStrongStrong;
    [FieldOffset(0x001C)] public byte repopStrongRare;
    [FieldOffset(0x001D)] public byte repopRareNormal;
    [FieldOffset(0x001E)] public byte repopRareStrong;
    [FieldOffset(0x001F)] public byte repopRareRare;
    [FieldOffset(0x0020)] public float reaper;
    [FieldOffset(0x0024)] public ushort encountPack;
    [FieldOffset(0x0026)] public ushort strongEncountPack;
    [FieldOffset(0x0028)] public ushort pinchEncountPack;
    [FieldOffset(0x002A)] public ushort pinchStrongEncountPack;
    [FieldOffset(0x002C)] public ushort rareEncountPack;
    [FieldOffset(0x002E)] public ushort continousEncount1;
    [FieldOffset(0x0030)] public ushort continousEncount2;
    [FieldOffset(0x0032)] public byte doorGroup;
    [FieldOffset(0x0033)] public byte doorProbability;
    [FieldOffset(0x0034)] public ushort returnDevProbability;
    [FieldOffset(0x0036)] public byte tboxMin;
    [FieldOffset(0x0037)] public byte tboxMax;
    [FieldOffset(0x0038)] public byte tboxType;
    [FieldOffset(0x0039)] public byte moneyProbability;
    [FieldOffset(0x003A)] public ushort moneyMin;
    [FieldOffset(0x003C)] public ushort moneyMax;
    [FieldOffset(0x003E)] public ushort tboxPack;
    [FieldOffset(0x0040)] public ushort rareTboxPack;
    [FieldOffset(0x0042)] public ushort jewelryTboxPack;
    [FieldOffset(0x0044)] public ushort primFieldTboxPack;
    [FieldOffset(0x0046)] public ushort medal1TboxPack;
    [FieldOffset(0x0048)] public ushort medal2TboxPack;
    [FieldOffset(0x004A)] public ushort medal3TboxPack;
    [FieldOffset(0x004C)] public ushort medal4TboxPack;
    [FieldOffset(0x004E)] public ushort medal5TboxPack;
    [FieldOffset(0x0050)] public ushort medal6TboxPack;
    [FieldOffset(0x0052)] public ushort doorTboxPack;
    [FieldOffset(0x0054)] public ushort doorRareTboxPack;
    [FieldOffset(0x0056)] public ushort doorJewelryTboxPack;
    [FieldOffset(0x0058)] public ushort doorPrimFieldTboxPack;
    [FieldOffset(0x005A)] public ushort doorMedal1TboxPack;
    [FieldOffset(0x005C)] public ushort doorMedal2TboxPack;
    [FieldOffset(0x005E)] public ushort doorMedal3TboxPack;
    [FieldOffset(0x0060)] public ushort doorMedal4TboxPack;
    [FieldOffset(0x0062)] public ushort doorMedal5TboxPack;
    [FieldOffset(0x0064)] public ushort doorMedal6TboxPack;
    [FieldOffset(0x0068)] public uint missingPersonID;
    [FieldOffset(0x006C)] public uint missingBuildID;
    [FieldOffset(0x0070)] public uint scrFileNo;
}

[StructLayout(LayoutKind.Explicit, Size = 0x24)] 
public unsafe struct FFldDungeonTBoxTypeDataAssetRecord
{
    [FieldOffset(0x0000)] public ushort rareMin;
    [FieldOffset(0x0002)] public ushort rareMax;
    [FieldOffset(0x0004)] public ushort jewelryMin;
    [FieldOffset(0x0006)] public ushort jewelryMax;
    [FieldOffset(0x0008)] public ushort primFieldMin;
    [FieldOffset(0x000A)] public ushort primFieldMax;
    [FieldOffset(0x000C)] public ushort medal1Min;
    [FieldOffset(0x000E)] public ushort medal1Max;
    [FieldOffset(0x0010)] public ushort medal2Min;
    [FieldOffset(0x0012)] public ushort medal2Max;
    [FieldOffset(0x0014)] public ushort medal3Min;
    [FieldOffset(0x0016)] public ushort medal3Max;
    [FieldOffset(0x0018)] public ushort medal4Min;
    [FieldOffset(0x001A)] public ushort medal4Max;
    [FieldOffset(0x001C)] public ushort medal5Min;
    [FieldOffset(0x001E)] public ushort medal5Max;
    [FieldOffset(0x0020)] public ushort medal6Min;
    [FieldOffset(0x0022)] public ushort medal6Max;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FFldDungeonTBoxItemDataAssetRecord
{
    [FieldOffset(0x0000)] public ushort ItemId;
    [FieldOffset(0x0002)] public ushort itemNum;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FFldDungeonTBoxPacDataAssetRecord
{
    [FieldOffset(0x0000)] public uint pacID;
    [FieldOffset(0x0004)] public ushort tboxID;
    [FieldOffset(0x0006)] public ushort Probability;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FFldDungeonEncountPacDataAssetRecord
{
    [FieldOffset(0x0000)] public ushort encNo1;
    [FieldOffset(0x0002)] public ushort probability1;
    [FieldOffset(0x0004)] public ushort encNo2;
    [FieldOffset(0x0006)] public ushort probability2;
    [FieldOffset(0x0008)] public ushort encNo3;
    [FieldOffset(0x000A)] public ushort probability3;
    [FieldOffset(0x000C)] public ushort encNo4;
    [FieldOffset(0x000E)] public ushort probability4;
    [FieldOffset(0x0010)] public ushort encNo5;
    [FieldOffset(0x0012)] public ushort probability5;
    [FieldOffset(0x0014)] public ushort encNo6;
    [FieldOffset(0x0016)] public ushort probability6;
    [FieldOffset(0x0018)] public ushort encNo7;
    [FieldOffset(0x001A)] public ushort probability7;
    [FieldOffset(0x001C)] public ushort encNo8;
    [FieldOffset(0x001E)] public ushort probability8;
    [FieldOffset(0x0020)] public byte order1;
    [FieldOffset(0x0021)] public byte order2;
    [FieldOffset(0x0022)] public byte order3;
    [FieldOffset(0x0023)] public byte order4;
    [FieldOffset(0x0024)] public byte order5;
    [FieldOffset(0x0025)] public byte order6;
    [FieldOffset(0x0026)] public byte order7;
    [FieldOffset(0x0027)] public byte order8;
}

[StructLayout(LayoutKind.Explicit, Size = 0xA0)] 
public unsafe struct UFldDungeonTable
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FFldDungeonPartsSelDataAssetRecord> PartsSelData;
    [FieldOffset(0x0040)] public TArray<FFldDungeonLayoutCombDataAssetRecord> LayoutCombData;
    [FieldOffset(0x0050)] public TArray<FFldDungeonFloorDataAssetRecord> FloorData;
    [FieldOffset(0x0060)] public TArray<FFldDungeonTBoxTypeDataAssetRecord> TBoxTypeData;
    [FieldOffset(0x0070)] public TArray<FFldDungeonTBoxItemDataAssetRecord> TBoxItemData;
    [FieldOffset(0x0080)] public TArray<FFldDungeonTBoxPacDataAssetRecord> TBoxPacData;
    [FieldOffset(0x0090)] public TArray<FFldDungeonEncountPacDataAssetRecord> EncountPacData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x200)] 
public unsafe struct UFldDoorPointComp
{
    [FieldOffset(0x0000)] public USceneComponent baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FFldDoorAnimationData
{
    [FieldOffset(0x0000)] public UAnimationAsset* mActionAsset;
    [FieldOffset(0x0008)] public UAnimationAsset* mWaitAsset;
    [FieldOffset(0x0010)] public int mCharaMotionID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x390)] 
public unsafe struct AFldDoorObjCore
{
    [FieldOffset(0x0000)] public AFldAnimObj baseObj;
    [FieldOffset(0x0310)] public float mWalkSpeed_;
    [FieldOffset(0x0314)] public float mDoorCloseRange_;
    [FieldOffset(0x0318)] public UAnimationAsset* mWaitAsset_CLOSE_;
    [FieldOffset(0x0320)] public FFldDoorAnimationData mAnime_FRONT_;
    [FieldOffset(0x0338)] public FFldDoorAnimationData mAnime_BACK_;
    [FieldOffset(0x0350)] public USceneComponent* Root;
    [FieldOffset(0x0358)] public USkeletalMeshComponent* SkeletalMesh;
    [FieldOffset(0x0360)] public UFldDoorPointComp* FrontPoint;
    [FieldOffset(0x0368)] public UFldDoorPointComp* BackPoint;
    [FieldOffset(0x0370)] public uint mFlag_;
}

[StructLayout(LayoutKind.Explicit, Size = 0x148)] 
public unsafe struct UFldDungeonComponentBase
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x0118)] public TArray<IntPtr> m_ScrHandleList01;
    [FieldOffset(0x0128)] public TArray<IntPtr> m_ScrHandleList02;
    [FieldOffset(0x013C)] public FName m_Name;
}

[StructLayout(LayoutKind.Explicit, Size = 0x150)] 
public unsafe struct UFldDungeonAccidentController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x80)] 
public unsafe struct UDungeonAssetData
{
    [FieldOffset(0x0000)] public UObject baseObj;
    [FieldOffset(0x0050)] public UObject* m_pObject;
    [FieldOffset(0x0078)] public UDungeonAssetData* m_pSyncData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x278)] 
public unsafe struct AFldDungeonAutoGenerateBaseActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x278)] 
public unsafe struct AFldDungeonAutoGenerateActor
{
    [FieldOffset(0x0000)] public AFldDungeonAutoGenerateBaseActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x510)] 
public unsafe struct AFldDungeonBase
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public USceneComponent* Root;
    [FieldOffset(0x02B8)] public AFldDungeonSoundActor* m_pEnvSEActor;
    [FieldOffset(0x02C8)] public AFldDungeonAutoGenerateActor* m_pFloorAutoGenerator;
    [FieldOffset(0x02D0)] public AFldEnemyManager* m_pEnemyManager;
    [FieldOffset(0x02D8)] public AFldPartnerManager* m_pPartnerManager;
    [FieldOffset(0x02E0)] public TArray<IntPtr> m_ControlComponent;
    [FieldOffset(0x0340)] public AFldDungeonParamActor* m_pDungeonParam;
}

[StructLayout(LayoutKind.Explicit, Size = 0x300)] 
public unsafe struct AFldDungeonBattleEncount
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0290)] public ACharacter* m_pCharacter;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B0)] 
public unsafe struct AFldDungeonBattleResult
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0290)] public UAssetLoader* m_pLoader;
    [FieldOffset(0x0298)] public UBfAsset* m_pBfAsset;
}

[StructLayout(LayoutKind.Explicit, Size = 0x288)] 
public unsafe struct AFldDungeonRollBack
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0280)] public UAddContent* m_pAddContentCheck;
}

[StructLayout(LayoutKind.Explicit, Size = 0x288)] 
public unsafe struct AFldDungeonBattleRetry
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x180)] 
public unsafe struct UFldDungeonBrokenObjController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0150)] public TArray<IntPtr> m_BrokenActor;
    [FieldOffset(0x0160)] public TArray<IntPtr> m_LayoutArray;
}

[StructLayout(LayoutKind.Explicit, Size = 0x160)] 
public unsafe struct UFldDungeonClockController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0148)] public AFldDungeonObjectActor* m_ClockActor;
    [FieldOffset(0x0150)] public AFldDungeonLayoutActor* m_pLayoutClock;
}

[StructLayout(LayoutKind.Explicit, Size = 0x288)] 
public unsafe struct AFldDungeonScriptActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x510)] 
public unsafe struct AFldDungeonGameBase
{
    [FieldOffset(0x0000)] public AFldDungeonBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x540)] 
public unsafe struct AFldDungeonGameInit
{
    [FieldOffset(0x0000)] public AFldDungeonGameBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x540)] 
public unsafe struct AFldDungeonGame
{
    [FieldOffset(0x0000)] public AFldDungeonGameInit baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x540)] 
public unsafe struct AFldDungeonControlActor
{
    [FieldOffset(0x0000)] public AFldDungeonGame baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x150)] 
public unsafe struct UFldDungeonDebugController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1F0)] 
public unsafe struct UFldDungeonEffectController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0148)] public TArray<IntPtr> m_EffectActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2D0)] 
public unsafe struct AFldDungeonEffectActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public EDungeonEffectType Type;
    [FieldOffset(0x0280)] public FSoftObjectPath NiagaraPath;
    [FieldOffset(0x0298)] public float fadeInTime;
    [FieldOffset(0x029C)] public float fadeOutTime;
    [FieldOffset(0x02C0)] public UNiagaraComponent* m_pNiagara;
}

[StructLayout(LayoutKind.Explicit, Size = 0xD8)] 
public unsafe struct UFldDungeonEffectTartarosSearch
{
    [FieldOffset(0x0000)] public UAppActorComponent baseObj;
    [FieldOffset(0x00C8)] public float LifeSpan;
    [FieldOffset(0x00CC)] public float Intensity;
    [FieldOffset(0x00D0)] public float MaxBrightness;
    [FieldOffset(0x00D4)] public float Radius;
}

[StructLayout(LayoutKind.Explicit, Size = 0x290)] 
public unsafe struct AFldDungeonEffectCameraAttachActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public UNiagaraCameraAttachComponent* m_pEffec;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2D8)] 
public unsafe struct UFldDungeonEncountController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0218)] public TArray<FFldEnemyHolder> m_EnemyCompArray;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct UFldDungeonEnemyController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0148)] public TArray<IntPtr> m_pLayoutDirectArray;
    [FieldOffset(0x0158)] public TArray<FFldEnemyHolder> m_EnemyList;
    [FieldOffset(0x0168)] public TMap<int, FFldEnemyHolder> m_DirectEnemy;
    [FieldOffset(0x01B8)] public TArray<FFldEnemyHolder> m_MonadEnemy;
    [FieldOffset(0x01C8)] public TArray<FFldEnemyHolder> m_FDoorEnemy;
    [FieldOffset(0x01D8)] public TArray<FFldEnemyHolder> m_Reaper;
    [FieldOffset(0x01E8)] public TArray<IntPtr> m_FixedLayoutArray;
    [FieldOffset(0x01F8)] public TArray<IntPtr> m_FixedLayoutPathArray;
    [FieldOffset(0x0208)] public TArray<IntPtr> m_DesignLayoutArray;
    [FieldOffset(0x0218)] public TArray<IntPtr> m_DesignLayoutPathArray;
    [FieldOffset(0x0228)] public TArray<IntPtr> m_MonadLayoutArray;
}

[StructLayout(LayoutKind.Explicit, Size = 0x160)] 
public unsafe struct UFldDungeonEnvController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0148)] public TArray<IntPtr> m_EnvActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct AFldDungeonEnvActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public EDungeonEnvType Type;
}

[StructLayout(LayoutKind.Explicit, Size = 0x158)] 
public unsafe struct UFldDungeonEventController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x298)] 
public unsafe struct AFldDungeonEventTransActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public EDungeonEventTransOriginType TransOriginType;
    [FieldOffset(0x027C)] public int WithinTypeID;
    [FieldOffset(0x0280)] public TArray<IntPtr> m_LayoutPos;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct AFldDungeonEventRefActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public int RefID;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FDungeonFloorFlagsIDData
{
    [FieldOffset(0x0000)] public FName Tag;
    [FieldOffset(0x0008)] public uint ID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FDungeonAssignFlagsData
{
    [FieldOffset(0x0000)] public FName Tag;
    [FieldOffset(0x0008)] public FName FlagName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FDungeonFloorFlagsData
{
    [FieldOffset(0x0000)] public uint FloorNo;
    [FieldOffset(0x0008)] public TArray<FDungeonAssignFlagsData> AssignFlagList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FDungeonFloorFlagsDataTableRow
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public TArray<FDungeonFloorFlagsData> Data;
}

[StructLayout(LayoutKind.Explicit, Size = 0x58)] 
public unsafe struct UFldDungeonFloorFlagsDataAsset
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
    [FieldOffset(0x0030)] public TArray<FDungeonFloorFlagsIDData> IDList;
    [FieldOffset(0x0040)] public FDungeonFloorFlagsDataTableRow FloorFlagsTbl;
}

[StructLayout(LayoutKind.Explicit, Size = 0x88)] 
public unsafe struct UFldDungeonFloorFlags
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x188)] 
public unsafe struct UFldDungeonForbiddenDoorController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0158)] public AFldDungeonPartActor* m_pForbiddenDoor;
    [FieldOffset(0x0160)] public TArray<IntPtr> m_LayoutActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct AFldDungeonInfoActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public EDungeonInfoType Type;
}

[StructLayout(LayoutKind.Explicit, Size = 0x288)] 
public unsafe struct AFldDungeonObjectInfoActor
{
    [FieldOffset(0x0000)] public AFldDungeonInfoActor baseObj;
    [FieldOffset(0x0280)] public EDungeonObjectInfoType ObjectType;
}

[StructLayout(LayoutKind.Explicit, Size = 0x158)] 
public unsafe struct UFldDungeonInfoSupportController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x298)] 
public unsafe struct AFldDungeonLayoutActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public ELayoutType LayoutType;
    [FieldOffset(0x0279)] public ELayoutUsageType UsageType;
    [FieldOffset(0x027A)] public ELayoutGroup GroupNo;
    [FieldOffset(0x027B)] public ELayoutDirType Dir;
    [FieldOffset(0x0280)] public TArray<int> SpawnSelNo;
    [FieldOffset(0x0290)] public bool Wall;
    [FieldOffset(0x0291)] public bool EventSpace;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct AFldDungeonLayoutStartActor
{
    [FieldOffset(0x0000)] public AFldDungeonLayoutActor baseObj;
    [FieldOffset(0x0298)] public ELayoutStartType StartType;
    [FieldOffset(0x029C)] public int FreeID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct AFldDungeonLayoutEnemyActor
{
    [FieldOffset(0x0000)] public AFldDungeonLayoutActor baseObj;
    [FieldOffset(0x0298)] public EDungeonEnemyType EnemyType;
    [FieldOffset(0x029C)] public int EncountID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A8)] 
public unsafe struct AFldDungeonLayoutDirectActor
{
    [FieldOffset(0x0000)] public AFldDungeonLayoutActor baseObj;
    [FieldOffset(0x0298)] public int LayoutId;
    [FieldOffset(0x029C)] public int Eigenvalue;
    [FieldOffset(0x02A0)] public bool GateKeeper;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B8)] 
public unsafe struct AFldDungeonLayoutDirectEnemyActor
{
    [FieldOffset(0x0000)] public AFldDungeonLayoutDirectActor baseObj;
    [FieldOffset(0x02A8)] public uint ModelID;
    [FieldOffset(0x02AC)] public uint SymbolID;
    [FieldOffset(0x02B0)] public uint DefeatFlagID;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2C0)] 
public unsafe struct AFldDungeonLayoutDirectTBoxActor
{
    [FieldOffset(0x0000)] public AFldDungeonLayoutDirectActor baseObj;
    [FieldOffset(0x02A8)] public EDungeonTBoxType tboxType;
    [FieldOffset(0x02AC)] public uint money;
    [FieldOffset(0x02B0)] public bool Encount;
    [FieldOffset(0x02B1)] public bool CheckFlag;
    [FieldOffset(0x02B4)] public FName FlagName;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A0)] 
public unsafe struct AFldDungeonLayoutBrokenActor
{
    [FieldOffset(0x0000)] public AFldDungeonLayoutActor baseObj;
    [FieldOffset(0x0298)] public bool Empty;
    [FieldOffset(0x029C)] public int Probability;
}

[StructLayout(LayoutKind.Explicit, Size = 0x340)] 
public unsafe struct AFldDungeonLoader
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2B8)] 
public unsafe struct AFldDungeonMenuScript
{
    [FieldOffset(0x0000)] public AFldScriptManagerCore baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x170)] 
public unsafe struct UFldDungeonMissingController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0148)] public ANpcBaseCore* m_pMissingPerson;
    [FieldOffset(0x0150)] public AFldDungeonSoundBaseActor* m_pMisNpcSE;
    [FieldOffset(0x0160)] public AFldDungeonPartActor* m_pPartRoom;
}

[StructLayout(LayoutKind.Explicit, Size = 0x348)] 
public unsafe struct AFldDungeonObjectActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public EDungeonObjType ObjType;
    [FieldOffset(0x0280)] public FSoftObjectPath BaseObject;
    [FieldOffset(0x0298)] public int InitAnimNo;
    [FieldOffset(0x029C)] public int HitAnimNo;
    [FieldOffset(0x02A0)] public int EndAnimNo;
    [FieldOffset(0x02B8)] public AFldDungeonObjectActor* m_pBaseObject;
    [FieldOffset(0x02C0)] public TArray<IntPtr> m_pHitActorList;
    [FieldOffset(0x02E0)] public TArray<IntPtr> m_AnimObjList;
    [FieldOffset(0x02F8)] public UBoxComponent* m_pBox;
    [FieldOffset(0x0308)] public TArray<IntPtr> m_pLightComps;
}

[StructLayout(LayoutKind.Explicit, Size = 0x14)] 
public unsafe struct FDungeonTrophyValue
{
    [FieldOffset(0x0000)] public FName CounterName;
    [FieldOffset(0x0008)] public FName Name;
    [FieldOffset(0x0010)] public int CountMax;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FDungeonResetData
{
    [FieldOffset(0x0000)] public EDungeonResetDataType DataType;
    [FieldOffset(0x0004)] public FName DataName;
    [FieldOffset(0x000C)] public int DataState;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FDungeonResetList
{
    [FieldOffset(0x0000)] public TArray<FDungeonResetData> ResetData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FDungeonPartConnectInfoData
{
    [FieldOffset(0x0000)] public bool ConnectUp;
    [FieldOffset(0x0001)] public bool ConnectLeft;
    [FieldOffset(0x0002)] public bool ConnectDown;
    [FieldOffset(0x0003)] public bool ConnectRight;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FDungeonPartOpenInfoData
{
    [FieldOffset(0x0000)] public float ConnectPartOpenDistance;
    [FieldOffset(0x0004)] public int SeparatelyNextFloorOpenNum;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FDungeonLightAttenuationData
{
    [FieldOffset(0x0000)] public float StartDist;
    [FieldOffset(0x0004)] public float EndDist;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FDungeonUROParamData
{
    [FieldOffset(0x0000)] public TArray<float> ThresholdSizeList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x4)] 
public unsafe struct FDungeonBrokenObjData
{
    [FieldOffset(0x0000)] public int FragmentProbability;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct FDungeonFDoorAppearanceData
{
    [FieldOffset(0x0000)] public TArray<int> MagValue_SAreaDiff;
    [FieldOffset(0x0010)] public int MagDecValue_Floor;
    [FieldOffset(0x0014)] public int MagIncAddValue;
    [FieldOffset(0x0018)] public FVector PartPos;
}

[StructLayout(LayoutKind.Explicit, Size = 0x8)] 
public unsafe struct FDungeonEnemyModelIDData
{
    [FieldOffset(0x0000)] public int majorId;
    [FieldOffset(0x0004)] public int minorId;
}

[StructLayout(LayoutKind.Explicit, Size = 0xC)] 
public unsafe struct FDungeonEnemyModelParamData
{
    [FieldOffset(0x0000)] public float ScaleX;
    [FieldOffset(0x0004)] public float ScaleY;
    [FieldOffset(0x0008)] public float ScaleZ;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FDungeonMDoorEncountIDData
{
    [FieldOffset(0x0000)] public TArray<int> Minor00;
    [FieldOffset(0x0010)] public TArray<int> Minor01;
}

[StructLayout(LayoutKind.Explicit, Size = 0x30)] 
public unsafe struct FDungeonPathData
{
    [FieldOffset(0x0000)] public int majorId;
    [FieldOffset(0x0004)] public int minorId;
    [FieldOffset(0x0008)] public FSoftObjectPath Path;
    [FieldOffset(0x0020)] public FString StrPath;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FDungeonPathList
{
    [FieldOffset(0x0000)] public TArray<FDungeonPathData> PathData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FDungeonPathGroupList
{
    [FieldOffset(0x0000)] public TArray<FDungeonPathList> GroupList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3D8)] 
public unsafe struct FDungeonParamDataTableRow
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public TMap<EDungeonTrophyType, FDungeonTrophyValue> TrophyValue;
    [FieldOffset(0x0058)] public TMap<EDungeonResetTiming, FDungeonResetList> ResetTimingData;
    [FieldOffset(0x00A8)] public TMap<EPartType, FDungeonPartConnectInfoData> PartConnectInfo;
    [FieldOffset(0x00F8)] public FDungeonPartOpenInfoData PartOpenInfo;
    [FieldOffset(0x0100)] public TMap<int, FDungeonLightAttenuationData> PartLightAttenuationData;
    [FieldOffset(0x0150)] public FDungeonLightAttenuationData ObjectLightAttenuationData;
    [FieldOffset(0x0158)] public FDungeonUROParamData PartUROParamData;
    [FieldOffset(0x0168)] public FDungeonUROParamData ObjectUROParamData;
    [FieldOffset(0x0178)] public FDungeonBrokenObjData BrokenObjData;
    [FieldOffset(0x0180)] public FDungeonFDoorAppearanceData FDoorAppearanceData;
    [FieldOffset(0x01A8)] public TMap<int, FDungeonEnemyModelIDData> EnemyModelID;
    [FieldOffset(0x01F8)] public TMap<int, FDungeonEnemyModelParamData> EnemyModelParamData;
    [FieldOffset(0x0248)] public TMap<int, int> MDoorBuildID;
    [FieldOffset(0x0298)] public TMap<int, FDungeonMDoorEncountIDData> MDoorEncountID;
    [FieldOffset(0x02E8)] public TMap<int, EDungeonMisNpcType> MisNpcType;
    [FieldOffset(0x0338)] public TMap<EDungeonPathType, FDungeonPathGroupList> DataPath;
    [FieldOffset(0x0388)] public TMap<EDungeonLevelPathType, FDungeonPathList> LevelPath;
}

[StructLayout(LayoutKind.Explicit, Size = 0x408)] 
public unsafe struct UFldDungeonParamDataAsset
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
    [FieldOffset(0x0030)] public FDungeonParamDataTableRow ParamData;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2F0)] 
public unsafe struct AFldDungeonParamActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public FSoftObjectPath DataAsset;
    [FieldOffset(0x0290)] public FSoftObjectPath DungeonTable;
    [FieldOffset(0x02A8)] public FSoftObjectPath PartVariationData;
    [FieldOffset(0x02C0)] public FSoftObjectPath FloorFlagsData;
    [FieldOffset(0x02E0)] public UFldDungeonPartVariation* m_pPartVariation;
    [FieldOffset(0x02E8)] public UFldDungeonFloorFlags* m_pFloorFlags;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C0)] 
public unsafe struct UFldDungeonPartController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0148)] public TArray<IntPtr> m_PartActor;
    [FieldOffset(0x0158)] public TArray<IntPtr> m_WallActor;
    [FieldOffset(0x0168)] public TArray<IntPtr> m_PartActorRef;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3C8)] 
public unsafe struct AFldDungeonPartActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public EPartType PartType;
    [FieldOffset(0x027C)] public int PartVariation;
    [FieldOffset(0x0280)] public EPartDirType PartDirType;
    [FieldOffset(0x0281)] public bool ForbiddenDoor;
    [FieldOffset(0x0282)] public bool MonadPassage;
    [FieldOffset(0x0283)] public bool ExclusivelyForEvent;
    [FieldOffset(0x02D8)] public TArray<IntPtr> m_LayoutActor;
    [FieldOffset(0x02E8)] public TArray<IntPtr> m_pLayoutStart;
    [FieldOffset(0x02F8)] public TArray<IntPtr> m_pLayoutEnemy;
    [FieldOffset(0x0308)] public TArray<IntPtr> m_LayoutEnemyPath;
    [FieldOffset(0x0318)] public TArray<IntPtr> m_LayoutTBox;
    [FieldOffset(0x0328)] public AFldDungeonLayoutActor* m_pLayoutRetDev;
    [FieldOffset(0x0338)] public AFldDungeonLayoutActor* m_pLayoutNPC;
    [FieldOffset(0x0340)] public AFldDungeonLayoutActor* m_pLayoutReaper;
    [FieldOffset(0x0348)] public AFldDungeonLayoutActor* m_pLayoutClock;
    [FieldOffset(0x0350)] public AFldDungeonLayoutActor* m_pLayoutSecretGate;
    [FieldOffset(0x0370)] public TArray<IntPtr> m_ObjectInfoActor;
    [FieldOffset(0x0388)] public TArray<IntPtr> m_pSKMeshComps;
    [FieldOffset(0x0398)] public TArray<IntPtr> m_pLightComps;
}

[StructLayout(LayoutKind.Explicit, Size = 0x3D0)] 
public unsafe struct AFldDungeonFDoorPartActor
{
    [FieldOffset(0x0000)] public AFldDungeonPartActor baseObj;
    [FieldOffset(0x03C8)] public int FDoorGroupNum;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1D8)] 
public unsafe struct UFldDungeonPartnerController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0148)] public TArray<FFldPartnerHolder> m_Partners;
    [FieldOffset(0x0158)] public TArray<IntPtr> m_StartList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x18)] 
public unsafe struct FDungeonPartVariationData
{
    [FieldOffset(0x0000)] public EPartType PartType;
    [FieldOffset(0x0008)] public TArray<byte> VariationNo;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct FDungeonPartVariationDataTableRow
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public TArray<FDungeonPartVariationData> VarNoList;
    [FieldOffset(0x0018)] public TArray<FDungeonPartVariationData> FixedVarNoList;
    [FieldOffset(0x0028)] public TArray<FDungeonPartVariationData> MonadVarNoList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FDungeonPartFDoorTypeDataTableRow
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public TArray<FDungeonPartVariationData> TypeList;
    [FieldOffset(0x0018)] public int VarNo;
}

[StructLayout(LayoutKind.Explicit, Size = 0x20)] 
public unsafe struct FDungeonPartMisRoomTypeDataTableRow
{
    [FieldOffset(0x0000)] public FTableRowBase baseObj;
    [FieldOffset(0x0008)] public TArray<FDungeonPartVariationData> TypeList;
    [FieldOffset(0x0018)] public int VarNo;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1C0)] 
public unsafe struct UFldDungeonPartVariationDataAsset
{
    [FieldOffset(0x0000)] public UDataAsset baseObj;
    [FieldOffset(0x0030)] public FDungeonPartVariationDataTableRow Area1;
    [FieldOffset(0x0068)] public FDungeonPartVariationDataTableRow Area2;
    [FieldOffset(0x00A0)] public FDungeonPartVariationDataTableRow Area3;
    [FieldOffset(0x00D8)] public FDungeonPartVariationDataTableRow Area4;
    [FieldOffset(0x0110)] public FDungeonPartVariationDataTableRow Area5;
    [FieldOffset(0x0148)] public FDungeonPartVariationDataTableRow Area6;
    [FieldOffset(0x0180)] public FDungeonPartFDoorTypeDataTableRow FDoorTypeTbl;
    [FieldOffset(0x01A0)] public FDungeonPartMisRoomTypeDataTableRow MisRoomTypeTbl;
}

[StructLayout(LayoutKind.Explicit, Size = 0x28)] 
public unsafe struct UFldDungeonPartVariation
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x168)] 
public unsafe struct UFldDungeonReaperController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0160)] public AFldDungeonEffectCameraAttachActor* m_pEffect;
}

[StructLayout(LayoutKind.Explicit, Size = 0x160)] 
public unsafe struct UFldDungeonRecoverController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0158)] public UNiagaraCameraAttachComponent* m_pEffectCameraAttach;
}

[StructLayout(LayoutKind.Explicit, Size = 0x360)] 
public unsafe struct AFldDungeonResourceServer
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x158)] 
public unsafe struct UFldDungeonSecretGateController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0148)] public AFldDungeonObjectActor* m_SecretGateActor;
    [FieldOffset(0x0150)] public AFldDungeonLayoutActor* m_pLayoutSecretGate;
}

[StructLayout(LayoutKind.Explicit, Size = 0x1A0)] 
public unsafe struct UFldDungeonSeparatelyController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x150)] 
public unsafe struct UFldDungeonSetupController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct AFldDungeonSoundBaseActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
    [FieldOffset(0x0278)] public EDungeonSuondType Type;
}

[StructLayout(LayoutKind.Explicit, Size = 0x2A8)] 
public unsafe struct AFldDungeonSoundActor
{
    [FieldOffset(0x0000)] public AFldDungeonSoundBaseActor baseObj;
    [FieldOffset(0x0280)] public TArray<int> CueIDList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x38)] 
public unsafe struct UFldDungeonStartParam
{
    [FieldOffset(0x0000)] public UObject baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x280)] 
public unsafe struct AFldDungeonStartActor
{
    [FieldOffset(0x0000)] public AAppActor baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x178)] 
public unsafe struct UFldDungeonSupportSkillController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0148)] public TArray<IntPtr> m_pEffectList;
}

[StructLayout(LayoutKind.Explicit, Size = 0x180)] 
public unsafe struct UFldDungeonTalkController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
}

[StructLayout(LayoutKind.Explicit, Size = 0x210)] 
public unsafe struct UFldDungeonTBoxController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0148)] public TArray<IntPtr> m_TBoxActor;
    [FieldOffset(0x0158)] public TArray<IntPtr> m_TBoxSE;
    [FieldOffset(0x0170)] public AFldDungeonObjectActor* m_HitTBox;
}

[StructLayout(LayoutKind.Explicit, Size = 0x170)] 
public unsafe struct UFldDungeonTransferController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0148)] public AFldDungeonObjectActor* m_ReturnActor;
    [FieldOffset(0x0150)] public AFldDungeonObjectActor* m_pFixedReturn;
    [FieldOffset(0x0158)] public AFldDungeonObjectActor* m_pFixedTransfer;
    [FieldOffset(0x0160)] public AFldDungeonPartActor* m_pPartActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x160)] 
public unsafe struct UFldDungeonUIController
{
    [FieldOffset(0x0000)] public UFldDungeonComponentBase baseObj;
    [FieldOffset(0x0148)] public TArray<IntPtr> m_UIActor;
}

[StructLayout(LayoutKind.Explicit, Size = 0x10)] 
public unsafe struct FDungeonUIBaseData
{
    [FieldOffset(0x0000)] public FName Name;
